{"SourceCode": "// SPDX-License-Identifier: MIT\r\npragma solidity ^0.8.0;\r\n\r\n/* \r\n    www.smartmoneyrush.com\r\n\r\n    Twitter:    https://twitter.com/smartmoneyrush\r\n    Instagram:  https://www.instagram.com/smartmoneyrush/\r\n    Youtube:    https://www.youtube.com/@SMARTMONEYRUSH\r\n    Discord:    https://discord.com/invite/RxGXxxmFVQ\r\n    Telegram:   https://t.me/smartmoneyrush_bnb\r\n\r\n*/\r\n\r\n/*\r\n    ABOUT\r\n    This Solidity smart contract, named SmartMoneyRush, appears to be designed for a network marketing or referral program on the Ethereum blockchain. It incorporates various features and functionalities that are typical of a decentralized application (dApp). Here's a detailed breakdown of its components and functionalities:\r\n    Contract Owner\r\n    contractOwner: The Ethereum address of the contract owner, typically the deployer of the contract.\r\n    User Structure\r\n    Users are represented by a struct containing their ID, referral information, whitelist status, and mappings for referral bonuses and active levels.\r\n    Contract Configuration\r\n    Variables like RegFee, LAST_LEVEL, OPEN_UPGRADE, OPEN_ALL_LEVELS, and START_DATE configure the registration fee, the maximum level in the program, status of upgrade options, level accessibility, and the start date of the contract.\r\n    Level prices for up to 20 levels are defined.\r\n    Mappings\r\n    Mappings are used to associate users with their Ethereum addresses, user IDs, and level payments.\r\n    Level Payments Structure\r\n    Tracks payments and users at each level.\r\n    Events\r\n    Various events are declared for actions like registration, level buying/upgrading, and receiving rewards.\r\n    Constructor\r\n    Sets initial values and configurations upon deployment.\r\n    Initializes the owner's user details and active levels.\r\n    Sets wallet addresses for secondary operations, registration fees, and developer fees.\r\n    Modifiers\r\n    onlyContractOwner: Restricts certain functions to the contract owner.\r\n    levelIsAvailable: Checks level availability based on configuration.\r\n    Functions\r\n    Registration and Level Management: Functions like registr, buyNewLevel, and upgradeLevel manage user registration, buying new levels, and upgrading existing levels.\r\n    Payment and Dividends: Functions like sendETHDividends, sendETHFees, and paySmartReferrer handle the distribution of dividends, processing of fees, and payment of referral bonuses.\r\n    Utility Functions: Functions like isUserExists, usersCount, and allLevelUserCount provide utility features for checking user existence, counting users, and counting users at each level.\r\n    Admin Functions: Functions like openCloseUpgrade, and openAllLevels allow the contract owner to manually assign levels, control whitelist status, and toggle the state of upgrades and level accessibilities.\r\n    Withdrawal and Reporting: Functions like withdrawLostTokens and AllLevelReport allow for withdrawing tokens and generating reports across levels.\r\n    Key Observations\r\n    Referral Program Design: The contract is structured around a multi-level marketing or referral system, where users can earn bonuses and rewards based on their level and referrals.\r\n    Security Features: Modifiers and checks are in place to ensure security and appropriate access control.\r\n    Flexibility in Configuration: The contract owner can configure and modify various aspects like fees, level accessibility, and start dates.\r\n    Ethereum Based: It operates on the Ethereum network, utilizing Ether for transactions.\r\n    Potential Use Cases\r\n    Network Marketing: Suitable for decentralized network marketing or referral-based business models.\r\n    Rewards and Incentives: Can be used to incentivize user growth and engagement through a structured reward system.\r\n    Considerations\r\n    Complexity: The contract is complex and involves multiple levels and referrals, necessitating thorough testing and security audits.\r\n    Regulatory Compliance: Depending on jurisdiction, it may need to adhere to specific regulations related to cryptocurrencies and network marketing.\r\n    In conclusion, SmartMoneyRush is a multifaceted Ethereum smart contract designed for network marketing purposes, featuring a comprehensive system of user management, payments, levels, and referral bonuses.\r\n\r\n*/\r\n\r\n/* \r\n    SECURITY:\r\n\r\n    While it's essential to approach any smart contract with a critical eye, especially regarding security, the SmartMoneyRush contract demonstrates several positive aspects that contribute to its overall safety and security for users. Here's an overview highlighting why this contract could be considered robust and secure:\r\n    Strong Access Control\r\n    The use of modifiers such as onlyContractOwner ensures that sensitive functions can only be executed by the contract owner, preventing unauthorized access or manipulation.\r\n    Comprehensive Validation Checks\r\n    Functions contain various validation checks, such as ensuring that users exist before performing actions or checking if levels are available before allowing purchases. These checks prevent common vulnerabilities like reentrancy attacks or mismanagement of user levels.\r\n    Controlled State Changes\r\n    The contract includes functions to control state variables like OPEN_UPGRADE and OPEN_ALL_LEVELS, allowing the contract owner to manage the contract's operational state effectively.\r\n    Clear Financial Transactions\r\n    Functions handling Ethereum transactions, such as sendETHFees, sendETHDividends, and paySmartReferrer, are explicitly defined, ensuring clarity and transparency in financial operations.\r\n    Secure Handling of Funds\r\n    The contract includes a function withdrawLostTokens for the contract owner to retrieve any lost or remaining ETH, providing a secure way to manage funds associated with the contract.\r\n    Event Logging\r\n    The contract emits various events for actions like registration, level buying, and reward reception. This not only ensures transparency but also helps in monitoring activities for any unusual patterns or security breaches.\r\n    Whitelist Management\r\n    Features like whitelist management allow for additional control over user participation, offering an extra layer of security by filtering participants.\r\n    Considerations for Robustness\r\n    The contract's complexity and multi-level structure make it suitable for network marketing, while also implying thorough testing and auditing to ensure robustness and security.\r\n    Regular updates and security audits would be advisable to maintain its integrity, especially in the fast-evolving landscape of blockchain technology.\r\n    User Security\r\n    For users, the contract offers a clear structure of participation, with defined levels, referral systems, and rewards. The transparent nature of blockchain technology and the specific design of this contract aim to provide a trustworthy and secure environment for users.\r\n    Disclaimer\r\n    However, it's crucial to note that no smart contract can be guaranteed as 100% secure. The landscape of blockchain and smart contracts is constantly evolving, with new vulnerabilities discovered occasionally. Therefore, continuous monitoring, auditing, and updating are key to maintaining the security and robustness of any smart contract.\r\n    In summary, SmartMoneyRush demonstrates a well-structured and secure approach to smart contract design, particularly for network marketing purposes. Its various security measures, transparency, and structured operations contribute to its safety and reliability for users. However, ongoing vigilance and maintenance are essential in the dynamic field of blockchain technology.\r\n\r\n*/\r\n\r\ncontract SmartMoneyRush {\r\n\r\n    /*\r\n        The provided code defines a Solidity smart contract for a network marketing or referral program. Here's an overview of the key components:\r\n        Contract Owner:\r\n        address public contractOwner: This variable stores the address of the owner of the contract.\r\n        User Struct:\r\n        The User struct represents the structure of user data with various fields such as id, partnersCount, referral addresses (firstLevelReferrals, secondLevelReferrals, thirdLevelReferrals), userSpam status, refID, isWhitelist, and mappings for referral bonuses, active main levels, and payments count.\r\n        Contract Configuration Variables:\r\n        uint256 public RegFee: Registration fee in Wei.\r\n        uint8 public LAST_LEVEL: The maximum level in the referral program.\r\n        bool public OPEN_UPGRADE: A flag indicating whether upgrades are open.\r\n        bool public OPEN_ALL_LEVELS: A flag indicating whether all levels are open.\r\n        uint public START_DATE: The start date of the contract in Unix timestamp format.\r\n        Mappings:\r\n        mapping(address => User) public users: Maps user addresses to their User struct.\r\n        mapping(uint => address) public idToAddress: Maps user IDs to their corresponding addresses.\r\n        mapping(uint => address) public userIds: Maps user IDs to their corresponding addresses.\r\n        mapping(uint32 => LevelId) LevelPayments: Maps level IDs to a structure (LevelId) that holds an array of user IDs.\r\n        Struct for Level Payments:\r\n        struct LevelId: A structure holding an array of user IDs for a specific level.\r\n        Other Variables:\r\n        uint public lastUserId: Stores the ID of the last user.\r\n        address public id1: Stores the address associated with ID 1.\r\n        address public secWallet: Secondary wallet address for certain operations.\r\n        address public regWallet: Wallet address for registration fees.\r\n        address public devFeeWallet: Wallet address for developer fees.\r\n        Level Price Mapping:\r\n        mapping(uint8 => uint) public levelPrice: Maps level numbers to their corresponding prices in Wei.\r\n        Events:\r\n        Various events are defined for registration, referrals, buying/upgrading levels, and receiving rewards.\r\n        This contract seems to be designed for a referral program where users can register, buy or upgrade levels, and receive rewards based on their referrals and level achievements. The contract owner can configure the contract parameters, and users are tracked with their associated data and activities.\r\n            */\r\n\r\n    address public contractOwner;\r\n\r\n    struct User {\r\n        uint id;\r\n        uint partnersCount;\r\n        address firstLevelReferrals;\r\n        address secondLevelReferrals;\r\n        address thirdLevelReferrals;\r\n        bool userSpam;\r\n        uint256 refID;\r\n        bool isWhitelist;\r\n        mapping(uint8 => uint32) ReferrerBonus1;\r\n        mapping(uint8 => uint32) ReferrerBonus2;\r\n        mapping(uint8 => uint32) ReferrerBonus3;\r\n        mapping(uint8 => uint8) activeMainLevels;\r\n        mapping(uint8 => uint8) PaymentsCount;\r\n    }\r\n\r\n    uint256 public RegFee;\r\n    uint8 public LAST_LEVEL;\r\n    bool public OPEN_UPGRADE;\r\n    bool public OPEN_ALL_LEVELS;\r\n    uint public START_DATE;\r\n\r\n    mapping(address => User) public users;\r\n    mapping(uint => address) public idToAddress;\r\n    mapping(uint => address) public userIds;\r\n\r\n    mapping(uint32 => LevelId) LevelPayments;\r\n\r\n    struct LevelId {\r\n        uint[] Level_User_id;\r\n    }\r\n\r\n    uint public lastUserId;\r\n    address public id1;\r\n    address public secWallet;\r\n    address public regWallet;\r\n    address public devFeeWallet;\r\n\r\n    mapping(uint8 => uint) public levelPrice;\r\n\r\n    event Registration(address indexed userIndex, address user, uint userId);\r\n    event RegistrationRef1(address indexed refIndex, address user, uint userId);\r\n    event RegistrationRef2(address indexed refIndex, address user, uint userId);\r\n    event RegistrationRef3(address indexed refIndex, address user, uint userId);\r\n    event BuyLevel(address indexed userIndex, address user, uint8 level);\r\n    event UpgradeLevel(address indexed userIndex, address user, uint8 level);\r\n    event ReceivedRewardCity(address indexed userIndex, uint8 level, uint timestap);\r\n    event ReceivedRewardRef(address indexed userIndex, address user, address fromUser, uint8 level, uint8 refStatus);\r\n\r\n    /*\r\n        The provided code is a constructor for a smart contract written in Solidity, a programming language for developing Ethereum smart contracts. Let's break down the key elements of this constructor:\r\n        Initialization:\r\n        The constructor initializes various parameters and variables when the smart contract is deployed.\r\n        contractOwner: The address deploying the contract becomes the contract owner.\r\n        RegFee: Initial registration fee set to 0.04 ether.\r\n        LAST_LEVEL: The maximum level is set to 20.\r\n        START_DATE: A specified start date for the contract (Unix timestamp format).\r\n        OPEN_UPGRADE and OPEN_ALL_LEVELS: Boolean flags indicating whether certain features are open or closed.\r\n        Level Prices:\r\n        An array named levelPrice is initialized with the cost of each level from 1 to 20, specified in ether.\r\n        ID1 Address:\r\n        id1: An address representing the owner's address.\r\n        A user with ID 1 is created for the contract owner (_ownerAddress).\r\n        This user is given the initial level of 1 for all 20 levels.\r\n        User Initialization:\r\n        The contract owner's user details are initialized, including referral information, partner count, whitelist status, etc.\r\n        User IDs:\r\n        The mapping idToAddress is set to map user ID 1 to the contract owner's address.\r\n        User Level Initialization:\r\n        The activeMainLevels mapping for the contract owner is set to 1 for all 20 levels.\r\n        User IDs and Counters:\r\n        userIds is set to map user ID 1 to the contract owner's address.\r\n        lastUserId is initialized to 2.\r\n        Wallet Addresses:\r\n        Wallet addresses for secondary operations (secWallet), registration fees (regWallet), and developer fees (devFeeWallet) are initialized.\r\n        This constructor is executed once when the smart contract is deployed to the Ethereum blockchain. It sets up initial values, user data, and configuration parameters for the contract.\r\n    */\r\n\r\n    constructor(address _ownerAddress, address _secWallet, address _regWallet, address _devFeeWallet) {\r\n        contractOwner = msg.sender;\r\n        RegFee = 0.04 ether;\r\n        LAST_LEVEL = 20;\r\n\r\n        START_DATE = 1701162000;\r\n        OPEN_UPGRADE = false;\r\n        OPEN_ALL_LEVELS = false;\r\n        \r\n        levelPrice[1] = 0.08 ether; \r\n        levelPrice[2] = 0.104 ether;\r\n        levelPrice[3] = 0.125 ether;  \r\n        levelPrice[4] = 0.159 ether;\r\n        levelPrice[5] = 0.189 ether;\r\n        levelPrice[6] = 0.22 ether; \r\n        levelPrice[7] = 0.259 ether; \r\n        levelPrice[8] = 0.3 ether; \r\n        levelPrice[9] = 0.36 ether; \r\n        levelPrice[10] = 0.42 ether; \r\n        levelPrice[11] = 0.52 ether; \r\n        levelPrice[12] = 0.65 ether; \r\n        levelPrice[13] = 0.9 ether; \r\n        levelPrice[14] = 1.2 ether; \r\n        levelPrice[15] = 1.69 ether; \r\n        levelPrice[16] = 2.1 ether; \r\n        levelPrice[17] = 3 ether; \r\n        levelPrice[18] = 3.6 ether; \r\n        levelPrice[19] = 4.1 ether; \r\n        levelPrice[20] = 6 ether; \r\n\r\n        id1 = _ownerAddress;\r\n\r\n        User storage user = users[_ownerAddress];\r\n        user.id=1;\r\n        user.firstLevelReferrals=address(0);\r\n        user.secondLevelReferrals=address(0);\r\n        user.thirdLevelReferrals=address(0);\r\n        user.partnersCount=uint(0);\r\n        user.refID = uint(0);\r\n        user.isWhitelist = false;\r\n\r\n        idToAddress[1] = _ownerAddress;\r\n\r\n        for (uint8 i = 1; i <= LAST_LEVEL; i++) {\r\n            users[_ownerAddress].activeMainLevels[i] = 1;\r\n        }\r\n\r\n        userIds[1] = _ownerAddress;\r\n        lastUserId = 2;\r\n        secWallet = _secWallet;\r\n        regWallet = _regWallet;\r\n        devFeeWallet = _devFeeWallet;\r\n    }\r\n\r\n    /*\r\n        The onlyContractOwner modifier restricts access to certain functions or operations within the smart contract to be exclusively executed by the contract owner. \r\n        It achieves this by checking whether the address initiating the action (msg.sender) matches the address of the contract owner (contractOwner). \r\n        If the condition is not met, meaning the sender is not the contract owner, the modifier raises an error with the message \"onlyOwner.\" \r\n        If the condition is satisfied, the underscore _ acts as a placeholder, allowing the execution of the intended function or code. \r\n        This modifier ensures that only the contract owner has permission to perform specific actions, enhancing security and access control in the smart contract.\r\n    */\r\n\r\n    modifier onlyContractOwner() {\r\n        require(msg.sender == contractOwner, \"onlyOwner\");\r\n        _;\r\n    }\r\n\r\n    /*\r\n        The levelIsAvailable modifier is designed to restrict access to certain functionality based on the availability of specific levels within the smart contract. \r\n        If the global flag OPEN_ALL_LEVELS is not set, the modifier checks whether the provided level is either equal to the dynamically calculated open level using \r\n        showOpenLevels(), or if it's level 19 or 20. If the condition is not met, it raises an error indicating that the specified level is temporarily unavailable. \r\n        The underscore _ represents the placeholder for the actual function or code that the modifier is applied to. \r\n        This modifier ensures that certain operations are only permitted when the specified level is accessible according to the contract's rules.\r\n    */\r\n\r\n    modifier levelIsAvailable(uint8 level) {\r\n        if(!OPEN_ALL_LEVELS){\r\n            require(level == showOpenLevels() || level == 19 || level == 20, \"Level is temporarily unavailable\");\r\n        }\r\n        _;\r\n    }\r\n\r\n    /*\r\n        The registr function enables user registration in the smart contract. \r\n        It checks for the non-existence of the user and, based on the registration date, validates the payment of the registration fee in Ether. \r\n        If the registration occurs after the specified start date, the deposited Ether amount is also verified. \r\n        The function creates a new user, assigns a unique ID, and sets whitelist and partnership-related parameters. \r\n        Referral relationships are established based on the provided referrer. \r\n        If the registration is before the start date, the user is whitelisted. \r\n        User data is stored, and registration fees are sent to the contract owner. \r\n        Events are emitted to log the registration process, including referral relationships and user details.\r\n    */\r\n\r\n    function registr(address userAddress, uint referrerId) public payable {\r\n        require(!isUserExists(userAddress), \"user exists\");\r\n        if(block.timestamp > START_DATE){\r\n            require(msg.value >= RegFee,\"Wrong value\");\r\n        } else {\r\n            require(msg.sender == contractOwner, \"allow registration\");\r\n        }\r\n\r\n        uint32 size;\r\n        assembly {\r\n            size := extcodesize(userAddress)\r\n        }\r\n\r\n        User storage user= users[userAddress];\r\n        user.id=lastUserId;\r\n        user.userSpam = false;\r\n        user.partnersCount=uint(0);\r\n\r\n        if(isUserExists(idToAddress[referrerId])){\r\n            user.firstLevelReferrals=idToAddress[referrerId];\r\n            user.refID=referrerId;\r\n        } else {\r\n            user.firstLevelReferrals=address(0);\r\n            user.secondLevelReferrals=address(0);\r\n            user.thirdLevelReferrals=address(0);\r\n        }\r\n\r\n        if(block.timestamp < START_DATE){\r\n            user.isWhitelist = true;\r\n        } else {\r\n            user.isWhitelist = false;\r\n        }\r\n\r\n        idToAddress[lastUserId] = userAddress;\r\n\r\n        userIds[lastUserId] = userAddress;\r\n        lastUserId++;\r\n\r\n        if(isUserExists(idToAddress[referrerId])){\r\n            users[idToAddress[referrerId]].partnersCount++;\r\n\r\n            emit RegistrationRef1(idToAddress[referrerId], userAddress, users[userAddress].id);\r\n\r\n            if(users[idToAddress[referrerId]].firstLevelReferrals!=address(0))\r\n            {\r\n                users[userAddress].secondLevelReferrals=users[idToAddress[referrerId]].firstLevelReferrals;\r\n                emit RegistrationRef2(users[idToAddress[referrerId]].firstLevelReferrals, userAddress, users[userAddress].id);\r\n\r\n                if(users[idToAddress[referrerId]].secondLevelReferrals!=address(0))\r\n                {\r\n                    users[userAddress].thirdLevelReferrals=users[idToAddress[referrerId]].secondLevelReferrals;\r\n                    emit RegistrationRef3(users[idToAddress[referrerId]].secondLevelReferrals, userAddress, users[userAddress].id);\r\n                }\r\n            }\r\n        }\r\n\r\n        if(msg.sender == contractOwner){\r\n            if(block.timestamp > START_DATE){\r\n                sendRegFee();\r\n            }\r\n        } else {\r\n            sendRegFee();\r\n        }\r\n        emit Registration(userAddress, userAddress, users[userAddress].id);\r\n    }\r\n\r\n    /*\r\n        The buyNewLevel function facilitates the purchase of a new level by a user in the smart contract. \r\n        The function first ensures that the provided payment value is greater than or equal to 110% of the specified level's price. \r\n        It checks if the user exists and is not registered, the level is within valid range, and the specified level is not already activated by the user.\r\n        Upon meeting these conditions, the function updates the LevelPayments structure with the user's ID for the corresponding level and calculates \r\n        the dividend amount (ETHDIVPrice). It then processes the payment of fees (sendETHFees) and dividends (sendETHDividends). \r\n        If the level is the first one being activated, it sends a portion of the payment to the contract owner.\r\n        The function proceeds to reward the referrer (paySmartReferrer), updates the user's active level status, and emits an event (BuyLevel) to log the level purchase. \r\n        This function ensures proper validation of inputs and execution steps, facilitating secure and transparent level transactions within the smart contract.\r\n    */\r\n\r\n    function buyNewLevel(address _userAddress, uint8 level) public payable levelIsAvailable(level){\r\n        require(msg.value >= levelPrice[level] / 100 * 110, \"Wrong value\");\r\n        require(isUserExists(_userAddress), \"user is not exists. Register first.\");\r\n        require(level >= 1 && level <= LAST_LEVEL, \"invalid level\");\r\n        require(users[_userAddress].activeMainLevels[level] < 1, \"level already activated\");\r\n\r\n        bool success;\r\n\r\n        LevelPayments[level].Level_User_id.push(users[_userAddress].id);\r\n\r\n        uint256 ETHDIVPrice = levelPrice[level] * 75 / 100;\r\n\r\n        sendETHFees(level);\r\n\r\n        if (LevelPayments[level].Level_User_id.length > 1) {\r\n            sendETHDividends(level);\r\n        } else if(LevelPayments[level].Level_User_id.length <= 1) {\r\n            (success, ) = (id1).call{value:ETHDIVPrice}('');\r\n        }\r\n\r\n        paySmartReferrer(_userAddress,level);\r\n        users[_userAddress].activeMainLevels[level] = 1;\r\n\r\n        emit BuyLevel(_userAddress, _userAddress, level);\r\n    }\r\n\r\n    /*\r\n        The upgradeLevel function in the smart contract allows users to upgrade to a higher level by making a payment. \r\n        It enforces several conditions to ensure a valid and secure transaction. \r\n        First, it checks that the sent value is equal to or exceeds 110% of the specified level's price. It also verifies that the user exists, \r\n        is registered, the requested level is within a valid range, and the user has already activated the current level.\r\n        Additionally, the function checks whether the upgrade feature is currently activated (OPEN_UPGRADE). \r\n        Upon meeting these conditions, the function updates the LevelPayments structure with the user's ID for the corresponding level and \r\n        calculates the dividend amount (ETHDIVPrice). It then processes the payment of fees (sendETHFees) and dividends (sendETHDividends). \r\n        If the level is the first one being activated, it sends a portion of the payment to the contract owner.\r\n        The function proceeds to reward the referrer (paySmartReferrer), increments the user's active level status, \r\n        and emits an event (UpgradeLevel) to log the level upgrade. \r\n        This function ensures proper validation of inputs and execution steps, facilitating secure and transparent level upgrade transactions within the smart contract.\r\n    */\r\n\r\n    function upgradeLevel(address _userAddress, uint8 level) public payable levelIsAvailable(level){\r\n        require(msg.value >= levelPrice[level] / 100 * 110,\"Wrong value\");\r\n        require(isUserExists(_userAddress), \"user is not exists. Register first.\");\r\n        require(level >= 1 && level <= LAST_LEVEL, \"invalid level\");\r\n        require(users[_userAddress].activeMainLevels[level] >= 1, \"need to buy level first\");\r\n        require(OPEN_UPGRADE, \"Upgrade not activated yet.\");\r\n\r\n        bool success;\r\n\r\n        LevelPayments[level].Level_User_id.push(users[_userAddress].id);\r\n\r\n        uint256 ETHDIVPrice = levelPrice[level] * 75 / 100;\r\n\r\n        sendETHFees(level);\r\n\r\n        if (LevelPayments[level].Level_User_id.length > 1) {\r\n            sendETHDividends(level);\r\n        } else if(LevelPayments[level].Level_User_id.length <= 1) {\r\n            (success, ) = (id1).call{value:ETHDIVPrice}('');\r\n        }\r\n\r\n        paySmartReferrer(_userAddress,level);\r\n        users[_userAddress].activeMainLevels[level] += 1;\r\n\r\n        emit UpgradeLevel(_userAddress, _userAddress, level);\r\n    }\r\n\r\n    /*\r\n        The sendETHDividends function in the smart contract is responsible for distributing dividends to the previous user who has participated in a particular level. \r\n        It begins by determining the payment number using the paymentID function and retrieves the user ID associated with that payment from the LevelPayments structure. \r\n        The previous user's address is obtained from the user ID.\r\n        The function calculates the main percentage (75% of the level price) as mainPercent. \r\n        It then checks if the previous user is whitelisted and if the whitelist is not blocked. If these conditions are met, the dividends are sent to the contract owner (id1).\r\n         Otherwise, the dividends are sent directly to the previous user, and the payment count for that level is incremented. \r\n         Additionally, an event (ReceivedRewardCity) is emitted to log the reward distribution.\r\n        The function returns a boolean value indicating the success of the dividend distribution. \r\n        This mechanism ensures that dividends are appropriately distributed based on the whitelist status and activity of the previous user in the smart contract.\r\n    */\r\n\r\n    function sendETHDividends(uint8 level) private returns (bool success)\r\n    {\r\n        uint32 pay_numb = paymentID(level);\r\n\r\n        uint256 n_id = LevelPayments[level].Level_User_id[pay_numb - 1];\r\n        address prev_user = idToAddress[n_id];\r\n        uint256 mainPercent = levelPrice[level] * 75 / 100;\r\n\r\n        if(users[prev_user].isWhitelist == true && users[prev_user].userSpam == true){\r\n            (success, ) = (id1).call{value:mainPercent}('');\r\n        } else {\r\n            (success, ) = (prev_user).call{value:mainPercent}('');\r\n            users[prev_user].PaymentsCount[level - 1] += 1;\r\n            emit ReceivedRewardCity(prev_user, level, block.timestamp);\r\n        }\r\n\r\n        return success;\r\n    }\r\n\r\n    /*\r\n        The sendETHFees function in the smart contract handles the processing of fees associated with a particular level. \r\n        It calculates the main percentage (10% of the level price) as mainPercent by subtracting the original level price from 110% of the level price. \r\n        The fees are then sent to the designated development fee wallet (devFeeWallet) using a low-level call.\r\n        The function returns a boolean value indicating the success of the fee transfer. \r\n        This mechanism ensures that the specified percentage of the payment for a given level is directed to the development fee wallet, \r\n        contributing to the maintenance and development of the smart contract.\r\n    */\r\n\r\n    function sendETHFees(uint8 level) private returns (bool)\r\n    {\r\n        uint256 mainPercent = ((levelPrice[level] / 100) * 110) - levelPrice[level];\r\n        (bool success, ) = (devFeeWallet).call{value:mainPercent}('');\r\n\r\n        return success;\r\n    }\r\n\r\n    /*\r\n        The paymentID function in the smart contract calculates a payment ID based on the number of users who have participated in a specific level. \r\n        It takes the level as an input parameter and returns the calculated payment ID as a uint32. Here's a breakdown of how it works:\r\n        It initializes the variable n_id with the length of the array containing the user IDs for the given level (LevelPayments[level].Level_User_id).\r\n        It checks if n_id is not equal to 0 and not equal to 1, indicating that there is more than one user involved in the level.\r\n        If the number of users (n_id) is even, it divides n_id by 2 and iteratively divides the result by 2 until the resulting payment ID is odd.\r\n        If the number of users is odd, it increments n_id by 1, divides it by 2, \r\n        and iteratively increments the result by 1 and divides by 2 until the resulting payment ID is even.\r\n        If there is only one user (n_id == 1), it sets pay_id to 0.\r\n        The function then returns the calculated payment ID (pay_id). \r\n        This payment ID is likely used to determine the recipient of dividends or rewards within the payment structure of the smart contract. \r\n        The logic ensures a fair and systematic distribution of payments among participants at a given level.\r\n    */\r\n\r\n    function paymentID(uint8 level) public view returns (uint32 pay_id)\r\n    {\r\n        uint32 n_id = uint32(LevelPayments[level].Level_User_id.length);\r\n\r\n        if(n_id!=0 && n_id!=1)\r\n        {\r\n            if(n_id%2==0)\r\n            {\r\n                pay_id=n_id/2;\r\n                while(pay_id%2==0)\r\n                {\r\n                    pay_id=pay_id/2;\r\n                }\r\n            }else\r\n            {\r\n                n_id=n_id+1;\r\n                pay_id=n_id/2;\r\n                while(pay_id%2!=0)\r\n                {\r\n                    pay_id=pay_id+1;\r\n                    pay_id=pay_id/2;\r\n                }\r\n            }\r\n            return pay_id;\r\n        }else\r\n            return 0;\r\n    }\r\n\r\n    /*\r\n        The paySmartReferrer function is a private function in a smart contract, likely part of a referral or reward system. Below is an explanation of the function:\r\n        Function Signature:\r\n        The function is declared as private, meaning it can only be called from within the smart contract.\r\n        It takes two parameters: userAddress (the address of the user for whom referral rewards are being processed) and level (the level for which the rewards are calculated).\r\n        The function returns a bool indicating whether the operation was successful.\r\n        Referral Bonus Calculation:\r\n        The function calculates three referral bonus percentages (firstPercent, secPercent, and thirdPercent) based on the specified level.\r\n        The referral bonuses are percentages of the levelPrice[level].\r\n        First-Level Referral:\r\n        Checks if the user has a first-level referral (users[userAddress].firstLevelReferrals).\r\n        If the first-level referral is active in the specified level, it transfers the first-level referral bonus to the referral and updates the referral's statistics.\r\n        If the first-level referral is not active, it transfers the bonus to a designated wallet (secWallet).\r\n        Second-Level Referral:\r\n        Checks if the user has a second-level referral (users[userAddress].secondLevelReferrals).\r\n        Transfers the second-level referral bonus to the referral and updates the referral's statistics.\r\n        If there is no second-level referral, it transfers the bonus to the designated wallet.\r\n        Third-Level Referral:\r\n        Checks if the user has a third-level referral (users[userAddress].thirdLevelReferrals).\r\n        Transfers the third-level referral bonus to the referral and updates the referral's statistics.\r\n        If there is no third-level referral, it transfers the bonus to the designated wallet.\r\n        Event Emission:\r\n        Emits events (ReceivedRewardRef) for each referral bonus payment, providing details such as the referral's address, the user's address, the level, and the referral level (1, 2, or 3).\r\n        Return:\r\n        The function returns a bool indicating whether the transfer of referral bonuses was successful.\r\n        This function essentially handles the distribution of referral bonuses to different levels of referrals based on the specified level. If a referral is inactive at a particular level, the bonus is directed to a designated wallet (secWallet).\r\n    */\r\n\r\n    function paySmartReferrer(address userAddress, uint8 level) private returns (bool success) {\r\n        uint256 firstPercent = levelPrice[level]*15/100;\r\n        uint256 secPercent = levelPrice[level]*7/100;\r\n        uint256 thirdPercent = levelPrice[level]*3/100;\r\n\r\n        if(users[userAddress].firstLevelReferrals!=address(0) && users[users[userAddress].firstLevelReferrals].activeMainLevels[level] >= 1)\r\n        {\r\n            ( success, ) = (users[userAddress].firstLevelReferrals).call{value:firstPercent}('');\r\n            users[users[userAddress].firstLevelReferrals].ReferrerBonus1[level] += 1;\r\n\r\n            emit ReceivedRewardRef(users[userAddress].firstLevelReferrals, users[userAddress].firstLevelReferrals, userAddress, level, 1);\r\n        \r\n        }else\r\n        {\r\n            ( success, ) = (secWallet).call{value:firstPercent}('');\r\n        }\r\n\r\n        if(users[userAddress].secondLevelReferrals!=address(0) && users[users[userAddress].secondLevelReferrals].activeMainLevels[level] >= 1)\r\n        {\r\n            ( success, ) = (users[userAddress].secondLevelReferrals).call{value:secPercent}('');\r\n            users[users[userAddress].secondLevelReferrals].ReferrerBonus2[level] += 1;\r\n\r\n            emit ReceivedRewardRef(users[userAddress].secondLevelReferrals, users[userAddress].secondLevelReferrals, userAddress, level, 2);\r\n        } else\r\n        {\r\n            ( success, ) = (secWallet).call{value:secPercent}('');\r\n        }\r\n\r\n        if(users[userAddress].thirdLevelReferrals!=address(0) && users[users[userAddress].thirdLevelReferrals].activeMainLevels[level] >= 1)\r\n        {\r\n            ( success, ) = (users[userAddress].thirdLevelReferrals).call{value:thirdPercent}('');\r\n            users[users[userAddress].thirdLevelReferrals].ReferrerBonus3[level] += 1;\r\n            \r\n            emit ReceivedRewardRef(users[userAddress].thirdLevelReferrals, users[userAddress].thirdLevelReferrals, userAddress, level, 3);\r\n        }else\r\n        {\r\n            ( success, ) = (secWallet).call{value:thirdPercent}('');\r\n        }\r\n\r\n        return success;\r\n    }\r\n\r\n    /*\r\n        The verifyUser function in the smart contract appears to be a privileged function restricted to the contract owner and is designed to manually assign certain levels to a specified user. Here's an explanation of the function:\r\n        Function Signature:\r\n        The function is declared as a public function, accessible from outside the contract.\r\n        It takes two parameters: _userAddress (the address of the user to whom levels are assigned) and levels (an array of level numbers to be assigned).\r\n        The function returns a bool indicating whether the operation was successful.\r\n        Modifiers:\r\n        The function includes the onlyContractOwner modifier, ensuring that only the contract owner has the authority to call this function.\r\n        There is a require statement checking that the user specified by _userAddress exists, preventing assignment to non-existent users.\r\n        Another require statement checks if the current timestamp is before the specified START_DATE, limiting the function's use to a specific time period.\r\n        Level Assignment:\r\n        The function uses a loop to iterate through the levels array.\r\n        For each level specified, it adds the user's ID to the corresponding Level_User_id array in the LevelPayments mapping.\r\n        It sets the user's activeMainLevels for each specified level to 1, indicating that the user has activated these levels.\r\n        Return:\r\n        The function returns true if the operation is successful.\r\n        This function allows the contract owner to manually configure or adjust the levels for a specific user, potentially for testing or administrative purposes. The restriction on the START_DATE ensures that this action is only allowed within a certain timeframe.\r\n    */\r\n\r\n    function verifyUser (address _userAddress, uint8[] memory levels) public onlyContractOwner returns (bool) {\r\n        require(isUserExists(_userAddress), \"user exists\");\r\n        require(block.timestamp < START_DATE, \"time is over\");\r\n\r\n        for (uint i=0; i<levels.length; i++) {\r\n            LevelPayments[levels[i]].Level_User_id.push(users[_userAddress].id);\r\n            users[_userAddress].activeMainLevels[levels[i]] = 1;\r\n        }\r\n\r\n        return true;\r\n    }\r\n\r\n    /*\r\n        The sendRegFee function in the smart contract is a private function responsible for transferring registration fees to a designated wallet (regWallet). Here's an explanation of the function:\r\n        Function Signature:\r\n        The function is declared as a private function, indicating that it can only be called within the contract and not externally.\r\n        It returns a bool, indicating whether the fee transfer was successful (true) or not (false).\r\n        Logic:\r\n        The function uses the call function to send Ether (RegFee) to the regWallet.\r\n        The result of the call is stored in the success variable, which is a boolean indicating whether the call was successful.\r\n        Return:\r\n        The function returns the success boolean, indicating whether the fee transfer was successful or not.\r\n        This function is likely used internally within the contract, particularly during user registration, to handle the transfer of registration fees to the designated wallet. The use of the call function allows for flexible interaction with external contracts or wallets.\r\n    */\r\n\r\n    function sendRegFee() private returns (bool) {\r\n        (bool success, ) = (regWallet).call{value:RegFee}('');\r\n\r\n        return success;\r\n    }\r\n\r\n    /*\r\n        The isUserExists function in the smart contract is a view function that checks whether a user with a given address exists in the system. Here's an explanation of the function:\r\n        Function Signature:\r\n        The function is declared as a public view function, indicating that it can be called externally and does not modify the contract's state.\r\n        It returns a bool, indicating whether the user exists (true) or not (false).\r\n        Logic:\r\n        The function checks if the user's ID, stored in the users mapping with the provided address as the key, is not equal to zero. If the ID is not zero, it implies that the user exists.\r\n        Return:\r\n        The function returns true if the user exists (user ID is not zero) and false otherwise.\r\n        This function is useful for validating whether a user with a specific address is registered in the system before performing certain operations or transactions related to that user.\r\n    */\r\n\r\n    function isUserExists(address user) public view returns (bool) {\r\n        return (users[user].id != 0);\r\n    }\r\n\r\n    /*\r\n        The usersCount function in the smart contract returns the total number of users registered in the system. Here's an explanation of the function:\r\n        Function Signature:\r\n        The function is declared as a public view function, indicating that it can be called externally and does not modify the contract's state.\r\n        It returns a uint32, representing the total number of users.\r\n        Logic:\r\n        The function calculates the user count by subtracting 1 from the lastUserId variable, which likely represents the total number of users who have registered.\r\n        Return:\r\n        The function returns the total count of users as a uint32.\r\n        This function provides a quick way to retrieve the total number of users in the system without iterating through the user data structures.\r\n    */\r\n\r\n    function usersCount() public view returns (uint32) {\r\n        return uint32(lastUserId) - 1;\r\n    }\r\n\r\n    /*\r\n        The levelReport function in the smart contract provides a report on the number of users who have been paid at a specific level and the number of users still waiting for payment. Here's an explanation of the function:\r\n        Function Signature:\r\n        The function is declared as a public function, indicating that it can be called externally.\r\n        It takes a uint8 parameter level, representing the specific level for which the report is generated.\r\n        Local Variables:\r\n        count: Represents the total number of users at the specified level, obtained by calling the TotalLevelUserCount function.\r\n        total: Holds the total count of users at the specified level.\r\n        pay_id: Represents the number of users who have already been paid at the specified level.\r\n        Logic:\r\n        The function first checks if the count of users is non-zero and not equal to one.\r\n        If the count is even, pay_id is set to half of the total count.\r\n        If the count is odd, one is subtracted from the count, and then pay_id is set to half of the adjusted count.\r\n        If the count is zero or one, pay_id is set to zero.\r\n        The variable total is assigned the total count of users at the specified level.\r\n        The variables paid and onwait are calculated based on the values of pay_id and total.\r\n        Return:\r\n        The function returns a tuple containing the values of paid (the number of users who have been paid) and onwait (the number of users still waiting for payment) at the specified level.\r\n        This function essentially provides insights into the distribution of payments at a specific level, indicating how many users have already received payment and how many are still waiting.\r\n    */\r\n\r\n    function levelReport(uint8 level) public view returns (uint32 paid,uint32 onwait)\r\n    {\r\n        uint32 count = TotalLevelUserCount(level);\r\n        uint32 total = count;\r\n        uint32 pay_id;\r\n\r\n        if(count!=0 && count!=1)\r\n        {\r\n            if(count%2==0)\r\n            {\r\n                pay_id=count/2;\r\n            }else\r\n            {\r\n                count=count-1;\r\n                pay_id=count/2;\r\n            }\r\n        }else\r\n        {\r\n            pay_id = 0;\r\n        }\r\n\r\n        paid=pay_id;\r\n\r\n        onwait=total-pay_id;\r\n        return (paid,onwait);\r\n    }\r\n\r\n    /*\r\n        The userSpam function in the smart contract allows the contract owner to block or unblock a user's whitelist status. Here's an explanation of the function:\r\n        Function Signature:\r\n        The function is declared as a public function, meaning it can be called externally.\r\n        It is marked with the onlyContractOwner modifier, ensuring that only the contract owner has the authority to invoke this function.\r\n        Parameters:\r\n        userAddress: The Ethereum address of the user whose whitelist status is to be modified.\r\n        open: A boolean parameter indicating whether to open (true) or block (false) the whitelist status for the specified user.\r\n        Requirements:\r\n        The function includes a requirement check to ensure that the user specified by userAddress has a whitelist status (users[userAddress].isWhitelist must be true).\r\n        It checks whether the current timestamp is within 14 days of the contract start date (block.timestamp < (START_DATE + 14 days)), imposing a time constraint on when the whitelist can be modified.\r\n        Function Logic:\r\n        If the requirements are met, the function sets the userSpam status of the specified user to the value of the open parameter. This effectively blocks or unblocks the user's whitelist status.\r\n        Return:\r\n        The function returns the updated value of users[userAddress].userSpam after the modification.\r\n        Note:\r\n        The purpose of blocking or unblocking whitelist status is not explicitly mentioned in the provided code snippet. The impact of this action would depend on the broader context and the significance of the whitelist status within the smart contract's functionality.\r\n        This function provides a mechanism for the contract owner to control the whitelist status of a user and restrict or allow their participation based on this status, subject to the specified requirements.\r\n    */\r\n\r\n    function userSpam(address userAddress, bool open) public onlyContractOwner returns (bool) {\r\n        require(users[userAddress].isWhitelist, \"is not influencer\");\r\n        require(block.timestamp < (START_DATE + 14 days), \"time is over\");\r\n\r\n        users[userAddress].userSpam = open;\r\n        return users[userAddress].userSpam;\r\n    }\r\n\r\n    /*\r\n        The AllLevelReport function in the smart contract generates a summary report for each level, providing information about the total count of users at each level and the total count of payments made for each level. Here's an explanation of the function:\r\n        Function Signature:\r\n        The function is declared as a public view function, meaning it can be called externally and does not modify the state of the contract.\r\n        Function Logic:\r\n        It initializes an array result to store the report data. The array has a length of LAST_LEVEL * 2, indicating that it will store information for each level (two values per level).\r\n        It uses a loop to iterate over each level, calling the levelReport function for each level (indexed by j+1). The levelReport function appears to return two values: the total count of users and the total count of payments for the specified level.\r\n        The results are stored in the result array at even and odd indices, representing the user count and payment count, respectively.\r\n        The loop increments the index j for each iteration.\r\n        Return:\r\n        The function returns the result array, providing a comprehensive report for all levels.\r\n        Note:\r\n        The exact details of the levelReport function, including its parameters and return values, are not provided in the code snippet. To fully understand the functionality, it would be necessary to review the implementation of the levelReport function.\r\n        Overall, this function facilitates the retrieval of summarized data for all levels in the contract, making it convenient to analyze and monitor the participation and payment activities across different levels.\r\n    */\r\n\r\n    function AllLevelReport() public view returns(uint32[] memory)\r\n    {\r\n        uint8 Lev_leng=LAST_LEVEL*2;\r\n        uint32[] memory result = new uint32[](Lev_leng);\r\n\r\n        uint8 j=0;\r\n        for (uint8 i = 0; i <  Lev_leng-1; i+=2)\r\n        {\r\n            (result[i], result[i+1]) = levelReport(j+1);\r\n            j++;\r\n        }\r\n        return result;\r\n    }\r\n\r\n    /*\r\n        The withdrawLostTokens function in the smart contract serves the purpose of allowing the contract owner to withdraw any remaining or lost Ethereum (ETH) tokens held by the contract. Here's a breakdown of the function:\r\n        Modifier:\r\n        The function is restricted to only be callable by the contract owner, as indicated by the onlyContractOwner modifier. This ensures that only the owner of the contract has the authority to execute this function.\r\n        Function Logic:\r\n        It retrieves the current balance of the contract in ETH using address(this).balance and stores it in the conbalance variable.\r\n        It then attempts to send the entire balance (conbalance) to the contract owner's address (contractOwner) using a low-level call to the external function. The transfer is wrapped in a (bool success, ) tuple to capture whether the operation was successful.\r\n        Return:\r\n        The function returns a boolean value (success), indicating whether the ETH withdrawal was successful.\r\n  */\r\n\r\n    function withdrawLostTokens() public onlyContractOwner returns (bool) {\r\n\r\n        uint256 conbalance = address(this).balance;\r\n        (bool success, ) = (contractOwner).call{value:conbalance}('error!!!!');\r\n\r\n        return success;\r\n    }\r\n\r\n    /*\r\n        The allLevelUserCount function in the smart contract is a view function that returns an array containing the total count of users for each level in the system. \r\n        Here's a breakdown of what the function does:\r\n        It initializes a dynamic memory array LevelCount of type uint32 with a length of LAST_LEVEL, representing the count of users for each level.\r\n        It iterates over each level from 1 to LAST_LEVEL.\r\n        For each level, it retrieves the length of the array Level_User_id associated with that level using LevelPayments[i+1].Level_User_id.length.\r\n        The count of users participating in each level is stored in the LevelCount array at the corresponding index.\r\n        The function returns the LevelCount array, providing an overview of the total number of users for each level in the system.\r\n        In summary, this function allows querying the total user counts for each level, providing a comprehensive view of user participation across different levels.\r\n    */\r\n\r\n    function allLevelUserCount() public view returns (uint32[] memory)\r\n    {\r\n        uint32[] memory LevelCount=new uint32[](LAST_LEVEL);\r\n        for (uint8 i=0; i < LAST_LEVEL; i++)\r\n        {\r\n            LevelCount[i] =  uint32(LevelPayments[i+1].Level_User_id.length);\r\n        }\r\n\r\n        return LevelCount;\r\n    }\r\n\r\n    /*\r\n        The TotalLevelUserCount function in the smart contract is a view function that returns the total count of users who have participated in a specific level. \r\n        Here's a breakdown of what the function does:\r\n        It takes a parameter level representing the specific level for which the user count is requested.\r\n        It retrieves the length of the array Level_User_id associated with the given level using LevelPayments[level].Level_User_id.length.\r\n        The count of users participating in the specified level is stored in the variable count.\r\n        The function returns the count, representing the total number of users who have participated in the specified level.\r\n        In summary, this function provides information about the total number of users who have participated in a particular level of the system.\r\n    */\r\n\r\n    function TotalLevelUserCount(uint8 level) public view returns (uint32 count)\r\n    {\r\n        count = uint32(LevelPayments[level].Level_User_id.length);\r\n        return count;\r\n    }\r\n\r\n    /*\r\n        The boughtLevels function in the smart contract is a view function that retrieves the information about the levels that a user has bought. \r\n        Here's a breakdown of what the function does:\r\n        It defines an array LevelBuy to store the information about the levels that the user has bought.\r\n        It iterates over each level (from 0 to LAST_LEVEL - 1).\r\n        For each level, it retrieves the information about whether the user has bought that level (users[userAddress].activeMainLevels[i+1]).\r\n        The information (either 0 or 1) is stored in the LevelBuy array.\r\n        The function returns the LevelBuy array, containing information about the levels that the user has bought.\r\n        In summary, this function provides a binary representation of the levels that the user has purchased. If the value at a specific index in the LevelBuy array is 1, \r\n        it indicates that the user has bought that level; otherwise, it is 0, indicating that the user has not bought that level.\r\n    */\r\n\r\n    function boughtLevels(address userAddress) public view returns (uint8[] memory) {\r\n        uint8[] memory LevelBuy=new uint8[](LAST_LEVEL);\r\n        for (uint8 i=0; i < LAST_LEVEL; i++)\r\n        {\r\n            LevelBuy[i] = users[userAddress].activeMainLevels[i+1];\r\n        }\r\n\r\n        return LevelBuy;\r\n    }\r\n\r\n    /*\r\n        The showOpenLevels function in the smart contract is a view function that calculates and returns the number of open levels based on the \r\n        elapsed time since the contract deployment. Here's a breakdown of what the function does:\r\n        It defines a constant variable skipCity with a value of 388800.\r\n        It retrieves the current timestamp using block.timestamp.\r\n        It calculates the time elapsed since the contract deployment by finding the remainder of the division of the difference between \r\n        the current timestamp and the contract start date (START_DATE) by skipCity.\r\n        It calculates the number of open levels by subtracting the result from step 3 divided by 21600 from 18.\r\n        The calculated value represents the number of open levels at the current time, considering a specific time interval (skipCity) \r\n        and the duration of each level (21600 seconds).\r\n        In summary, this function dynamically determines the number of open levels based on the time elapsed since the contract's deployment, \r\n        allowing for a progressive unlocking of levels over time.\r\n    */\r\n \r\n    function showOpenLevels() public view returns (uint)\r\n    {\r\n        uint skipCity = 388800;\r\n        uint currentTimeStamp = block.timestamp;\r\n        uint leftTime = (currentTimeStamp - START_DATE) % (skipCity);\r\n\r\n        return 18 - (leftTime / 21600);\r\n    }\r\n\r\n    /*\r\n        The UserRewards function in the smart contract is a view function that retrieves an array of rewards received by a specific user for each level. \r\n        Here's a breakdown of what the function does:\r\n        The function takes the Ethereum address of a user (userAddress) as input.\r\n        It initializes a dynamic array LevelRewards of type uint8 with a length equal to the constant LAST_LEVEL defined in the smart contract. \r\n        This array will store the rewards for each level.\r\n        Inside a loop that iterates through each level up to LAST_LEVEL, the function retrieves the number of payments the user has \r\n        received for the corresponding level from the PaymentsCount mapping in the user's data structure.\r\n        The obtained count of payments is then cast to uint8 and assigned to the rewardP variable.\r\n        The rewardP value is stored in the LevelRewards array at the corresponding index.\r\n        The function returns the LevelRewards array containing the rewards received by the user for each level.\r\n        In summary, this function provides a convenient way to query and view the rewards a specific user has received for each level in the smart contract.\r\n    */\r\n\r\n    function UserRewards(address userAddress)public view returns (uint8[] memory){\r\n        uint8[] memory LevelRewards=new uint8[](LAST_LEVEL);\r\n\r\n        uint8 rewardP;\r\n\r\n        for (uint8 i=0; i < LAST_LEVEL; i++)\r\n        {\r\n            rewardP=uint8(users[userAddress].PaymentsCount[i]);\r\n            LevelRewards[i]=rewardP;\r\n        }\r\n\r\n        return LevelRewards;\r\n    }\r\n\r\n    /*\r\n        The getUserId function in the smart contract is a view function that retrieves the unique identifier (ID) associated with a given user address. \r\n        Here's a breakdown of what the function does:\r\n        The function takes the Ethereum address of a user (userAddress) as input.\r\n        It accesses the users mapping in the smart contract, which maps user addresses to their corresponding user data structures.\r\n        The function retrieves the id field from the user's data structure, representing the unique identifier assigned to that user.\r\n        The user's ID is then explicitly cast to a uint32 type and returned as the output of the function.\r\n        In summary, this function provides a way to obtain the unique identifier of a user in the smart contract based on their Ethereum address. \r\n        It can be useful for querying and verifying user-specific information associated with their ID in the contract.\r\n    */\r\n\r\n    function getUserId(address userAddress) public view returns(uint32) \r\n    {\r\n        return uint32(\r\n            users[userAddress].id\r\n        );\r\n\r\n    }\r\n\r\n    /*\r\n        The ReferrerIncome function in the smart contract is a view function that retrieves information about referral bonuses for a specific user. \r\n        Here's a breakdown of what the function does:\r\n        The function takes the address of a user (_user) as input.\r\n        Three dynamic arrays (result1, result2, and result3) are initialized to store the referral bonuses for the user at each level.\r\n        The function then iterates through each level (from 1 to LAST_LEVEL) and populates the arrays with the corresponding referral \r\n        bonuses that the user has earned for each level.\r\n        The data is structured as a tuple, and the three arrays are returned together as the output of the function.\r\n        In summary, this function allows anyone to query and retrieve information about the referral bonuses earned by a \r\n        specific user at each level in the smart contract. It provides transparency regarding the referral bonus structure for different levels in the system.\r\n    */\r\n\r\n    function ReferrerIncome(address _user) public view returns(uint32[] memory, uint32[] memory, uint32[] memory)\r\n    {\r\n        uint32[] memory result1 = new uint32[](LAST_LEVEL);\r\n        uint32[] memory result2 = new uint32[](LAST_LEVEL);\r\n        uint32[] memory result3 = new uint32[](LAST_LEVEL);\r\n\r\n        for (uint8 i = 0; i < LAST_LEVEL; i++)\r\n        {\r\n            result1[i] = users[_user].ReferrerBonus1[i+1];\r\n            result2[i] = users[_user].ReferrerBonus2[i+1];\r\n            result3[i] = users[_user].ReferrerBonus3[i+1];\r\n        }\r\n        return (result1, result2, result3);\r\n    }\r\n\r\n    /*\r\n        The openCloseUpgrade function in the smart contract is a setter function that allows the contract owner to control the state of a boolean variable OPEN_UPGRADE. \r\n        Here's a breakdown of what the function does:\r\n        The function takes a boolean parameter open as input.\r\n        It ensures that only the contract owner can execute this function by using the onlyContractOwner modifier.\r\n        The value of the OPEN_UPGRADE variable is then set to the value of the open parameter, effectively toggling the state of whether upgrades are open or closed.\r\n        Finally, the function returns the updated value of OPEN_UPGRADE after the modification.\r\n        This function provides the contract owner with the ability to open or close upgrades in the smart contract. The state of OPEN_UPGRADE is crucial for \r\n        controlling whether users can perform upgrades at a given time, and this function serves as a means to manage that state.\r\n    */\r\n\r\n    function openCloseUpgrade(bool open) public onlyContractOwner returns(bool) \r\n    {\r\n        OPEN_UPGRADE = open;\r\n        return OPEN_UPGRADE;\r\n    }\r\n\r\n    /*\r\n        The openAllLevels function in the smart contract is a setter function that allows the contract owner to control the state of a boolean variable OPEN_ALL_LEVELS. \r\n        Here's a breakdown of what the function does:\r\n        The function takes a boolean parameter open as input.\r\n        It ensures that only the contract owner can execute this function by using the onlyContractOwner modifier.\r\n        The value of the OPEN_ALL_LEVELS variable is then set to the value of the open parameter, effectively toggling the state of whether all levels are open or closed.\r\n        Finally, the function returns the updated value of OPEN_ALL_LEVELS after the modification.\r\n        This function provides the contract owner with the ability to open or close all levels in the smart contract. The state of OPEN_ALL_LEVELS is crucial \r\n        for controlling the accessibility of different levels within the contract, and this function serves as a means to manage that state.\r\n    */\r\n\r\n    function openAllLevels(bool open) public onlyContractOwner returns(bool) \r\n    {\r\n        OPEN_ALL_LEVELS = open;\r\n        return OPEN_ALL_LEVELS;\r\n    }\r\n}", "ABI": "[{\"inputs\":[{\"internalType\":\"address\",\"name\":\"_ownerAddress\",\"type\":\"address\"},{\"internalType\":\"address\",\"name\":\"_secWallet\",\"type\":\"address\"},{\"internalType\":\"address\",\"name\":\"_regWallet\",\"type\":\"address\"},{\"internalType\":\"address\",\"name\":\"_devFeeWallet\",\"type\":\"address\"}],\"stateMutability\":\"nonpayable\",\"type\":\"constructor\"},{\"anonymous\":false,\"inputs\":[{\"indexed\":true,\"internalType\":\"address\",\"name\":\"userIndex\",\"type\":\"address\"},{\"indexed\":false,\"internalType\":\"address\",\"name\":\"user\",\"type\":\"address\"},{\"indexed\":false,\"internalType\":\"uint8\",\"name\":\"level\",\"type\":\"uint8\"}],\"name\":\"BuyLevel\",\"type\":\"event\"},{\"anonymous\":false,\"inputs\":[{\"indexed\":true,\"internalType\":\"address\",\"name\":\"userIndex\",\"type\":\"address\"},{\"indexed\":false,\"internalType\":\"uint8\",\"name\":\"level\",\"type\":\"uint8\"},{\"indexed\":false,\"internalType\":\"uint256\",\"name\":\"timestap\",\"type\":\"uint256\"}],\"name\":\"ReceivedRewardCity\",\"type\":\"event\"},{\"anonymous\":false,\"inputs\":[{\"indexed\":true,\"internalType\":\"address\",\"name\":\"userIndex\",\"type\":\"address\"},{\"indexed\":false,\"internalType\":\"address\",\"name\":\"user\",\"type\":\"address\"},{\"indexed\":false,\"internalType\":\"address\",\"name\":\"fromUser\",\"type\":\"address\"},{\"indexed\":false,\"internalType\":\"uint8\",\"name\":\"level\",\"type\":\"uint8\"},{\"indexed\":false,\"internalType\":\"uint8\",\"name\":\"refStatus\",\"type\":\"uint8\"}],\"name\":\"ReceivedRewardRef\",\"type\":\"event\"},{\"anonymous\":false,\"inputs\":[{\"indexed\":true,\"internalType\":\"address\",\"name\":\"userIndex\",\"type\":\"address\"},{\"indexed\":false,\"internalType\":\"address\",\"name\":\"user\",\"type\":\"address\"},{\"indexed\":false,\"internalType\":\"uint256\",\"name\":\"userId\",\"type\":\"uint256\"}],\"name\":\"Registration\",\"type\":\"event\"},{\"anonymous\":false,\"inputs\":[{\"indexed\":true,\"internalType\":\"address\",\"name\":\"refIndex\",\"type\":\"address\"},{\"indexed\":false,\"internalType\":\"address\",\"name\":\"user\",\"type\":\"address\"},{\"indexed\":false,\"internalType\":\"uint256\",\"name\":\"userId\",\"type\":\"uint256\"}],\"name\":\"RegistrationRef1\",\"type\":\"event\"},{\"anonymous\":false,\"inputs\":[{\"indexed\":true,\"internalType\":\"address\",\"name\":\"refIndex\",\"type\":\"address\"},{\"indexed\":false,\"internalType\":\"address\",\"name\":\"user\",\"type\":\"address\"},{\"indexed\":false,\"internalType\":\"uint256\",\"name\":\"userId\",\"type\":\"uint256\"}],\"name\":\"RegistrationRef2\",\"type\":\"event\"},{\"anonymous\":false,\"inputs\":[{\"indexed\":true,\"internalType\":\"address\",\"name\":\"refIndex\",\"type\":\"address\"},{\"indexed\":false,\"internalType\":\"address\",\"name\":\"user\",\"type\":\"address\"},{\"indexed\":false,\"internalType\":\"uint256\",\"name\":\"userId\",\"type\":\"uint256\"}],\"name\":\"RegistrationRef3\",\"type\":\"event\"},{\"anonymous\":false,\"inputs\":[{\"indexed\":true,\"internalType\":\"address\",\"name\":\"userIndex\",\"type\":\"address\"},{\"indexed\":false,\"internalType\":\"address\",\"name\":\"user\",\"type\":\"address\"},{\"indexed\":false,\"internalType\":\"uint8\",\"name\":\"level\",\"type\":\"uint8\"}],\"name\":\"UpgradeLevel\",\"type\":\"event\"},{\"inputs\":[],\"name\":\"AllLevelReport\",\"outputs\":[{\"internalType\":\"uint32[]\",\"name\":\"\",\"type\":\"uint32[]\"}],\"stateMutability\":\"view\",\"type\":\"function\"},{\"inputs\":[],\"name\":\"LAST_LEVEL\",\"outputs\":[{\"internalType\":\"uint8\",\"name\":\"\",\"type\":\"uint8\"}],\"stateMutability\":\"view\",\"type\":\"function\"},{\"inputs\":[],\"name\":\"OPEN_ALL_LEVELS\",\"outputs\":[{\"internalType\":\"bool\",\"name\":\"\",\"type\":\"bool\"}],\"stateMutability\":\"view\",\"type\":\"function\"},{\"inputs\":[],\"name\":\"OPEN_UPGRADE\",\"outputs\":[{\"internalType\":\"bool\",\"name\":\"\",\"type\":\"bool\"}],\"stateMutability\":\"view\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"address\",\"name\":\"_user\",\"type\":\"address\"}],\"name\":\"ReferrerIncome\",\"outputs\":[{\"internalType\":\"uint32[]\",\"name\":\"\",\"type\":\"uint32[]\"},{\"internalType\":\"uint32[]\",\"name\":\"\",\"type\":\"uint32[]\"},{\"internalType\":\"uint32[]\",\"name\":\"\",\"type\":\"uint32[]\"}],\"stateMutability\":\"view\",\"type\":\"function\"},{\"inputs\":[],\"name\":\"RegFee\",\"outputs\":[{\"internalType\":\"uint256\",\"name\":\"\",\"type\":\"uint256\"}],\"stateMutability\":\"view\",\"type\":\"function\"},{\"inputs\":[],\"name\":\"START_DATE\",\"outputs\":[{\"internalType\":\"uint256\",\"name\":\"\",\"type\":\"uint256\"}],\"stateMutability\":\"view\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint8\",\"name\":\"level\",\"type\":\"uint8\"}],\"name\":\"TotalLevelUserCount\",\"outputs\":[{\"internalType\":\"uint32\",\"name\":\"count\",\"type\":\"uint32\"}],\"stateMutability\":\"view\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"address\",\"name\":\"userAddress\",\"type\":\"address\"}],\"name\":\"UserRewards\",\"outputs\":[{\"internalType\":\"uint8[]\",\"name\":\"\",\"type\":\"uint8[]\"}],\"stateMutability\":\"view\",\"type\":\"function\"},{\"inputs\":[],\"name\":\"allLevelUserCount\",\"outputs\":[{\"internalType\":\"uint32[]\",\"name\":\"\",\"type\":\"uint32[]\"}],\"stateMutability\":\"view\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"address\",\"name\":\"userAddress\",\"type\":\"address\"}],\"name\":\"boughtLevels\",\"outputs\":[{\"internalType\":\"uint8[]\",\"name\":\"\",\"type\":\"uint8[]\"}],\"stateMutability\":\"view\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"address\",\"name\":\"_userAddress\",\"type\":\"address\"},{\"internalType\":\"uint8\",\"name\":\"level\",\"type\":\"uint8\"}],\"name\":\"buyNewLevel\",\"outputs\":[],\"stateMutability\":\"payable\",\"type\":\"function\"},{\"inputs\":[],\"name\":\"contractOwner\",\"outputs\":[{\"internalType\":\"address\",\"name\":\"\",\"type\":\"address\"}],\"stateMutability\":\"view\",\"type\":\"function\"},{\"inputs\":[],\"name\":\"devFeeWallet\",\"outputs\":[{\"internalType\":\"address\",\"name\":\"\",\"type\":\"address\"}],\"stateMutability\":\"view\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"address\",\"name\":\"userAddress\",\"type\":\"address\"}],\"name\":\"getUserId\",\"outputs\":[{\"internalType\":\"uint32\",\"name\":\"\",\"type\":\"uint32\"}],\"stateMutability\":\"view\",\"type\":\"function\"},{\"inputs\":[],\"name\":\"id1\",\"outputs\":[{\"internalType\":\"address\",\"name\":\"\",\"type\":\"address\"}],\"stateMutability\":\"view\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"\",\"type\":\"uint256\"}],\"name\":\"idToAddress\",\"outputs\":[{\"internalType\":\"address\",\"name\":\"\",\"type\":\"address\"}],\"stateMutability\":\"view\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"address\",\"name\":\"user\",\"type\":\"address\"}],\"name\":\"isUserExists\",\"outputs\":[{\"internalType\":\"bool\",\"name\":\"\",\"type\":\"bool\"}],\"stateMutability\":\"view\",\"type\":\"function\"},{\"inputs\":[],\"name\":\"lastUserId\",\"outputs\":[{\"internalType\":\"uint256\",\"name\":\"\",\"type\":\"uint256\"}],\"stateMutability\":\"view\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint8\",\"name\":\"\",\"type\":\"uint8\"}],\"name\":\"levelPrice\",\"outputs\":[{\"internalType\":\"uint256\",\"name\":\"\",\"type\":\"uint256\"}],\"stateMutability\":\"view\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint8\",\"name\":\"level\",\"type\":\"uint8\"}],\"name\":\"levelReport\",\"outputs\":[{\"internalType\":\"uint32\",\"name\":\"paid\",\"type\":\"uint32\"},{\"internalType\":\"uint32\",\"name\":\"onwait\",\"type\":\"uint32\"}],\"stateMutability\":\"view\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"bool\",\"name\":\"open\",\"type\":\"bool\"}],\"name\":\"openAllLevels\",\"outputs\":[{\"internalType\":\"bool\",\"name\":\"\",\"type\":\"bool\"}],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"bool\",\"name\":\"open\",\"type\":\"bool\"}],\"name\":\"openCloseUpgrade\",\"outputs\":[{\"internalType\":\"bool\",\"name\":\"\",\"type\":\"bool\"}],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint8\",\"name\":\"level\",\"type\":\"uint8\"}],\"name\":\"paymentID\",\"outputs\":[{\"internalType\":\"uint32\",\"name\":\"pay_id\",\"type\":\"uint32\"}],\"stateMutability\":\"view\",\"type\":\"function\"},{\"inputs\":[],\"name\":\"regWallet\",\"outputs\":[{\"internalType\":\"address\",\"name\":\"\",\"type\":\"address\"}],\"stateMutability\":\"view\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"address\",\"name\":\"userAddress\",\"type\":\"address\"},{\"internalType\":\"uint256\",\"name\":\"referrerId\",\"type\":\"uint256\"}],\"name\":\"registr\",\"outputs\":[],\"stateMutability\":\"payable\",\"type\":\"function\"},{\"inputs\":[],\"name\":\"secWallet\",\"outputs\":[{\"internalType\":\"address\",\"name\":\"\",\"type\":\"address\"}],\"stateMutability\":\"view\",\"type\":\"function\"},{\"inputs\":[],\"name\":\"showOpenLevels\",\"outputs\":[{\"internalType\":\"uint256\",\"name\":\"\",\"type\":\"uint256\"}],\"stateMutability\":\"view\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"address\",\"name\":\"_userAddress\",\"type\":\"address\"},{\"internalType\":\"uint8\",\"name\":\"level\",\"type\":\"uint8\"}],\"name\":\"upgradeLevel\",\"outputs\":[],\"stateMutability\":\"payable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"\",\"type\":\"uint256\"}],\"name\":\"userIds\",\"outputs\":[{\"internalType\":\"address\",\"name\":\"\",\"type\":\"address\"}],\"stateMutability\":\"view\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"address\",\"name\":\"userAddress\",\"type\":\"address\"},{\"internalType\":\"bool\",\"name\":\"open\",\"type\":\"bool\"}],\"name\":\"userSpam\",\"outputs\":[{\"internalType\":\"bool\",\"name\":\"\",\"type\":\"bool\"}],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"address\",\"name\":\"\",\"type\":\"address\"}],\"name\":\"users\",\"outputs\":[{\"internalType\":\"uint256\",\"name\":\"id\",\"type\":\"uint256\"},{\"internalType\":\"uint256\",\"name\":\"partnersCount\",\"type\":\"uint256\"},{\"internalType\":\"address\",\"name\":\"firstLevelReferrals\",\"type\":\"address\"},{\"internalType\":\"address\",\"name\":\"secondLevelReferrals\",\"type\":\"address\"},{\"internalType\":\"address\",\"name\":\"thirdLevelReferrals\",\"type\":\"address\"},{\"internalType\":\"bool\",\"name\":\"userSpam\",\"type\":\"bool\"},{\"internalType\":\"uint256\",\"name\":\"refID\",\"type\":\"uint256\"},{\"internalType\":\"bool\",\"name\":\"isWhitelist\",\"type\":\"bool\"}],\"stateMutability\":\"view\",\"type\":\"function\"},{\"inputs\":[],\"name\":\"usersCount\",\"outputs\":[{\"internalType\":\"uint32\",\"name\":\"\",\"type\":\"uint32\"}],\"stateMutability\":\"view\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"address\",\"name\":\"_userAddress\",\"type\":\"address\"},{\"internalType\":\"uint8[]\",\"name\":\"levels\",\"type\":\"uint8[]\"}],\"name\":\"verifyUser\",\"outputs\":[{\"internalType\":\"bool\",\"name\":\"\",\"type\":\"bool\"}],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[],\"name\":\"withdrawLostTokens\",\"outputs\":[{\"internalType\":\"bool\",\"name\":\"\",\"type\":\"bool\"}],\"stateMutability\":\"nonpayable\",\"type\":\"function\"}]", "ContractName": "SmartMoneyRush", "CompilerVersion": "v0.8.0+commit.c7dfd78e", "OptimizationUsed": "0", "Runs": "200", "ConstructorArguments": "00000000000000000000000065a002411d09c7ebbdbbfbca5c18a1212f1fd888000000000000000000000000fc3bd979170c1d3db292007952c8e339c19040c2000000000000000000000000b266a1367403b4fa77a44362ae4d0f456d808a33000000000000000000000000e6492d5619dc5054239acc903c2d2d94d107bb32", "EVMVersion": "Default", "Library": "", "LicenseType": "MIT", "Proxy": "0", "Implementation": "", "SwarmSource": "ipfs://3d8c4830c18d442ad39829d3d320cf508e1ae29c36668ae792bd51927d54b2b1"}