// SPDX-License-Identifier: MIT

pragma solidity ^0.8.0;

/// @title: RCS2gm
/// @author: manifold.xyz

import "./manifold/ERC1155Creator.sol";

////////////////////////////////////////////////////////////////////////////////////////////////
//                                                                                            //
//                                                                                            //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｃｔｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｄｄｉｉｄｄｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉａｉｉｉｉｉｉｄｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｄｉｉｄｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｄｉｉｉｉｉｉｉｄｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｒｉｉｉｉｄｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｄｉｉｉｉｉｉｉｉｉｄｉｉｉｉｉｉｉｉｉｉｉｉｉｄｉｉｉｉｉｉｐｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｄｉｉｉｉｉｉｉｉｉｉｄｉｉｉｉｉｉｉｉｉｉｉｄｄｉｉｉｉｉｉｄｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｄｉｉｉｉｉｉｉｉｉｉｉｄｄｉｉｄｄｄｄｄｄｄｄｄｄｉｉｉｉｉｉｉｄｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｄｉｉｉｉｉｉｉｉｉｉｄｄｄｄｉｉｉｉｉｉｉｉｉｉｉｉｄｄｄｉｉｉｄｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｄｉｉｉｉｉｉｉｉｐｄｉｉｄｄｄｄｄｄｄｄｄｄｄｄｄｄｄｄｄｄｄｄｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｐｉｉｉｉｐｄｄｉｅｃｉｉｉｉｉｉｉｉｉｉｉｉｄｉｄｄｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｅｉｉｉｉｉｄｉｉｉｉｉｉｄｄｄｉｉｃｔｔｔｃｃｃｃｃｃｃｃｃｔｃｉｄｉｄｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｄｉｉｉｉｉｉｉｉｉｉｉｄｄｄｄｃｉｅｔｔｃｃｔｔｔｔｔｔｔｃｔｔｅｉｄｒｄｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｐｉｉｉｐｉｉｉｉｉｉａｄｄｄｃｉｉｃｔｃｉｉｃｃｃｃｃｃｃｉｉｃｔｒｉｄｄｄｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｔｉｉｄｉｉｉｉｉｉｄｄｄｄｄｉｉｃｔｔｅｉｉｉｉｉｉｉｉｉｉｉｉｃｔｅｉｄｄｄｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｄｄｄｄｄｉｉｃｔｔｔｅｉｄｄｉｉｉｉｉｉｉｄｉｅｔｔｅｉｄｒｃｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｄｄｉｉｉｉｉｄｄｄｄｉｉｅｃｔｔｔｃｅｉｉｄｄｄｄｄｄｄｄｄｉａｃｔｔｃｉｄｄｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｄｄｉｉｉｉｉｄｄｄｅｉｅｃｔｔｔｔｅｉｉｉｄｄｄｄｄｄｄｄｄｉｉｉｃｔｔｃｉｄｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｄｄｉｉｉｉｄｄｄｉｉｉｃｔｔｔｃｅｉｉｉｄｄｄｄｄｄｄｄｄｄｄｉｉｅｃｔｔｅｉｄｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｄｄｄｄｉｉｅｃｔｔｔｃｉｉｉｉｄｄｄｄｄｄｄｄｄｄｄｄｄｉｉｉｃｔｔｅｄｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｄｉｉｉｄｄｄｉｒｃｔｔｔｃｅａｉｉｉｄｄｄｄｄｄｄｄｄｄｄｄｄｄｄｉｄｄｅｃｔｄｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｄｉｉｉｄｄｄｉｉｃｔｔｃｉｉｉｉｉｄｄｄｄｄｄｄｄｄｄｄｄｄｄｄｄｄｉｉｔｉｔｉｒｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｄｉｉｉｉｄｄｉｉｉｃｔｃｉｉｄｄｄｄｄｄｄｄｄｄｄｄｄｄｄｄｄｄｄｉｉｉｄｉｔｉｄｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｄｉｉｉｉｉｄｄｉｉｉｃｔｅｉｉｄｄｄｄｄｄｄｄｄｄｉｉｉｄｄｄｄｉｉｉｃｉｅｃｉｄｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｄｉｉｉｉｉｄｄｄｉｉｅｔｔｅｉｉｐｄｄｉｉｉｄｄｉｉｉｉｉｄｄｉｉｉｉｉａｔｔｉｄｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｄｉｉｉｉｉｄｄｄｉｉｅｔｔｃｉｉｉｄｉｉｉｉｉｔｉｉｉｉｉｉｉｉｉｉｉｄｉｔｔｉｄｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｄｉｉｉｉｉｄｄｄｃｉｉｔｔｔｃｉｄｉｉｉｉｉｉｉｉｉｄｉｉｉｉｉｉｉｉｉｄｔｔｉｄｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｄｉｉｉｉｉａｄｄｄｉｉｔｔｔｅｄｉｉｉｉｄｉｉｉｉｄｄｄｉｉｉｉｄｄｉｉｉｄｔｉｄｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｄｉｉｉｉｉｉｄｄｄｉｉｔｔｔｐｉｉｉｉｄｄｄｉｉｔｄｄｄｄｒｉｄｄｄｄｉｉｉｅｉａｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｅｉｉｉｉｉｉｄｄｄｉｉｔｔｔｄｉｉｉｄｄｄｄｄｄｄｄｄｄｄｄｄｄｄｄｄｄｉｉｔｅｄｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｄｉｉｉｉｉｃｄｄｄｉｅｔｔｔｐｄｉｄｄｄｄｄｄｄｄｄｄｄｄｄｄｄｄｄｄｉｄｄｔｃｄｄｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｄｉｉｉｉｉｄｄｄｄｉｅｔｔｔｅｉｒｄｄｄｄｄｄｄｄｄｄｄｄｄｄｄｄｄｄｄｉｉｃｔｉｄｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｄｉｉｉｉｉｄｄｄｄｉｅｔｔｃｉｉｄｄｄｄｄｄｄｄｄｄｄｄｄｄｄｄｄｄｄｄｄｉｉｔｒｄｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｄｉｉｉｉｉｄｄｄｉｅｔｔｃｉｉｉｄｄｄｄｄｄｄｄｄｄｄｄｄｄｄｄｄｄｄｉｉｉｉｔｔｄｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｄｉｉｉｉｉｄｄｉｉｔｔｔｃｉｉｉｉｉｉｄｄｄｄｄｄｄｄｄｄｄｄｄｄｄｉｉｉｉｉｃｔｄｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｄｉｉｉｉｄｄｄｉｅｔｔｔｃｉｉｉｉｉｉｉｉｄｄｄｄｄｄｄｄｄｄｄｄｉｉｉｉｃｃｔｔｄｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｒｉｄｉｉｉｉｄｄｉｉｅｔｔｔｔｃｃｃｅｉｉｉｉｉｄｄｄｄｄｄｄｄｄｄｄｉｉｉｅｔｔｔｔｄｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｄｄｉｉｄｄｔｉｉｄｄｄｉｉａｅｃｔｔｔｔｔｔｃｅｅｉｉｉｄｄｄｄｄｄｄｄｄｉｉｉｃｔｔｔｃｉｄｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｄｉｉｉｉｉｄｄｄｉｄｄｄｉｉｉｉｉｉｃｔｔｔｔｔｔｃｉｉｉｉｄｄｄｄｄｄｄｄｉｉｉｔｔｔｃｉｉｄｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｄｉｉｉｉｉｉｉｐｉｉｉｄｄｄｄｉｉｉｉｉｃｔｔｔｔｔｔｃｉｉｉｄｄｉｒｉｉｄｄｉｒｃｔｔｃｉｉｄｄｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｄｉｉｉｉｉｉｉｄｉｉｉｉｄｄｄｄｄｉｉｉｉｅｃｔｔｔｔｔｅｒｉｄｉｉｉｉｉｉｄｉｃｔｔｔｉｉｉｄｄｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｄｄｉｉｉｉｉｉｉｉｄｃｉｉｉｉｄｄｄｄｉｉｉｉｉｒｃｔｔｔｃｉｉｉｉｉｉｉｉｉｉｉｅｔｔｅｉｉｄｅｄｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉａｄｉｉｉｉｉｉｉｉｄｅｉｉｉｉｄｄｄｄｄｉｉｉｉｉｅｔｔｔｃｉｉｉｉｅｉｔｒｉｉｉｃｔｃｉｉｄｄｄｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｄｉｉｉｉｉｉｉｉｄｃｒｉｉｉｉｄｄｄｄｄｄｉｉｉｉｅｔｔｔｉｉｉｅｃｃｔｔｅｉｉｔｔｉｉｄｄｉｄｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｄｄｉｉｉｉｉｉｉｄｃｉｉｉｉｉｉｒｄｄｄｄｄｉｉｉｉｅｔｔｅｉｅｃｔｔｔｔｔｃｃｔｅｉｄｄｉｄｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｄｄｉｉｉｉｉｄｄｉｃｔｉｉｉｉｉｉｄｄｄｄｄｉｉｉｅｔｔｔｃｔｔｔｔｔｔｔｔｔｔｉｄｄｉｄｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｄｄｉｉｉｉｉｄｉｃｉｉｉｉｉｉｉｉｄｄｄｄｄｄｉｅｔｔｔｔｔｃｃｃｃｅｃｔｔｉｄｉｄｄｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｄｄｄｉｉｉｉｄｔｒｉｉｉｉｉｉｉｉｄｄｄｄｉｉｅｔｔｅｉｉｉｉｉｉｉｉｔｄｉｉｄｉｉｄｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｄｄｃｉｉｉｉｄｉｔｔｃｃｉｉｉｉｉｉｉａｄｄｉｉｉｉｉｅｐｄｄｄｐｉｉｉｉｉｉｉｉｉｉｒｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｄｄｉｉｉｉｄｉｔｉｉｉｅｃｒｒｒｉｉｉｐｉｉｉｒｒｒｒｒｒｒｒｒｉｉｉｉｉｉｉｄｉｉｄｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｄｉｉｉｉｄｉｉｄｄｄｔｉｒｉｉｉｉｉｒｒｒｒｒｒｒｒｉｉｉｉｉｉｉｉｉｉｉｉｄｄｉｄｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｄｉｉｉｄｄｄｄｄｄｄｄｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｅｄｉｄａｒｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｄｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｄｉｃｉｔｄｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｄｉｉｉｉｉｉｉｔｔｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｄｔｔｃｔｄｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｄｄｉｉｉｉｉｄｄｃｉｉｉｉｉｉｉｉｉｉｉｉｉｉｄｐｉｉｉｉｉｉｉｄｄｔｉｃｃｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｄｅｄｄｅｅｅｄｄｄｉｉｉｉｉｉｉｉｉｉｉｉｄｉｉｉｉｉｉｉｉｉｉｄｄｃｉｄｔａｄｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｄｉｄｄｉｉｃｉｄｄｄｄｄｉｉｉｉｉｉｉｉｐｉｅｐｄｉｉｉｉｉｄｄｄｄｔｄｄｉｔｔｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｄｉｄｄｄｅｃｅｉｄｄｄｄｄｉｉｉｉｉｉｉｄｉｄｔｃｄｉｄｉｒｄｄｅｉｃｄｄｃｉｉｄｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//    ｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｄｉｉｄｄｄｅｔｅｉｄｄｄｄｄｄｄａｉｉｉｐｉｔｄｄｅｉｄｉｉｄｄｉｃｉｄｉｔｉｄｅｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉｉ    //
//                                                                                            //
//                                                                                            //
////////////////////////////////////////////////////////////////////////////////////////////////


contract RCS2gm is ERC1155Creator {
    constructor() ERC1155Creator("RCS2gm", "RCS2gm") {}
}