{"SourceCode": "{{\r\n  \"language\": \"Solidity\",\r\n  \"sources\": {\r\n    \"contracts/storage/IStorage.sol\": {\r\n      \"content\": \"pragma solidity ^0.8.4;\\n// SPDX-License-Identifier: GPL-3.0-or-later\\n\\n// https://soliditytips.com/articles/solidity-interface-interact-with-other-contracts/\\ninterface IStorage {\\n    function getById(uint256 id) external returns (string memory unit);\\n    // Add more function signatures as needed.\\n}\"\r\n    },\r\n    \"contracts/storage/unit/UnitStorage12.sol\": {\r\n      \"content\": \"     \\npragma solidity ^0.8.4;\\n// SPDX-License-Identifier: GPL-3.0-or-later\\nimport \\\"../IStorage.sol\\\";\\n\\ncontract UnitStorage12 is IStorage{\\n    string[] public units;\\n    \\n    // set to onlyOwner()\\n    // check if value exists - \\n    constructor(){\\n        //212\\n       units.push(\\\"How agents share the data stored on the network ledger is a matter of protocol design. Individual agent data is defined as private, but aggregated data forms the basis of a data commons, in which individual agents may choose their degree of participation.\\\");\\n       units.push(\\\"Tokens \\\\\\\\nTokens have many attributes, and those attributes are being introduced at different stages of the analysis. We first introduced tokens in a preliminary way in Chapter 1.4 and in Chapters 9 and 10 they will be given full development. In the current context, we focus on their role in market exchange in the Economic Space Protocol.\\\");\\n       units.push(\\\"Tokens are tickets that signal rights. Formally, fiat money is a subset of tokens[74] and some crypto-tokens, most notably bitcoin, stand with fiat money as a centrally-issued (though distributedly verified) token system. In the Economic Space Protocol, tokens are bearer (smart) contracts, and can express a multitude of modes of instruction. For example, some tokens are more akin to entry tickets (to a bus, concert, etc.) which have a particular use: they are issued by agents and once they have been used, they cannot be reused. Others may be used for clearing of credit, a process explained in Chapter 8. Yet others may be utilized to receive a stream of dividends.\\\\\\\\n\\\\\\\\n[74] The term \\\\\\\\u2018chartalism\\\\\\\\u2019 to describe state-issuance of money comes from the Latin \\\\\\\\u2018charta,\\\\\\\\u2019 meaning \\\\\\\\u2018ticket\\\\\\\\u2019 or \\\\\\\\u2018token\\\\\\\\u2019; indicating that money is a type of token.\\\");\\n       units.push(\\\"In the new economic space a token is an exclusive, quantifiable set of rights, whose transfer is recorded on and enforced through a ledger. The state of the token is always reflected in the accounting derived from the ledger. When an offer is made by one agent and matched by another (for example for exchange of a commodity), the receipt of the commodity triggers the issuance of a token by the agent who matched the offer; recording the completion of the transaction. So it is individual agents, not a central authority who issues tokens. Some tokens may be redeemed, and become inactive.\\\");\\n       units.push(\\\"Immediately we see that these tokens are not what is popularly thought to be \\\\\\\\u2018money\\\\\\\\u2019 or \\\\\\\\u2018coins.\\\\\\\\u2019 They are neither being \\\\\\\\u2018minted\\\\\\\\u2019 (an operation applicable to \\\\\\\\u2018coins\\\\\\\\u2019; not to bearer contracts) or exclusively issued by privileged third parties (as applies with fiat currencies). Hence tokens are not, in themselves, a preferred or agreed upon store of value: a token must always attach to (stand for) a \\\\\\\\u2018real\\\\\\\\u2019 asset (encoded as a set of contractual rights). A more precise concept is \\\\\\\\u2018material underlier\\\\\\\\u2019 and there must be \\\\\\\\u2018real\\\\\\\\u2019 asset transfers associated with token exchanges.[75] For example, wealth may be stored as stake, and recorded by a token entry in the network ledger to that effect (an asset recorded in a ledger as X stake tokens).\\\\\\\\n\\\\\\\\n[75] In the terminology of Gurley and Shaw (1960) third party issued monies like fiat currency and bitcoin are \\\\\\\\u2018outside money.\\\\\\\\u2019 Outside money may certainly enter the new economic space, but it will do so as a commodity for exchange. A transfer of outside money within the network will be matched by a token transfer, as it is for any commodity exchange.\\\");\\n       units.push(\\\"In the light of this clarification of tokens, an economic space, as defined in Chapter 3.3, can be respecified as a network where every agent participates in the distribution of tokens, exchanging offers, and archiving those interactions on a verifiable record.\\\");\\n       units.push(\\\"WAYS OF \\\\\\\\u2018PRICING\\\\\\\\u2019\\\");\\n       units.push(\\\"In Chapter 2 we developed a critique of the Hayekian focus on prices and the propensity to reduce all information to a single index. Our counter-proposal was the need to preserve the complexity of information, for it may well find new meaning (form into new performances and new outputs) over time.\\\");\\n       units.push(\\\"In the Economic Space Protocol, an act of exchange registers a transfer of title (ownership), and that transfer will be recorded at a \\\\\\\\u2018price,\\\\\\\\u2019 in the sense that an object of ledger transfer is attributed a rate of exchange. Our analysis must describe the formation of that quantity, but for now we invoke the idea that an output finds validation (is attributed with value) in the network. The word \\\\\\\\u2018price\\\\\\\\u2019 is a word that has a popular meaning akin to the way it is used by Hayek, but it is a term we should not surrender to that specific meaning. To reclaim the word we introduce four different notions of \\\\\\\\u2018price\\\\\\\\u2019: \\\\\\\\n- _A direct price_. This is a price determined in point-in-time exchange between the agent and the network (ultimately another agent) for a quantum of tokens in an open market. This is somewhat parallel to that found in Hayek, with the additional information dimensions. \\\\\\\\n- _An indirect price_. This is a price that emerges on the network over time. This will be found for outputs that find no direct price but become inputs into other outputs that do find a direct price. Here is where the maintenance of a chain of information is critical. By following a chain of output-becoming-inputs-becoming-outputs to a point where a direct price is found, the network can retrospectively attribute a share of that direct price to formerly-unpriced inputs back down the chain (see Appendix 4.2). \\\\\\\\n- _A tribute._ Some right transfers will fit the category of a gift. These could be between individual agents but, most critically for the Economic Space Protocol, these may be gifts to the commons (see Chapter 6.3). The counter-gift is access to the commons, on terms at the discretion of the commons. \\\\\\\\n- _A synthetic price._ This is a price which can be created by the network to account for outputs which are consumed collectively, most notably those given as tribute. The formula for a synthetic price is (socially validated) costs of production + the average rate of return for the network. Some outputs in the network can be said to produce value (they are socially valued) but they are not designed to be sold. When the network wants to value these (for example in calculating total output of the network) it may invoke a synthetic price.\\\");\\n       units.push(\\\"Indirect prices, tributes and synthetic prices have no parallel in Hayek. They are the forms of price that link most to the process of staking performances.\\\");\\n       units.push(\\\"PEER-TO-PEER; DECENTRALIZED TO DISTRIBUTED\\\");\\n       units.push(\\\"Economic relations can be thought of as hierarchical or distributed. Hierarchical relations may be centralized (at the top of the pyramid) or decentralized (pushed down the pyramid, for example to regions or sectors or lower down the hierarchy to towns or workplaces). There are also different forms of vertical communication.[76]\\\\\\\\n\\\\\\\\n[76] Hayek and indeed all \\\\\\\\u2018neoliberal\\\\\\\\u2019 economics advocates decentralized markets, with some conditions of \\\\\\\\u2018market failure\\\\\\\\u2019 and exceptional use of an active centralized agent. Hayek wanted the money used in exchange to be decentralized; the neoclassicals want it centralized.\\\");\\n       units.push(\\\"We should also distinguish decentralized from distributed. When decision making is decentralized, it is nonetheless part of a hierarchical system. \\\\\\\\u2018Distributed\\\\\\\\u2019 is defined without reference to hierarchy: all agents have the same formal capacities. In the Economic Space Protocol it means that there is one grammar in the network that every agent can speak, but no central authority: not even a virtual one.\\\");\\n       units.push(\\\"In relation to \\\\\\\\u2018money,\\\\\\\\u2019 centralized money issuance and centralized clearing divides agents in the network in two classes: those that can issue/clear money, and those that cannot. In the Economic Space Protocol all agents are peers who have the capacity to issue and clear without need for the service of specialized third parties.\\\");\\n       units.push(\\\"Centralized architectures are optimal for mediums that propagate and process information slowly, and hence must maintain information locally. But they scale poorly, as the capacity to react to information, and back-propagate it, becomes increasingly slow as the network grows. High speed communications and information processing media make centralized networking architecture obsolete. It is now possible to distribute to individual agents roles with high information requirements.\\\");\\n       units.push(\\\"SOCIAL OBJECTIVES\\\");\\n       units.push(\\\"Two issues can be framed here: how agents behave and how collective agendas are expressed in the Economic Space Protocol.\\\");\\n       units.push(\\\"Agents and their goals \\\\\\\\nJust as the engineering requirements of a network mean starting the analysis with exchange, so there is the requirement of starting with individual agents. The Economic Space Protocol designs the infrastructure through which these agents express their sociality but without a central agent imposing specific social goals. These are process-oriented protocols; not an ends-means system.\\\");\\n       units.push(\\\"The Economic Space Protocol is designed to endow individual agents with a diversity of goals and provide them with capacity to generate a range of modes of measurement of their performances. Agents can pursue goals of their own choosing and measure in ways of their own choosing, but the value proposition of the network means that their success in achieving those goals must be validated by other agents. Sociability is therefore centered on addressing the question of \\\\\\\\u2018what constitutes network \\\\\\\\u2019value,\\\\\\\\u2019 and how are the rewards for value creation shared across the network?\\\");\\n        // 230\\n    }\\n    function set(uint256 location, string calldata _unit) external {\\n        units[location] = _unit;\\n    }\\n    function getById(uint256 location) external override returns (string memory unit) {\\n        return units[location];\\n    }\\n\\n}\"\r\n    }\r\n  },\r\n  \"settings\": {\r\n    \"optimizer\": {\r\n      \"enabled\": false,\r\n      \"runs\": 200\r\n    },\r\n    \"outputSelection\": {\r\n      \"*\": {\r\n        \"*\": [\r\n          \"evm.bytecode\",\r\n          \"evm.deployedBytecode\",\r\n          \"devdoc\",\r\n          \"userdoc\",\r\n          \"metadata\",\r\n          \"abi\"\r\n        ]\r\n      }\r\n    },\r\n    \"libraries\": {}\r\n  }\r\n}}", "ABI": "[{\"inputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"constructor\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"location\",\"type\":\"uint256\"}],\"name\":\"getById\",\"outputs\":[{\"internalType\":\"string\",\"name\":\"unit\",\"type\":\"string\"}],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"location\",\"type\":\"uint256\"},{\"internalType\":\"string\",\"name\":\"_unit\",\"type\":\"string\"}],\"name\":\"set\",\"outputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"\",\"type\":\"uint256\"}],\"name\":\"units\",\"outputs\":[{\"internalType\":\"string\",\"name\":\"\",\"type\":\"string\"}],\"stateMutability\":\"view\",\"type\":\"function\"}]", "ContractName": "UnitStorage12", "CompilerVersion": "v0.8.4+commit.c7e474f2", "OptimizationUsed": "0", "Runs": "200", "ConstructorArguments": "", "EVMVersion": "Default", "Library": "", "LicenseType": "", "Proxy": "0", "Implementation": "", "SwarmSource": ""}