{"SourceCode": "{{\r\n  \"language\": \"Solidity\",\r\n  \"sources\": {\r\n    \"contracts/storage/IStorage.sol\": {\r\n      \"content\": \"pragma solidity ^0.8.4;\\n// SPDX-License-Identifier: GPL-3.0-or-later\\n\\n// https://soliditytips.com/articles/solidity-interface-interact-with-other-contracts/\\ninterface IStorage {\\n    function getById(uint256 id) external returns (string memory unit);\\n    // Add more function signatures as needed.\\n}\"\r\n    },\r\n    \"contracts/storage/unit/UnitStorage23.sol\": {\r\n      \"content\": \"     \\npragma solidity ^0.8.4;\\n// SPDX-License-Identifier: GPL-3.0-or-later\\nimport \\\"../IStorage.sol\\\";\\n\\ncontract UnitStorage23 is IStorage{\\n    string[] public units;\\n    \\n    // set to onlyOwner()\\n    // check if value exists - \\n    constructor(){\\n        //422\\n       units.push(\\\"So our analysis must restate the three conditions; particularly the second and third.\\\");\\n       units.push(\\\"Distributed issuance \\\\\\\\nAs an agent-to-agent relationship (more precisely, an agent-to-network-to-agent relationship), distributed issuance has come up in earlier chapters. In itself, it is a straightforward process. All agents have the capacity to offer and/or accept credit to/from other agents. This means that each agent is not just a producer, participating in performances, and an investor, staking other agents\\\\\\\\u2019 performances, but also a \\\\\\\\u2018bank,\\\\\\\\u2019 issuing and receiving credit.[123]\\\\\\\\n\\\\\\\\n[123] Although this phrase could describe a Local Exchange Trading Systems (LETS), where the term \\\\\\\\u2018mutual credit\\\\\\\\u2019 is used to describe the creation of IOUs, we are referring to scalable, tokenized credit.\\\");\\n       units.push(\\\"We understand that some readers will immediately be skeptical about the idea of agents being banks, for they will see banks as being at the core of the problem of capitalism; not a means of its transformation. The idea that all agents can be banks is rhetorical when we think of banks as institutions, but the idea that all agents can be issuers as well as receivers and clearers of credit is entirely serious. Indeed this is at the center of Hyman Minsky\\\\\\\\u2019s approach to finance: \\\\\\\\nTo analyze how financial commitments affect the economy it is necessary to look at economic units in terms of their cash flows. The cashflow approach looks at all units - be they households, corporations, state and municipal governments, or even national governments - as if they were banks. (1986: 221)\\\");\\n       units.push(\\\"In a protocol framework, the proposition is that the recording on a ledger of each individual agent\\\\\\\\u2019s borrowing and lending is the same whether this agent is a person, a household or an assembly of people. We therefore turn to the capacity of agents and the network to \\\\\\\\u2018be banks\\\\\\\\u2019 and issue (and clear) credit, and the critical dimension here is staking.\\\");\\n       units.push(\\\"STAKE AS COLLATERAL: THE FOUNDATION OF CREDIT\\\");\\n       units.push(\\\"The capacity to issue credit has already been prefigured as a network logic, but without being named as credit. The model of stake issuance introduced in Chapter 5.2 is implicitly a credit-issuance logic.\\\");\\n       units.push(\\\"A basic credit-issuance logic, standard in financial economics, is that a bank issues dollar credit of its own _private_ creation. The dollars it issues are used by the borrower to make payments to others, who deposit their received money in their own bank, which may be different from the borrower\\\\\\\\u2019s bank. The private issuance is now accepted by the depositor\\\\\\\\u2019s bank; indeed that bank will not know the direct source of the money it has taken on deposit. There has simply been the acceptance/absorption of the newly created money: it has been declared to be money. The privately-issued money is now part of the banking _system_ and thereby validated as _social_ money.[124]\\\\\\\\n\\\\\\\\n[124] This isn\\\\\\\\u2019t the skeptic\\\\\\\\u2019s view of banks and money creation, it is the view of the Bank of England. See McLeay, et al (2014) and Bank of England (2014).\\\");\\n       units.push(\\\"Similarly in relation to stake in the Economic Space Protocol. An agent in the new economic space creates stake by _privately_ investing in other agents and receiving investment from other agents. These investments now appear to the _network_ as an agent holding a portfolio of stake, which is taken _socially_ as collateral for credit. The issuance of stake involves stake ownership rights being declared as an asset. It is essentially the same logic as banking. By analogy, when each agent in the network not only undertakes performances but acquires stake in other agents\\\\\\\\u2019 performances, and uses that stake as collateral for credit issuance, each agent is a producer, an investor and also a bank.\\\");\\n       units.push(\\\"Once the network can bring a portfolio of stake into existence, analytically it is straightforward to count that stake as collateral, declared in the network\\\\\\\\u2019s unit of exchange. Stake then becomes collateral for a line of credit issued in that same unit of exchange, now simply renamed a unit of credit.\\\");\\n       units.push(\\\"Several propositions follow from this simple connection: \\\\\\\\n- _All credit can be fully collateralized._ Lenders can nominate their required level of collateral, so individual agents will be operating with banking capacities akin to those of shadow banks.[125] This adds stability to the lending (minimizing default risk), and the costs of any default will be borne across the network. \\\\\\\\n- _Credit has a material basis._ The claims attached to stake ownership give a material basis to credit. \\\\\\\\n- _Expanding stake expands credit._ There is an ongoing incentive for agents who are developing a performance to issue stake on that performance, and to buy stake in others, for the more stake they acquire, the greater their capacity to secure credit.\\\\\\\\n\\\\\\\\n[125] Note the definition of shadow banking in footnote 24.\\\");\\n       units.push(\\\"The proposition embedded here is that the value of stake-as-collateral can be priced and verified across the network. Each agent is therefore aware that the path to their own liquidity is to issue liquidity to others. This is not merely an ethical exercise of mutual support, though it will embrace that. The point is that, in the design of the Economic Space Protocol, there are no disincentives to any agent issuing collateralized credit when the network faces illiquidity, and hence no grounds for interest payments.\\\");\\n       units.push(\\\"NETWORK RECOGNITION OF CREDIT AND CREDIT SETTLEMENT\\\");\\n       units.push(\\\"When the network adopts a capacity for credit issuance, credit itself becomes the liquid expression of the unit of exchange and the key to the verification of value within the network. Credit is the means to express all value in the network in the same units. The process here is critical to understanding the new economic space and the proposition that a network that has no central issuance of money (no conventional \\\\\\\\u2018money\\\\\\\\u2019) can nonetheless have network-wide credit at its core.\\\");\\n       units.push(\\\"A simple proposition is the key. All stake is different, but all credit is of the same kind. We first explain the proposition before clarifying how it is key.\\\");\\n       units.push(\\\"Each unit of stake is a holding in a different performance, undertaken by a different agent. The differences between each stake are important, for acquiring a range of stakes gives an agent the diversity of risk exposures in their stake portfolio. In aggregate, the linked diversity of reciprocal staking gives the network a common investment in a network future: there is unification via risk sharing (\\\\\\\\u2018risking together\\\\\\\\u2019).\\\");\\n       units.push(\\\"But credit is all of the same kind, and its fungibility is integral to its role. It is denominated in the network\\\\\\\\u2019s unit of exchange (hence the unit of exchange is also the unit of credit) and it can be used throughout the network: credit is not tied to the particular performances that formed the collateral of credit. In simple terms, the IOUs of credit can be used for transactions across the network and can be repaid across the network. Put slightly differently, within a network of credit, where agents are both borrowers and lenders, no agent can know which particular chain of credit they link to,[126] so there is a logical demand for a common unit in which to express credit (Doepke and Schneider 2013).\\\\\\\\n\\\\\\\\n[126] Fleischman et al.(2020) offers an interesting twist on this proposition: the identification of credit loops which could be cleared by the temporary injection of an agreed monetary unit.\\\");\\n       units.push(\\\"It follows that liquidity arises not through exchange (\\\\\\\\u2018monetized barter\\\\\\\\u2019) but through commensuration across a network, and its form of expression is in credit.\\\");\\n       units.push(\\\"What, then, is the significance of the identification that all stake is different and credit is universal? Here we have to \\\\\\\\u2018loop back\\\\\\\\u2019 and recall that staking is the way in which agents in the network express their relative views on what performances contribute to network value (Chapter 5.2). The incentive in staking is to invest in the performances that you believe make the greatest contribution of aggregate, network value. The outcome of the aggregate of these staking decisions is the collective determination of that network value. The dialectical relationship between the choice of staking and the value of stake is integral.\\\");\\n       units.push(\\\"At the point of the analysis where this valuation process was initially described, it could only be expressed in relative terms, as staking ratios. But credit and liquidity open the path for these ratios to be expressed in the unit of exchange; as prices, and given the appearance of absolute measures.[127]\\\\\\\\n\\\\\\\\n[127] It is only an appearance, and should always be acknowledged as such.\\\");\\n       //440\\n    }\\n    function set(uint256 location, string calldata _unit) external {\\n        units[location] = _unit;\\n    }\\n    function getById(uint256 location) external override returns (string memory unit) {\\n        return units[location];\\n    }\\n\\n}\"\r\n    }\r\n  },\r\n  \"settings\": {\r\n    \"optimizer\": {\r\n      \"enabled\": false,\r\n      \"runs\": 200\r\n    },\r\n    \"outputSelection\": {\r\n      \"*\": {\r\n        \"*\": [\r\n          \"evm.bytecode\",\r\n          \"evm.deployedBytecode\",\r\n          \"devdoc\",\r\n          \"userdoc\",\r\n          \"metadata\",\r\n          \"abi\"\r\n        ]\r\n      }\r\n    },\r\n    \"libraries\": {}\r\n  }\r\n}}", "ABI": "[{\"inputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"constructor\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"location\",\"type\":\"uint256\"}],\"name\":\"getById\",\"outputs\":[{\"internalType\":\"string\",\"name\":\"unit\",\"type\":\"string\"}],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"location\",\"type\":\"uint256\"},{\"internalType\":\"string\",\"name\":\"_unit\",\"type\":\"string\"}],\"name\":\"set\",\"outputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"\",\"type\":\"uint256\"}],\"name\":\"units\",\"outputs\":[{\"internalType\":\"string\",\"name\":\"\",\"type\":\"string\"}],\"stateMutability\":\"view\",\"type\":\"function\"}]", "ContractName": "UnitStorage23", "CompilerVersion": "v0.8.4+commit.c7e474f2", "OptimizationUsed": "0", "Runs": "200", "ConstructorArguments": "", "EVMVersion": "Default", "Library": "", "LicenseType": "", "Proxy": "0", "Implementation": "", "SwarmSource": ""}