// SPDX-License-Identifier: MIT

pragma solidity ^0.8.0;

/// @title: Amber Vittoria Timed Editions
/// @author: manifold.xyz

import "./manifold/ERC1155Creator.sol";

////////////////////////////////////////////////////////////////////////////////////////////
//                                                                                        //
//                                                                                        //
//                                                                                        //
//                                                                                        //
//                                                                                        //
//                                                                                        //
//                                                                                        //
//                                     ,▄                                                 //
//                            └       ▓█     a▓▀                                          //
//                               └╙▓▓▀█▀▀▀╠▓╙╙▌╙╙╙╙╙▀╙               ,                    //
//                ,,     ,µª▀█   ▄▀  ]▀ ╓▀   ╟¬        ,▄»≈*▀▌    ╓Θ╠█  ╓═╗Æ▀▄            //
//             ╙└└ ▐▌,,▄▀   ▐▌ Æ▀   ,█Æ▀    ]▌  ▄K"]█ ╠b    ▐⌐ ▄K╙  █▄"  ▓▄Æ█▌    ,▄Æ▀    //
//                 ▐▌,╩     ╙▀`      `      █Æ▀    ╙▀"└     ╙▀└          └   └└           //
//                 ╘▀`                                                                    //
//                                                                                        //
//                                                                                        //
//                                                                                        //
//                                                                                        //
//                                                                                        //
//                                                                                        //
//                                                                                        //
//                                                                                        //
////////////////////////////////////////////////////////////////////////////////////////////


contract AVTD is ERC1155Creator {
    constructor() ERC1155Creator("Amber Vittoria Timed Editions", "AVTD") {}
}