{"SourceCode": "{{\r\n  \"language\": \"Solidity\",\r\n  \"sources\": {\r\n    \"contracts/storage/IStorage.sol\": {\r\n      \"content\": \"pragma solidity ^0.8.4;\\n// SPDX-License-Identifier: GPL-3.0-or-later\\n\\n// https://soliditytips.com/articles/solidity-interface-interact-with-other-contracts/\\ninterface IStorage {\\n    function getById(uint256 id) external returns (string memory unit);\\n    // Add more function signatures as needed.\\n}\"\r\n    },\r\n    \"contracts/storage/unit/UnitStorage37.sol\": {\r\n      \"content\": \"     \\npragma solidity ^0.8.4;\\n// SPDX-License-Identifier: GPL-3.0-or-later\\nimport \\\"../IStorage.sol\\\";\\n\\ncontract UnitStorage37 is IStorage{\\n    string[] public units;\\n    \\n    // set to onlyOwner()\\n    // check if value exists - \\n    constructor(){\\n        //693\\n       units.push(\\\"Finance is normally thought through pricing information, efficient market hypothesis and rational decision making under uncertainty. We want to move into bringing the qualitative, the affective and flowing into the picture. It means a fundamental change in understanding economic sense-making and economic relationality. It is more about navigation: navigating the new economic space-time. Hence the importance of the network indices (measurement knowledges). The navigator-steerman-guide (kybernetes) is the new meaning of governance. See Econautics. See Platos\\\\\\\\u2019s Statesman. See Finance.\\\");\\n       units.push(\\\"Netting is the process by which a range of diverse ledger entries are calculated to a net position for each agent in relation to each other agent. Clearing is netting with a temporal dimension.\\\");\\n       units.push(\\\"Two or more agents connected to each other through the same protocol.\\\");\\n       units.push(\\\"Network assets are new kinds of tokens that the economic space protocol makes possible. Tokens in the economic space protocol are always network objects or distributed objects (vs. replicated objects), i.e., bundles of rights that have a capacity to affect others and be affected by others in the network and that can be exclusively transferred and communicated through the network. They can change the state of many other assets (objects) that belong to other agents and read their state. As such state change triggers, they are predicated on the distributed accounting protocol. For example, the distributed credit protocol is an accounting sub-protocol which makes the network assets to have a credit function so they can clear each other. Or, in the same way, the distributed stake protocol is an accounting sub-protocol which gives the stake tokens a \\\\\\\\u201Cpipe function\\\\\\\\u201D which allows values to flow through and between them and where the amount of stake determines how much can flow in the pipe. As network assets, credit and stake are protocols which give their holders an access to a whole lot of objects and functions. They are networking tokens that network many tokens and give their holders capacities that go beyond one agent. As network assets, tokens form a two-way communication interface: through them you can affect the network, as the network asset (object) allows you to refer to other assets (objects) that belong to other agents; and through them the network can affect and inform you. See Network derivative.\\\");\\n       units.push(\\\"Commodities are always summations of processes, but today these processes are networked and do not always result in objects. Network commodities (a.k.a. performances) are rather in a relationship to their environment. They no longer have clear boundaries and can be held, sold, and operated on in distributed ways. They have an informatic dimension that may remain dynamic, semiotic, transactable. They also expand the notion of ownership into a definition that can be articulated in an expression that can be much more nuanced and granular. In the case of network commodities you seldom own the \\\\\\\\u201Cthing\\\\\\\\u201D but more often have access to what it does.\\\");\\n       units.push(\\\"Tokens and assets in the economic space protocol are network derivatives. As a concept, network derivative expands a token beyond just a \\\\\\\\u201Ctoken\\\\\\\\u201D, to the metrics that are the underliers of the token. If a network index (performance index) is a measure of an aspect of the performance of a network, then the network derivative represents a position on the index: it expresses a connection to the underlying vitality of each specific and purposeful network. Network derivative is a right to an underlying \\\\\\\\u2013 it carries always information about the underlying process that creates it. Network derivatives are like a two way interface to massively distributed systems: through network derivatives you can both sense into them and affect them. Network indices and network derivatives built from this information will be the primary content discovery paradigm of the Economic Web where nodes are economic space agents and tokens the links in the network - just like keyword based search was the dominant content discovery paradigm in Web 1.0 (where nodes were documents and hyperlinks the links in the network) and social based feed was for Web 2.0. (where nodes were people, brands and likes/follows the linking mechanism).\\\");\\n       units.push(\\\"Like money and markets, the economic space protocol is a \\\\\\\\u201CLayer 1\\\\\\\\u201D economic protocol that allows agents and their performances to coordinate and organize into higher-order networks. Interoperability makes possible the collaboration required to create collective performances and outputs. In this way, agents may unlock additional returns by articulating the collective surplus values that arise from economic space interconnectedness. Furthermore, through the protocol, users may design economic relationships that create and capture the latent wealth that otherwise would be inaccessible. We understand economy as a network, where value is created not only by individual agents, but by their relationships and organization. There is a premium in being networked. We call it the network premium. The economic space protocol is primarily an economic collaboration and interoperability protocol. It is like an economic intellect which enables the assemblage of economic spaces, and their performances, to not only capture the value of each individual economic space, but the value created by their interoperability and relationships and thus of the network as a whole. This assemblage requires collaboration, and thus a protocol that not only makes it possible, but also rewards the participants for doing so. The economic space protocol allows users both to capture the value within each individual economic space, and also unlock additional value from collective network effects arising from multiple interconnected economic spaces. That is the network premium: the premium that emerges only by the virtue of being networked and interoperable.\\\");\\n       units.push(\\\"(1) Offer is a protocol, but also an expression of intent among agents. It creates a new relationship and a new space for that relationship. An economic space is collaborative in nature. Since collaboration requires voluntary participation, such collaboration is mediated through offers. An offer is the mechanism by which agents express to each other specific instructions to accomplish their intent. Like a protocol, an offer is a set of expressions \\\\\\\\u2013 a performance script \\\\\\\\u2013 that unambiguously and clearly encode a process to be reliably performed within the scope of a space. Unlike a protocol, these expressions are not determinate, and can be amended through an \\\\\\\\u201COffer composition\\\\\\\\u201D (a.k.a. performance scripting) process, making the offer an offer network (and a performance a performance network). Offer is one of the key structures to multi-agent reflective network programming. The expressions in the offer must follow the economic space grammar, and may issue or invoke economic space rights; for example to issue other offers, create new spaces, new roles, new tasks, new rights or new objects, altering the state of the space. \\\\\\\\n(2) Offer is a social relation beyond \\\\\\\\u201Ccontract\\\\\\\\u201D: it is a very different way to create structure to organize volatility. Offer is more than a contract, because it adds and opens a time interval and an interpretant, moving us thus beyond the semiotics of e.g. Nick Szabo and Mark S. Miller (smart contract as an authoritarian concept). Offer moves us from contracts to the realm of metapragmatic, co-textual, optional, and social derivatives. \\\\\\\\n(3) Offer describes a potential exchange of rights. When the offer is matched tokens are created as the vehicles for transferring those rights.\\\");\\n       units.push(\\\"If output is the result of a performance, the key task in terms of valuation, is to measure the outcomes of the output. In the new economic space, the measure of outcomes is equivalent to the process by which the network attributes value to the outputs of a performance. Outcomes are the way in which the network will recognize a performance\\\\\\\\u2019s value.\\\");\\n       units.push(\\\"Output is anything economically offered and accepted. It is the result of a performance.\\\");\\n       units.push(\\\"Peer-to-peer means that every economic agent has the same capacities and can interoperate without centralized management.\\\");\\n       units.push(\\\"A performance is an informational event or a series of informational events. It can be any informational event the network records. It can make anything economically expressible. You can frame a network\\\\\\\\u2019s production as a stream of performances (series of informational events) that its participants may publish, validate, and value. These may include the production of commodities, but the protocol can frame any activity as an economic performance making more abstract and intangible forms of value economically expressible and relatable. As such it is a category of production, social interaction and world-creation that names the emergent superset for other productive capacities designated by terms including labor, attention, attention economy, cognition, cognitive capitalism and virtuosity. At the economic level of abstraction performance (as a series of connected informational events) is like the economic word for a protocol. It is an activity of an agent, or of multiple agents enacting it together: a series of events, causally connected to each other, making performances naturally composable and divisible. A performance can form an agency. Performances are formed to seek network recognition (valuation) through offering them. They always include their own logic, of issuance, what they are going to create, how they distribute their surplus, assets etc. Everyone participating in the performance thus participates in its issuance.\\\");\\n       units.push(\\\"Performance index (a.k.a. network index) measures one or more dimensions of activity of one or more economic agents: it measures its/their economic performance. Performance index can be any computed value of a network, anything that can be measured, registered, computed. It turns a series of such informational events (performance) into a purely information based commodity: anything that can be perceived as value can be articulated as an economic event. The measurement of a performance is a vector: a scalar associated with the specific logic from which it is generated (its logical dimension). A performance index represents the compression of the information of the performance into a numerical index. This compression can take many forms, such as a performance event counter, an average, a mean, or even derivatives measures, such as speed or acceleration. Specific performance index values may represent _economic events_ themselves, and as such they can be utilized to create new composite performances and indexes. Economic spaces contain a wealth of information that can be utilized to create performance indices/metrics. The available data readily includes not only all data about tokens and their performances, but also all data about network organizations and their performances (material progress, governance, stakes, cleared credit, realized state changes, agents and their behaviors, what has been accomplished). Indices give economic agents the capacity to make sense of information and guide their behavior. They offer a capacity to enact new social priorities; to author futures in cooperation with others; to set incentives and attractors (temporal, indexical measures) for collaborations to occur and make them self-sustaining; it allows economic agents to collectively value intangibles and other values, make them collectively sensible, visible & recognized as valuable, put them into operation, circulation, and organize, regulate & incentivize social behavior around their production.\\\");\\n       units.push(\\\"Performance script is a description of the performance which allows it to be perceived, communicated and enacted. It describes how things operate between multiple agents. It is the expression that combines sequences of actions, which are themselves performances, of any agent, into a performance. It both aggregates it logically and tranches participation in its production process. It is the \\\\\\\\u201Ceconomic code\\\\\\\\u201D that the computational framework uses to recognize a series of events as such and such, i.e. composing a performance. Actual performance then carries out or performs the script. Commodity (performance) token is then the economic valuation of that particular script.\\\");\\n       units.push(\\\"Performative declares something into existence. It creates what it refers to in the very utterance. It does things by saying it. It is based on the ability of language to talk about anything, including itself.\\\");\\n       units.push(\\\"Price is a network index on underlying information that reduces complex information into something simple. It is just one way to index information, and though it gets treated as the privileged index of valuation in capitalism, it is just a political and social construct, i.e., an expression. We can design many different kinds of indices to help us navigate. Price does not capture innovation very well, as it runs only on one note. What if we could have a symphony?\\\");\\n       units.push(\\\"Postcapitalism is the economic space (economic network) that comes after capitalism. In postcapitalism, all agents can issue assets to be used as collateral if recognized as valuable by the network. Implicit here is the idea that a postcapitalism framed through finance can be depicted as an economy of continuous creation of new value-forms. Our wager is that a clear spread will open between what the old and the new economic space (economic network) make possible \\\\\\\\u2013 there is a clear difference in their expressive capacity, accessibility, stability, adaptability, scalability, privacy, functional equality and programmability. The ECSA token is a performance derivative designed to capture a share of the spread: it is a mechanism that rewards early participation and through which contributors can participate in the creation of the postcapitalist economic space. In other words, it offers tokenized exposure to the economic performance of the postcapitalist economic network, not ownership of the network infrastructure which is open and free to use.\\\");\\n       units.push(\\\"ECSA is developing a postcapitalist economic media. It is a more expressive medium to describe our economic networks, their participants, the nature of their relations and how they change, what they value, how it is counted and exchanged. Furthermore, it is a media that can make the value of any intangible, relational, informational (expression, care, the biosphere, communitsy) offerable, exchangeable, investable, liquidity creating, leverageable \\\\\\\\u2013 _economically expressible and relatable_ \\\\\\\\u2013 without collapsing all its information into \\\\\\\\u201Cprice\\\\\\\\u201D and \\\\\\\\u201Cprofitability\\\\\\\\u201D.\\\");\\n       units.push(\\\"ECSA is developing a new grammar for postcapitalist economic-organizational expression. The place where this postcapitalist economic network language is spoken and understood is the postcapitalist economic space. It is a place of value creation where qualified values can both be expressed, composed and rendered interoperable. It multiplies denominations, which remain interoperable, because they share the same grammar.\\\");\\n       units.push(\\\"We are creating a new kind of information infrastructure which allows new kinds of information flows - what counts as value, what counts as collateral, what counts as liquid - to enter an accounting system that articulates, accounts, moves and creates value.\\\");\\n       units.push(\\\"The economy is a programmable space. It is catching up with the new substrate of high speed computer networks with high informational capacities, bandwidth and connectivity. They are elevating the economy into something that resembles an expressive medium. As a medium, the economy is fundamentally a communication and writing system: an economic messaging protocol. Understanding the economy this way \\\\\\\\u2013 as a communication network on a programmable substrate \\\\\\\\u2013 reveals our economic relationships to be networking protocols. We believe _economic networks_ are the new economic abstraction, a value-producing, value-sharing and value-expressing form of informationally mediated society. Economic networks will be for Web3 what social networks were for Web2, and \\\\\\\\u201Cshared keyword\\\\\\\\u201D networks were for Web1. The key to making them accessible is in their programmability. Accessibility means ability to define value, what counts as liquidity, what as collateral. So not values just as ideas, stripped of power; here, values as new kinds of assets and collateral that can enter into circulation and change the outcome of events large and small. This expressive power needs to be made accessible \\\\\\\\u2013 programmable economy must be endlessly, ceaselessly made accessible to all, with equal functionality and equal rights of expression. That is why our economic networks need to become distributed.\\\");\\n    }\\n    function set(uint256 location, string calldata _unit) external {\\n        units[location] = _unit;\\n    }\\n    function getById(uint256 location) external override returns (string memory unit) {\\n        return units[location];\\n    }\\n\\n}\"\r\n    }\r\n  },\r\n  \"settings\": {\r\n    \"optimizer\": {\r\n      \"enabled\": false,\r\n      \"runs\": 200\r\n    },\r\n    \"outputSelection\": {\r\n      \"*\": {\r\n        \"*\": [\r\n          \"evm.bytecode\",\r\n          \"evm.deployedBytecode\",\r\n          \"devdoc\",\r\n          \"userdoc\",\r\n          \"metadata\",\r\n          \"abi\"\r\n        ]\r\n      }\r\n    },\r\n    \"libraries\": {}\r\n  }\r\n}}", "ABI": "[{\"inputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"constructor\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"location\",\"type\":\"uint256\"}],\"name\":\"getById\",\"outputs\":[{\"internalType\":\"string\",\"name\":\"unit\",\"type\":\"string\"}],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"location\",\"type\":\"uint256\"},{\"internalType\":\"string\",\"name\":\"_unit\",\"type\":\"string\"}],\"name\":\"set\",\"outputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"\",\"type\":\"uint256\"}],\"name\":\"units\",\"outputs\":[{\"internalType\":\"string\",\"name\":\"\",\"type\":\"string\"}],\"stateMutability\":\"view\",\"type\":\"function\"}]", "ContractName": "UnitStorage37", "CompilerVersion": "v0.8.4+commit.c7e474f2", "OptimizationUsed": "0", "Runs": "200", "ConstructorArguments": "", "EVMVersion": "Default", "Library": "", "LicenseType": "", "Proxy": "0", "Implementation": "", "SwarmSource": ""}