{"SourceCode": "{{\r\n  \"language\": \"Solidity\",\r\n  \"sources\": {\r\n    \"contracts/storage/IStorage.sol\": {\r\n      \"content\": \"pragma solidity ^0.8.4;\\n// SPDX-License-Identifier: GPL-3.0-or-later\\n\\n// https://soliditytips.com/articles/solidity-interface-interact-with-other-contracts/\\ninterface IStorage {\\n    function getById(uint256 id) external returns (string memory unit);\\n    // Add more function signatures as needed.\\n}\"\r\n    },\r\n    \"contracts/storage/unit/UnitStorage3.sol\": {\r\n      \"content\": \"     \\npragma solidity ^0.8.4;\\n// SPDX-License-Identifier: GPL-3.0-or-later\\nimport \\\"../IStorage.sol\\\";\\n\\ncontract UnitStorage3 is IStorage{\\n    string[] public units;\\n    \\n    // set to onlyOwner()\\n    // check if value exists - \\n    constructor(){\\n        //40\\n       units.push(\\\"Let\\\\\\\\u2019s do that.\\\");\\n       units.push(\\\"INTRODUCTION\\\");\\n       units.push(\\\"CONTESTING THE CURRENT ORDER\\\");\\n       units.push(\\\"Despite a deepening climate disaster, consecutive global economic crises and a socially devastating pandemic, the last two decades have found us living in an era of capitalist triumphalism. In almost all capitalist countries, political leaders celebrate their achievements in promoting economic growth and stock market record highs while \\\\\\\\u2018successfully managing\\\\\\\\u2019 wage growth. State \\\\\\\\u2018reforms\\\\\\\\u2019 of all kinds have seen growing precarity of those whose living standard is low and growing wealth and security for those at the top. Indeed increasing inequality seems to be the current engine of economic growth and it is only in the very recent past that concerns for the biosphere have looked like a constraint on that momentum. At an individual level, it is now clear to many people that the economic aspirations of a previous generation are no longer available to the majority of the population, and especially younger people. The combination of education, finding permanent employment, and saving diligently in a bank or pension fund is no longer a formula for life security \\\\\\\\u2013 it\\\\\\\\u2019s not available and increasingly it\\\\\\\\u2019s not aspired to. Education is now about debt accumulation with no guarantee it will generate the capacity for repayment; permanent employment and the idea of a predictable, secure income is, for a growing proportion of the working population, both unavailable and oppressive, and saving in banks sees negative real returns while wage payments into pension funds constrain current living standards in the name of a self-reliant old age.\\\");\\n       units.push(\\\"The starkest challenges to capitalist triumphalism have not come from what we would call the traditional \\\\\\\\u2018left\\\\\\\\u2019: the trades union or the socialist organizations. Predominantly, they have been in defensive mode, trying to hold back change. The emerging challenge is from a different source: people who simply don\\\\\\\\u2019t want to play by the rules of capitalist economics; who want to define themselves outside its discipline and its system or rewards.\\\");\\n       units.push(\\\"Generally, these people aren\\\\\\\\u2019t in trades union or political parties; they may not see themselves as being on the \\\\\\\\u2018left.\\\\\\\\u2019 So how do we profile these people? Perhaps they are open source developers, but their designs can\\\\\\\\u2019t be easily monetized, or won\\\\\\\\u2019t be funded by the internet monopolies. They may well create social benefits, but their innovation doesn\\\\\\\\u2019t comply with corporate business plans. Perhaps they see themselves as a custodian of the commons, but can\\\\\\\\u2019t see a way to expand the organization of that role to the scale required. Or maybe they care passionately about environmental decay and work to build biosustainability. But they know that, for all the official posturing about sustainability and concessions to green industry, the current system will never pursue deep changes that will save the planet, because returns to investors will always shout loudest in any debate. They might work in various forms of human care, for low or even zero income, and generally without much social recognition, but they know their contribution is socially essential and should be rewarded with a reasonable income. Or perhaps they work in art and design, and hear governments pronounce on the importance of cultural creation, but see them deliver minuscule funding to people who are indeed performing critical social roles.\\\");\\n       units.push(\\\"What all these endeavors have in common is that they generate social benefits but aren\\\\\\\\u2019t recognized as profitable in a capitalist sense; indeed as not creating a surplus, to use a more general term. In a Covid-dominated world, with state fiscal austerity and protracted economic downturn awaiting, their financial future is bleak. Will audiences return with spending power; will governments still give grants; will philanthropists feel as generous?\\\");\\n       units.push(\\\"An alternative for these sorts of people could be to participate in an economy that values differently: both in the sense of different modes of calculating economic \\\\\\\\u2018value\\\\\\\\u2019 and with different collective social and ethical values. This would be an economy not driven specifically by profitability, nor reliant on state subsidies or philanthropy, but one which draws on aspirations and affects, to value social, creative and environmental benefits, without reducing all contributions into a price. Artists and designers, along with people performing care roles \\\\\\\\u2013 care for people or for the environment \\\\\\\\u2013 could be rewarded for what they actually contribute to society.\\\");\\n       units.push(\\\"This is the economy that we are aspiring to see built. We are pitching our network design particularly to the generation of people who want to do it differently: who know from personal experience that the conventional economic system is not serving them well individually or collectively, and are looking for ways to participate in building a collective future of their shared design.\\\");\\n       units.push(\\\"Our proposal is that analysis must start at the frontier of current change, and work out how to subvert its momentum. A critical factor in framing this direction is the recognition that social and economic power has shifted dramatically since the 1970s from industrial capital, and the workplace-based unions who battled it, to finance, where there is little organized resistance; at least not the old kind of resistance. Finance is too elusive, too liquid and mobile to be trapped in power battles with organized labor, and the people employed by finance are not generally in a union-based labor force.\\\");\\n       units.push(\\\"Economically and politically, if we want to build postcapitalism, we must start by recognising this power of finance and challenge it by building a different finance. The ultimate goal is an economy of production, animated by alternative social and ethical values, and the starting point is finance.[1]\\\\\\\\n\\\\\\\\n[1] Inspirational Marxist historian Eric Hobsbawm (1978) contended that the 1970s must be read as a crisis for working class organizations; a crisis from which they have not recovered. Our response is that collective endeavors that move beyond the control of capital must be focussed at the frontier of capitalist development - financial innovation - not in nostalgia for a resurgent industrial proletariat.\\\");\\n       units.push(\\\"Finance is both dynamic and fragile. In its current dominant form, it goes to where the profits are greatest, but it instantly retreats when the profits are not appearing. So it is a direct discipline on those who need finance: they must deliver profits, or they suffocate.\\\");\\n       units.push(\\\"But its liquidity and mobility is also its vulnerability, for finance depends critically on the state to provide it with a money instrument and to underwrite its social reputation and its profit. The US-initiated subprime crisis of 2007-2008 and, even more emphatically, the 2020s Covid pandemic have revealed how the fast and free movement of finance can undermine its own conditions of existence. In both periods we have seen nation states (predominantly through their central banks) having to throw money at financial markets to secure liquidity and sustain financial market profits. In 2008, the US Federal Reserve Chairman argued behind closed doors that the state has to do whatever it takes to preserve financial market profits or economic disaster would follow.[2] By 2020, the financial institutions were themselves confidently asserting the demand for the state to guarantee their profitability.[3]\\\\\\\\n\\\\\\\\n[2] \\\\\\\\u2018If we don\\\\\\\\u2019t do this, we may not have an economy on Monday\\\\\\\\u2019 is a statement attributed to Federal Reserve Chairman, Ben Bernanke, in a meeting on Thursday September 18, 2008 with Treasury Secretary Henry Paulson and House Speaker Nancy Pelosi, in his advocacy of a $700 billion bailout plan for banks. https://www.nytimes.com/2008/10/02/business/02crisis.html\\\\\\\\n [3] Financial institutions in the period 2020-2022 might be depicted as financial terrorists, with sticks of illiquidity strapped to their chests, threatening to blow themselves up, and taking the rest of us with them, unless the state guaranteed market liquidity. And states gave those terrorists exactly what they wanted. The terrorist ransom payment is better known as Quantitative Easing, and because of it, the balance sheet of the Federal Reserve (to reference just one index) reached $8.9 trillion by mid 2022, up from $0.9 trillion in 2007, $2.3 trillion in December 2008, and $4.2 trillion in February 2020.\\\");\\n       units.push(\\\"Somehow, we have collectively fallen into the position where these institutions hold the key to our viability. The oppression of the treadmill of working for wages and the intrusion of the logic of finance into daily life now express both the triumph of capitalism and the reason so many people are resisting its consequences.\\\");\\n       units.push(\\\"But if the current era is about the shift from the power of industrial capital to the power of financial capital, then the new, emerging forms of opposition need to be uniting around finance. Some have been tried, but ultimately they succumb to the power of what they oppose. In 2011 _Occupy Wall Street_ was the initial instantiation of this opposition in its contemporary form, but it was conceived as a protest and a spatial obstacle in the movement of financial actors; not an alternative finance. _Occupy_ could be dispersed by the state power of the police. In 2021, social media mobilized a crash of hedge funds short-selling GameStop (GME) shares, and with short-term success, but ultimately at significant cost to participants. Neither was sustainable.\\\");\\n       units.push(\\\"The idea that there could be a different finance, or that certain monetary roles could be performed outside the current financial system and without state backing, had already emerged in 2008, but not initially in a recognizable form. That new possibility came into being with Satoshi Nakomoto\\\\\\\\u2019s _Bitcoin White Paper_ (2008). Its implications have become worrying for states and big financial institutions alike, for it usurps their power to determine the rules of finance and how the economy should operate.\\\");\\n       units.push(\\\"This is where the domain of cryptographically enabled decentralized economic-organizational systems (a.k.a. cryptotokens) opens the possibility of a challenge to capitalist triumphalism in a way that the old industrial-based organizations of the left now cannot and probably never could: it challenges the state\\\\\\\\u2019s and financial institutions\\\\\\\\u2019 monopoly over finance.\\\");\\n       units.push(\\\"This challenge means taking finance outside the state and the current financial institutions. We propose networks of people, with their own financial capacities - units of account, distributed credit issuance and ways of investing, measuring and rewarding \\\\\\\\u2013 building a collective alternative to capitalism in a way that the traditional left no longer can.\\\");\\n       units.push(\\\"That\\\\\\\\u2019s still not how most people are thinking of crypto, although attitudes are changing rapidly. One widespread image, especially from those invested in the current financial status quo, is of cryptotokens as scams and crypto markets as casinos of speculative bets. An alternative image is of a libertarian anti-statism of freely associating individuals, pursuing their own goals in the name of some individualistic conception of \\\\\\\\u2018freedom.\\\\\\\\u2019 Both of these views warrant direct critique, and these will be developed in subsequent chapters. It will be revealed that they may not be \\\\\\\\u2018wrong,\\\\\\\\u2019 for there is evidence of all these characteristics, but the critiques are trivial and dangerous in equal measure. They are trivial because crypto token design keeps evolving and markets in aggregate seem resistant to the effects of scams and volatility (though some individuals certainly lose wealth). Continual predictions of the pending demise of the cryptocurrency markets are consistently wrong. The critiques are dangerous because they are premised on the idea that, with sufficient diatribe, crypto currencies and the technology they represent will simply disappear. So they encourage the perspective of crypto as a cult, and thereby discourage the importance of a wider population inquiring into the potential for new ways of thinking with cryptographically enabled technologies.\\\");\\n        // 58\\n    }\\n    function set(uint256 location, string calldata _unit) external {\\n        units[location] = _unit;\\n    }\\n    function getById(uint256 location) external override returns (string memory unit) {\\n        return units[location];\\n    }\\n\\n}\"\r\n    }\r\n  },\r\n  \"settings\": {\r\n    \"optimizer\": {\r\n      \"enabled\": false,\r\n      \"runs\": 200\r\n    },\r\n    \"outputSelection\": {\r\n      \"*\": {\r\n        \"*\": [\r\n          \"evm.bytecode\",\r\n          \"evm.deployedBytecode\",\r\n          \"devdoc\",\r\n          \"userdoc\",\r\n          \"metadata\",\r\n          \"abi\"\r\n        ]\r\n      }\r\n    },\r\n    \"libraries\": {}\r\n  }\r\n}}", "ABI": "[{\"inputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"constructor\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"location\",\"type\":\"uint256\"}],\"name\":\"getById\",\"outputs\":[{\"internalType\":\"string\",\"name\":\"unit\",\"type\":\"string\"}],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"location\",\"type\":\"uint256\"},{\"internalType\":\"string\",\"name\":\"_unit\",\"type\":\"string\"}],\"name\":\"set\",\"outputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"\",\"type\":\"uint256\"}],\"name\":\"units\",\"outputs\":[{\"internalType\":\"string\",\"name\":\"\",\"type\":\"string\"}],\"stateMutability\":\"view\",\"type\":\"function\"}]", "ContractName": "UnitStorage3", "CompilerVersion": "v0.8.4+commit.c7e474f2", "OptimizationUsed": "0", "Runs": "200", "ConstructorArguments": "", "EVMVersion": "Default", "Library": "", "LicenseType": "", "Proxy": "0", "Implementation": "", "SwarmSource": ""}