// SPDX-License-Identifier: MIT

pragma solidity ^0.8.0;

/// @title: PMart Emotions
/// @author: manifold.xyz

import "./manifold/ERC1155Creator.sol";

///////////////////////////////////////////////////////////////
//                                                           //
//                                                           //
//             .ғɪɴᴅ ʏᴏᴜʀ ᴅᴀʀᴋ ᴀʀᴛ ᴀᴇsᴛʜᴇᴛɪᴄ ʜᴇʀᴇ.           //
//                                                           //
//        ██▓███   ███▄ ▄███▓ ▄▄▄       ██▀███  ▄▄▄█████▓    //
//       ▓██░  ██▒▓██▒▀█▀ ██▒▒████▄    ▓██ ▒ ██▒▓  ██▒ ▓▒    //
//       ▓██░ ██▓▒▓██    ▓██░▒██  ▀█▄  ▓██ ░▄█ ▒▒ ▓██░ ▒░    //
//       ▒██▄█▓▒ ▒▒██    ▒██ ░██▄▄▄▄██ ▒██▀▀█▄  ░ ▓██▓ ░     //
//       ▒██▒ ░  ░▒██▒   ░██▒ ▓█   ▓██▒░██▓ ▒██▒  ▒██▒ ░     //
//       ▒▓▒░ ░  ░░ ▒░   ░  ░ ▒▒   ▓▒█░░ ▒▓ ░▒▓░  ▒ ░░       //
//       ░▒ ░     ░  ░      ░  ▒   ▒▒ ░  ░▒ ░ ▒░    ░        //
//       ░░       ░      ░     ░   ▒     ░░   ░   ░          //
//        ░         ░  ░   ░                                 //
//                                                           //
//                                                           //
//                                                           //
//                                                           //
//    Twitter - @PMart_ist                                   //
//    Instagram - @pmart.ist                                 //
//                                                           //
//                                                           //
///////////////////////////////////////////////////////////////


contract PMart is ERC1155Creator {
    constructor() ERC1155Creator("PMart Emotions", "PMart") {}
}