{"SourceCode": "{{\r\n  \"language\": \"Solidity\",\r\n  \"sources\": {\r\n    \"contracts/storage/IStorage.sol\": {\r\n      \"content\": \"pragma solidity ^0.8.4;\\n// SPDX-License-Identifier: GPL-3.0-or-later\\n\\n// https://soliditytips.com/articles/solidity-interface-interact-with-other-contracts/\\ninterface IStorage {\\n    function getById(uint256 id) external returns (string memory unit);\\n    // Add more function signatures as needed.\\n}\"\r\n    },\r\n    \"contracts/storage/unit/UnitStorage13.sol\": {\r\n      \"content\": \"     \\npragma solidity ^0.8.4;\\n// SPDX-License-Identifier: GPL-3.0-or-later\\nimport \\\"../IStorage.sol\\\";\\n\\ncontract UnitStorage13 is IStorage{\\n    string[] public units;\\n    \\n    // set to onlyOwner()\\n    // check if value exists - \\n    constructor(){\\n        //231\\n       units.push(\\\"The dynamic of agents pursuing their own economic vision, but needing to reconcile that vision with collective valuation, is what drives the network. As visions change, and as collective valuation changes, the system embeds a volatility of social expression. In this context, volatility isn\\\\\\\\u2019t something to fear or eradicate: it is the expression of social development, and opens the space for financial representation of evolving social goals (volatility as a financial spread).\\\");\\n       units.push(\\\"The protocols of the relationship between the individual agent and the system of collective valuation is therefore key to the economic expression of sociability. Posed in simple terms, to be elaborated in later chapters, agents \\\\\\\\u2018invest\\\\\\\\u2019 in their goals, emotionally, politically and financially, by the performances they choose to undertake and by staking the performances of other agents they believe contribute social value. Investing agents not only diversify their stake holdings (sharing risk) but, with a liquid stake market, staking becomes the network\\\\\\\\u2019s mode of voting on values see (Chapter 5.2). The on-going preparedness of agents to _keep_ staking performances with certain value profiles then starts to define the network\\\\\\\\u2019s on-going depiction of value.\\\");\\n       units.push(\\\"The collective \\\\\\\\nThe Economic Space Protocol starts with the network as a construct-in-itself: a set of protocols that must be followed by every individual agent who joins the network. It cannot be simply \\\\\\\\u2018assumed-to-exist,\\\\\\\\u2019 nor does it implicitly take on the social order in which it operates, for social relations are a design choice and agents explicitly must agree to the protocols. But \\\\\\\\u2018the social\\\\\\\\u2019 cannot be expressed simply as the sum of those individual interactions: it exists at a different level of sociality.\\\");\\n       units.push(\\\"This framing is critical to the new economic space, and warrants brief reflection. The analytical foundation of protocol design is generally individual agents who interact. Protocol design involves the building out of these interactions. But if we think of an economy as a whole, it is more than the sum of these interactions: It is not just a distinction of scale, but also of design too.\\\");\\n       units.push(\\\"There are three critical factors here that are central to understanding _the network premium_, i.e. that the whole as more than simply the sum of individual interactions: \\\\\\\\n- _The Commons._ There is a need to identify, preserve and expand performances that make collective contributions that are not readily divisible to individual ownership. Protocol design can generate a systematic expansion of the Commons (see Chapter 6). \\\\\\\\n- _Valuing collective performances._ Some outputs won\\\\\\\\u2019t be sold, even though they may give social benefit. In a system centered on profit, that means they cannot be counted. But with diverse modes of measuring, selling is not the condition of creating new value. \\\\\\\\n- _Network performances_. The new economic space is a network of interactions between subnetworks. Each of these subnetworks, and the aggregate network, can be seen as expressing distinct performances in their own right. That is, they are not merely the aggregation of agent performances inside \\\\\\\\u2018their\\\\\\\\u2019 network: they have distinctive meaning in combination. The overall performance of the new economic space, accordingly, has a meaning that is more than just adding up the individual parts. In particular, the overall performance will reveal the health of the network, partly by reference to data on the mechanics of the protocol and partly as a measure of the success of the network in meeting its (diverse) goals.\\\");\\n       units.push(\\\"GOVERNANCE\\\");\\n       units.push(\\\"The Economic Space Protocol constitutes a process of governance through the design of markets and the rights of all individual agents in relation to those markets and hence to other agents. As we clarify these rights in specific applications to the Economic Space Protocol it will become apparent that they lie behind the logic of token issuance (and clearance): rights to issue, create, share and stake in performances, create and receive credit, or exchange commodities.\\\");\\n       units.push(\\\"But the new economy, indeed any economy, needs means to set a collective social agenda; to determine what is valuable is to set priorities which will drive market incentives. This agenda _could_ be set by decree from a central authority, or it could be set in a distributed way by markets designed so as to elicit support for possible social agendas. This would make governance of the network the role of all participating agents.\\\");\\n       units.push(\\\"Distributed governance is also critical within production processes, or \\\\\\\\u2018performances\\\\\\\\u2019 as we call them (see Chapter 4). Each act of valuation/ realignment is a form of decision-making. Unlike voting, which seeks to define a collective making a decision on what to perform, a performance is itself a decision seeking a collective to affirm it. Moreover, valuing performances follows market dynamics. It does not require creating a higher-powered agent like a board that coalesces preferences into discrete events and chooses a majority over a minority. Instead, distributed governance integrates opinions, preferences, and agendas by mutually empowering participants.[77]\\\\\\\\n\\\\\\\\n[77] The effect is a distributed _economic intellect_, referring to Marx\\\\\\\\u2019s notion of the _general intellect_, which in its turn refers to the final phase of capitalism, where capital itself generates the seed of its destruction when knowledge and social powers of interaction replace direct labor and labor time at the core of the production of wealth. See Virtanen (2006).\\\");\\n       units.push(\\\"In distributed governance, and in the absence of a state as the source of trust in economic processes and institutions, trust must be founded within the network. There are four primary dimensions of this trust: \\\\\\\\n- trust in the integrity of the network. \\\\\\\\n- trust in the measurement device. \\\\\\\\n- trust in the quality and authenticity of what is being measured. \\\\\\\\n- trust in the counterparty (their risk of non-delivery or default).\\\");\\n       units.push(\\\"In the new economic space, trust in the network depends on trust in the protocol plus trust in participants in the network. The recording of transactions on a distributed ledger, where both seller and buyer confirm completion shifts issues of trust towards the protocol level to ensure that computation is correct, distributed state is consistent, and information is secure, to avoid issues like the \\\\\\\\u2018double spend.\\\\\\\\u2019 Knowing an agent\\\\\\\\u2019s transaction histories adds the dimension of a reputation rating for other agents.\\\");\\n       units.push(\\\"Trust in measurement devices and the quality of measurement is the subject of token design, addressed in Chapter 11. The critical issues here are the clear connection of token relations to economic relations, giving tokens a material basis in \\\\\\\\u2018real,\\\\\\\\u2019 and sustainable economic relations of investing (staking), credit and trade.\\\");\\n       units.push(\\\"THE TOOLS TO REFRAME\\\");\\n       units.push(\\\"This chapter has introduced the core categories of the Economic Space Protocol, and has been designed to meet some specific challenges set out at the start of the chapter.\\\");\\n       units.push(\\\"The consideration of markets in the context of new ways of measuring opens the possibility that things currently deemed desirable but unprofitable - for example care, art, research, affect, biosphere enhancement \\\\\\\\u2013 can come to prominence as value-creating activities. They need not be seen as after-thoughts, to be \\\\\\\\u2018subsidized\\\\\\\\u2019 by the state or private philanthropists because they are virtuous-but-unprofitable.\\\");\\n       units.push(\\\"The distributed nature of economic spaces focuses on the capacities of individual agents to pursue their own goals of value creation, to make offers to the network, to issue tokens, to reciprocally stake and, as we will see in later chapters, to issue credit. But the Economic Space Protocol is always drawing these individual agendas back to their social meanings and collective validation. This is framed not as a constraint on individual expression but as the condition for sociability; indeed, the condition for having a sense of the collective social agenda (network health, the commons, etc.) that is beyond the capacity of agents conceived as just an aggregation of individuals, to achieve.\\\");\\n       units.push(\\\"The concepts and categories introduced in this chapter provide us with the tools we need for Economic Space Protocol design. In subsequent chapters these concepts and categories, and the way they combine together, will be explained and scrutinized in greater detail.\\\");\\n       units.push(\\\"PRODUCTION AS PERFORMANCE\\\");\\n       units.push(\\\"BACKGROUND\\\");\\n        //249\\n    }\\n    function set(uint256 location, string calldata _unit) external {\\n        units[location] = _unit;\\n    }\\n    function getById(uint256 location) external override returns (string memory unit) {\\n        return units[location];\\n    }\\n\\n}\"\r\n    }\r\n  },\r\n  \"settings\": {\r\n    \"optimizer\": {\r\n      \"enabled\": false,\r\n      \"runs\": 200\r\n    },\r\n    \"outputSelection\": {\r\n      \"*\": {\r\n        \"*\": [\r\n          \"evm.bytecode\",\r\n          \"evm.deployedBytecode\",\r\n          \"devdoc\",\r\n          \"userdoc\",\r\n          \"metadata\",\r\n          \"abi\"\r\n        ]\r\n      }\r\n    },\r\n    \"libraries\": {}\r\n  }\r\n}}", "ABI": "[{\"inputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"constructor\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"location\",\"type\":\"uint256\"}],\"name\":\"getById\",\"outputs\":[{\"internalType\":\"string\",\"name\":\"unit\",\"type\":\"string\"}],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"location\",\"type\":\"uint256\"},{\"internalType\":\"string\",\"name\":\"_unit\",\"type\":\"string\"}],\"name\":\"set\",\"outputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"\",\"type\":\"uint256\"}],\"name\":\"units\",\"outputs\":[{\"internalType\":\"string\",\"name\":\"\",\"type\":\"string\"}],\"stateMutability\":\"view\",\"type\":\"function\"}]", "ContractName": "UnitStorage13", "CompilerVersion": "v0.8.4+commit.c7e474f2", "OptimizationUsed": "0", "Runs": "200", "ConstructorArguments": "", "EVMVersion": "Default", "Library": "", "LicenseType": "", "Proxy": "0", "Implementation": "", "SwarmSource": ""}