// SPDX-License-Identifier: MIT

pragma solidity ^0.8.0;

/// @title: VibeNauts Trading Cards
/// @author: manifold.xyz

import "./manifold/ERC1155Creator.sol";

//////////////////////////////////////////////////////
//                                                  //
//                                                  //
//                                                  //
//        j▄▓╗                           ╓ΦÅ▓       //
//      ,╓▄▀██▒▒                       ¢╢╢╫▓▓,,     //
//     ▐▄▀╢▌Æ▀å▀                        ╫▒▌▄Ä╢▒▌    //
//      ▀█▄╣Ñ▒▒▒B ,                ,, mÑ¢▒▒▒╫▓▀     //
//     ██▄█▌╣╣╢╣╢╢╢ßRw           ╔╢╢▒▀▒▒▒╢╣╫█▄▓▓    //
//      ███▓▓▓╣╢╣╢╣╣▓╣█         ██╣╣╢╣╣╣╢▓▓▓▓▓▓"    //
//        ▀██▓▓▓▓▓╣▓▓▀    ,,     ▀██▓▓╬▓▓▓▓▓▀       //
//          ▀██▓▓▓▓╣▀╗  ╓╬▒▒A,  ,N▓▒▓▓▓▓██▀         //
//            ▀██▓▓▓▓▒▌█▓▓▓╢▒▌ ▄▌╢▓▓▓▓██▀           //
//              ▀████▓▓▀█▓▓▓╣▀▓╢▓█▓███▀             //
//                ▀████▓▐▌▓▓▓▓▓█████▀               //
//                  ▀████████▓████▀                 //
//                    ██████████▀                   //
//                      ██████▀                     //
//                        ██▀                       //
//                                                  //
//                                                  //
//    VibeNauts Trading Cards                       //
//    ©️2023 VibeNauts ://: DWBROODLE LLC           //
//                                                  //
//                                                  //
//////////////////////////////////////////////////////


contract VNTC is ERC1155Creator {
    constructor() ERC1155Creator("VibeNauts Trading Cards", "VNTC") {}
}