// SPDX-License-Identifier: MIT

pragma solidity ^0.8.0;

/// @title: OBYØR OPEN EDITIONS
/// @author: manifold.xyz

import "./ERC1155Creator.sol";

//////////////////////////////////////////////////
//                                              //
//                                              //
//                                              //
//     ______   ______   __  __   ______        //
//    /\  __ \ /\  == \ /\ \_\ \ /\  == \       //
//    \ \ \/\ \\ \  __< \ \____ \\ \  __<       //
//     \ \_____\\ \_____\\/\_____\\ \_\ \_\     //
//      \/_____/ \/_____/ \/_____/ \/_/ /_/     //
//                                              //
//                                              //
//                                              //
//////////////////////////////////////////////////


contract OOE is ERC1155Creator {
    constructor() ERC1155Creator() {}
}