{"SourceCode": "{{\r\n  \"language\": \"Solidity\",\r\n  \"sources\": {\r\n    \"contracts/storage/IStorage.sol\": {\r\n      \"content\": \"pragma solidity ^0.8.4;\\n// SPDX-License-Identifier: GPL-3.0-or-later\\n\\n// https://soliditytips.com/articles/solidity-interface-interact-with-other-contracts/\\ninterface IStorage {\\n    function getById(uint256 id) external returns (string memory unit);\\n    // Add more function signatures as needed.\\n}\"\r\n    },\r\n    \"contracts/storage/unit/UnitStorage15.sol\": {\r\n      \"content\": \"     \\npragma solidity ^0.8.4;\\n// SPDX-License-Identifier: GPL-3.0-or-later\\nimport \\\"../IStorage.sol\\\";\\n\\ncontract UnitStorage15 is IStorage{\\n    string[] public units;\\n    \\n    // set to onlyOwner()\\n    // check if value exists - \\n    constructor(){\\n        //269\\n       units.push(\\\"Value measures \\\\\\\\nThese identify performances as expressive acts of productive creation, designed to produce value for the network. A performance starts as an agent making an offer to the network. That offer must specify how the performance will be undertaken, the outputs of the performance, and the intended social outcomes of those outputs It is on the basis of this offer \\\\\\\\u2013 the proposed performance and its nominated mode of network recognition \\\\\\\\u2013 that other agents in the network will decide whether, and to what extent, they will stake the performance. The mechanics of this process are developed in Appendix 4.1 and in Chapter 7.\\\");\\n       units.push(\\\"Each performance is therefore valued in the network to reflect two things: \\\\\\\\n- _The worth of the performance._ Is the performance recognized by the network as an expression of its determination of what constitutes value creation?; are there good, clear measures?; will the specified \\\\\\\\u2018indexification\\\\\\\\u2019 provide an effective measure of the performance goal? For example, for a performance related to human care, the network will be determining whether the way care is defined in an offer, how the provision of care is organized and managed, and the way units of care performance are specified (e.g. recipient responses; physical wellbeing of the recipient, etc.) are considered stakeable, and at what stake price? \\\\\\\\n- _The \\\\\\\\u2018pricing\\\\\\\\u2019 of outputs of the performance._ This relates to the four modes identified in Chapter 3.5. This pricing process - ranging from direct sale to tributes to the commons \\\\\\\\u2013 will see the network\\\\\\\\u2019s valuation of the outputs of a performance.\\\");\\n       units.push(\\\"A \\\\\\\\u2018VALUE THEORY OF PERFORMANCE\\\\\\\\u2019\\\");\\n       units.push(\\\"In our analysis we refer many times to \\\\\\\\u2018value,\\\\\\\\u2019 and do so not simply in an ethical sense of what is deemed desirable, but also in a technical economic sense of being a way of measuring. So what do we mean by this latter meaning of \\\\\\\\u2018value\\\\\\\\u2019? Broadly speaking, in economics there are two types of value theories.\\\");\\n       units.push(\\\"One is based on \\\\\\\\u2018objective\\\\\\\\u2019 measures that sit outside of market prices. The most prevalent are labor theories of value of which Marx\\\\\\\\u2019s is the best known.[82] Value in this approach is related to labor time embedded directly or indirectly in a produced commodity. What makes this a social theory is that all different sorts of labor are conceptually convertible to units of abstract labor: that which all acts of labor share in common. When we frame that as a relation to capital and production for profit, all labor stands collectively as the creators of output and capital collectively as the owners of the output.\\\\\\\\n\\\\\\\\n[82] Sraffa (1960) proposes a Marx-compatible approach to value that is not centered on labor time. We admire this work as opening a way of framing value in a postcapitalist economy. In acknowledging Sraffa, we might call our own approach \\\\\\\\u2018production of performances by means of performances.\\\\\\\\u2019\\\");\\n       units.push(\\\"The other type of value theory adopts \\\\\\\\u2018subjective\\\\\\\\u2019 measures that are focussed directly on the individual preferences of sellers and buyers and how they interact in a market, to exchange at a price. Broadly this covers neo-classical and Hayekian approaches. The social dimension here (which might constitute an approach to \\\\\\\\u2018value\\\\\\\\u2019) is the way that all individuals\\\\\\\\u2019 preferences combine to form prices that clear markets, in a process gravitating to equilibrium (neoclassical) or spontaneous order (Hayekian). The socialness is that as each agent changes their decision, it impacts on price, and hence on the decisions of every other agent.\\\");\\n       units.push(\\\"Most adherents of this latter approach, however, would not generally describe themselves as \\\\\\\\u2018value theorists,\\\\\\\\u2019 for they recognize no domain of calculation other than price. Conversely, for those who adhere to \\\\\\\\u2018objective\\\\\\\\u2019 theories of value, price is real, but superficial: value defined in the realm of production is the long-term driver of markets, and prices are a response to short-term factors, but will tend to vary around longer-term (labor) values.\\\");\\n       units.push(\\\"The Economic Space Protocol draws on both, but complies with neither of these theories of value.\\\");\\n       units.push(\\\"Labor-based approaches to value were designed to explain the workings of capitalism, not the conditions for postcapitalism. Indeed, in the domain of social relations of performance defined by staking and innovation, it is social effects, not labor inputs that will be the key to value. For the Economic Space Protocol, value relates to the social recognition (staking) of the performance itself; not social recognition (purchase) of the outputs of performances. The difference is subtle, but significant.\\\");\\n       units.push(\\\"Labor-based approaches struggle to deal with the \\\\\\\\u2018value\\\\\\\\u2019 of outputs where marginal costs are virtually zero. This problem was originally posed in this sort of value theory as the difficulty of putting a value on nature. Nature, being created without labor, could be treated as the exception. But today, intangible outputs like software, networks and knowledge are increasingly prevalent in the economy, but labor time in production seems to explain very little.[83] Our depiction of performances associated with exchange is designed precisely to account for the collective contribution of intangibles in new, creative ways.\\\\\\\\n\\\\\\\\n[83] The proposition is not that labor theories of value cannot explain intangibles like software, for the labor of the software designer could indeed be counted. It is that little about the significance of software in value formation is going to be explained by this attribution.\\\");\\n       units.push(\\\"A subjective preference approach to value, conversely, faces no such challenge from intangibles, but price has to be framed around private patent ownership and contrived scarcity. Software markets reach a clearing price, but only by social exclusion (e.g. by restricting access; hiding the source code). So recognition of intangibles in this approach can only be achieved by a private, not an innately social, approach to value.\\\");\\n       units.push(\\\"A postcapitalist approach to value must encode ways to value the social that are not expressed via quantified labor, nor simply by output price. Indeed, there should be no suggestion that price and value are, or can be made, of the same quantities: a proposition that haunts Marxian value theory (the problem of \\\\\\\\u2018transforming\\\\\\\\u2019 values defined in socially necessary labor time into (smoothed) prices). In our analysis, value comes from the attribution of social recognition, and we will later identify how this recognition might be measured, but these are not proxy prices. The \\\\\\\\u2018conversion\\\\\\\\u2019 from values to prices, if there is indeed such a process, is expressed through staking: how agents change their staking decisions in response to value measures, but it is a tendency only; not a formal connection. This is why we focus on the _performance as the mode of expression_ of value. A performance may be initiated by an exchange in a market but, in contrast with subjective preference approaches, it is the social meaning that can be built around the exchange, not the exchange itself, that is critical to value creation. Moreover, and unlike \\\\\\\\u2018objective\\\\\\\\u2019 approaches to value, the goal is not to explain each commodity\\\\\\\\u2019s value in terms of output metrics, but to identify a network perspective on what outputs are deemed to create value for the network: how a producing population of agents creates, funds and maintains collective benefits for the network.\\\");\\n       units.push(\\\"To achieve this focus, we must look at the social consequences of production and exchange. To say that an output is a social contribution, it is not sufficient to say that it sells for a price, nor that it was produced by labor for the market,[84] but that it is validated by the protocols of the network (see Appendix 4.1 and Chapter 7).\\\\\\\\n\\\\\\\\n[84] We are aware of Marx\\\\\\\\u2019s concept of _socially necessary_ labor time, making acceptance of a commodity in the market a condition of value. The point here is consistent with that condition of value.\\\");\\n       units.push(\\\"For this to be impactful on the growth of the economy, and on incentives for producing agents, there must be trailing commissions, yields or dividends attributable to performers and other owners of stake in the performance. This is why postcapitalism must link to stake: the skin in the game that holds the connection between initial production and collective benefit (or, indeed, cost).\\\");\\n       units.push(\\\"Performance is the mode of expression of value that runs through from an initiating act, triggered by exchange, to broader social consequences. We could, therefore, call this a \\\\\\\\u2018performance theory of value.\\\\\\\\u2019 But, following Elson (1979) on Marx\\\\\\\\u2019s value theory, we prefer to depict it as a \\\\\\\\u2018_value theory of performance_.\\\\\\\\u2019 Our goal is not to use individual performances to explain value, but to use the social conditions of value to give meaning to individual performances.\\\");\\n       units.push(\\\"A PERFORMANCE EVALUATION FRAMEWORK\\\");\\n       units.push(\\\"Chapter 4.4 identified the dual measurements of performance indices and value measurement. While noting in Chapter 4.5 that these are not competing modes of measuring the same thing, how they relate together warrants explanation. That explanation requires other elements, such as staking (Chapter 5) and so will be clarified in Chapter 7 on postcapitalist modes of measurement. In the current context of performances, we can identify public policy initiatives, associated originally with the British (HM) Treasury, that address the measurement of social impacts in a way that directly parallel the processes we are invoking, and which have been critical in framing our analysis.[85]\\\\\\\\n\\\\\\\\n[85] We acknowledge here the contribution of Pamela Hansford who brought this literature to our attention and advised on its application.\\\");\\n       units.push(\\\"SOCIAL IMPACT BONDS\\\");\\n       units.push(\\\"These are sometimes called social benefit bonds or pay-for-success bonds.[86] They were first implemented by the British state in 2010 to fund social policy expenditures on experimental projects. These were initially programs to address prisoner recidivism and then programs for family reunification in the context of children taken into the state\\\\\\\\u2019s welfare system. Around the world, there have since been many other applications.\\\\\\\\n\\\\\\\\n[86] Social impact bonds are said to have been first invented by a New Zealand economist Ronnie Horesh in 1988.\\\");\\n       //287\\n    }\\n    function set(uint256 location, string calldata _unit) external {\\n        units[location] = _unit;\\n    }\\n    function getById(uint256 location) external override returns (string memory unit) {\\n        return units[location];\\n    }\\n\\n}\"\r\n    }\r\n  },\r\n  \"settings\": {\r\n    \"optimizer\": {\r\n      \"enabled\": false,\r\n      \"runs\": 200\r\n    },\r\n    \"outputSelection\": {\r\n      \"*\": {\r\n        \"*\": [\r\n          \"evm.bytecode\",\r\n          \"evm.deployedBytecode\",\r\n          \"devdoc\",\r\n          \"userdoc\",\r\n          \"metadata\",\r\n          \"abi\"\r\n        ]\r\n      }\r\n    },\r\n    \"libraries\": {}\r\n  }\r\n}}", "ABI": "[{\"inputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"constructor\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"location\",\"type\":\"uint256\"}],\"name\":\"getById\",\"outputs\":[{\"internalType\":\"string\",\"name\":\"unit\",\"type\":\"string\"}],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"location\",\"type\":\"uint256\"},{\"internalType\":\"string\",\"name\":\"_unit\",\"type\":\"string\"}],\"name\":\"set\",\"outputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"\",\"type\":\"uint256\"}],\"name\":\"units\",\"outputs\":[{\"internalType\":\"string\",\"name\":\"\",\"type\":\"string\"}],\"stateMutability\":\"view\",\"type\":\"function\"}]", "ContractName": "UnitStorage15", "CompilerVersion": "v0.8.4+commit.c7e474f2", "OptimizationUsed": "0", "Runs": "200", "ConstructorArguments": "", "EVMVersion": "Default", "Library": "", "LicenseType": "", "Proxy": "0", "Implementation": "", "SwarmSource": ""}