// SPDX-License-Identifier: MIT

pragma solidity ^0.8.0;

/// @title: Honchii idle
/// @author: manifold.xyz

import "./manifold/ERC1155Creator.sol";

////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//                                                                                                            //
//                                                                                                            //
//    □□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□ｎｉｃｃｃｉ□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□ｈｃｃｃｃｃｃｃｃｎ□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈ□□□□□□□□□□□□□□□□ｃｃｃｈｈｈｈｉｃｃ□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈ□□□□□□□□□□□□ｃｃｃ□□□□□□ｏｃｉ□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈ□□□□□□□□□ｃｉ□□ｎｎｎｃ□□ｉｃ□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈ□□□□□□□ｃ□□ｃｎｎｎｎｃ□□ｃ□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈ□□□□ｉ□ｎｎｎｎｎｎｎ□□ｃｎ□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈ□□□ｏ□ｎｎｎｎｎｎｎｃ□ｃｎ□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈ□□□ｎｎｎｎｎｎｎｃ□ｃｎ□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈ□□ｎｎｎｎｎｎｎｃ□ｃｈ□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈ□□ｎｎｎｎｎｎｃ□ｃ□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈ□□ｏｎｎｎｎｎ□□ｉ□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈ□□ｎｎｎｎｎ□ｈ□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈ□□ｎｎｎｎ□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈ□□ｃｎｃ□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈ□ｏｎｈ□□□□ｃｃｃｃｃｎ□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈ□□ｎｎｉ□□□□ｎｃｃｃｃｉｈ□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈ□□ｎｎ□□□□□□ｃｃｃｃｃ□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈ□□ｃｎｎｎｎｃｏ□□ｉｃｃｃｉ□□□□□□    //
//    □□□□□□□□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈ□ｏｎｎｎｎｎｎｃ□□ｃｃｃｃ□□□□□□    //
//    □□□□□□□□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈ□□ｃｎｎｎｎｎｎｏ□ｉｃｃｃｎ□□□□□    //
//    □□□□□□□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈ□ｎｎｎｎｎｎｎｎ□□ｃｃｃｉ□□□□□    //
//    □□□□□□□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈ□□ｎｎｎｎｎｎｎ□□ｃｃｃｃ□□□□□    //
//    □□□□□□□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈ□□ｃｎｎｎｎｎｎｈ□ｃｃｃｃ□□□□□    //
//    □□□□□□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈ□□□ｈｈｈｈｈｈｈｈｈｈｈｈｈｈ□□ｃｎｎｎｎｎ□□ｃｃｃｃ□□□□□    //
//    □□□□□□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈ□□□□□□□ｈｈｈｈ□□□□□□ｈｈ□□□ｏｎｎｎｃ□□ｃｃｃｃ□□□□□    //
//    □□□□□□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈ□□ｃｃｃｃｃ□□□ｈ□□ｈｎｎ□□□ｈ□□□□□ｎｏ□□ｉｃｃｃｎ□□□□□    //
//    □□□□□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈ□□ｃｃｃｃｃｃｃｎ□□□ｃｎｎｎｎ□□ｈｈ□ｎｏ□□□□ｎｃｃｃｃ□□□□□□    //
//    □□□□□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈ□□ｃｃｃｃｃｃｃｃ□□□ｎｎｃｃｎｃ□ｈｈ□ｈｃｃｃｃｃｃｃｃｃ□□□□□□□    //
//    □□□□□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈ□□ｃｃｃｃｃｃｃｃｃ□□ｎｃｃｃｃｃ□□ｈ□□ｃｃｃｃｃｃｃｏ□□□□□□□□    //
//    □□□□□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈ□ｃｃｃｃｃｃｃｃｃｃ□ｉｃｃｃｃｃｎ□□ｈ□□□□ｃｃｃｈ□□□□□□□□□□    //
//    □□□□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈ□ｈｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｎｎ□□ｈｈ□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈ□□ｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｎｎ□□ｈｈ□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈ□□ｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｎｃ□ｈｈ□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□ｈ□□ｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈ□□ｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｎｎ□□□□ｈ□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□ｈｈ□□ｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈ□□ｃｃｃｃｃｃｃｃｃｃｃｃｃｎｎ□□□□ｈｈ□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□ｈｈｈｈ□□ｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈ□□ｎｃｃｃｃｃｃｃｃｃｃｃｎｎｏ□□ｈｈｈｈ□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□ｈｈｈｈｈｈｈ□ｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈ□□ｃｃｃｃｃｃｃｃｃｃｎｃ□□□ｈｈｈｈｈ□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈ□ｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈ□ｈｈｈｈｈ□□ｃｃｃｃｃｃｃｃｎｃｏ□□ｈｈｈｈｈｈ□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈｈｈ□ｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈ□□ｈｈｈｈｈｈｈｈｈ□□ｈｈｈｈｈｈｈｈｈ□□ｃｃｃｃ□ｎｎｃ□□□ｈｈｈｈｈｈｈ□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈｈｈ□ｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈ□□□ｈｃ□ｃｈ□□ｈｈｈｈｈｈｈｈｈ□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈ□□ｈ□ｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈ□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈ□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈｈ□□□□ｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈ□□□□ｈｈｈｈｈｈｈｈｈｈｈｈ□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈｈ□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈ□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈｈ□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈｈ□□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈ□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈｈ□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈｈ□□□□□□□□□□□□ｈ□□□ｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈ□□□□ｈｈ□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈｈ□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈｈ□□□□□ｃ□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□ｃ□□□□□ｈｈｈｈｈｈｈｈｈｈｈｈ□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈ□□□□□□ｃｃｃｃｏｈ□□□□□□□□□□□□□□□□□□□□□□□□□□□ｈｏｃｃｃｃ□□□□□□ｈｈｈｈｈｈｈｈｈｈｈ□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈｈ□□□□□ｃｃｃｃｃｃｃｃｃｏ□□□□□□□□□□□□□□□□□□□ｏｃｃｃｃｃｃｃｃｃ□□□□□ｈｈｈｈｈｈｈｈｈｈｈｈ□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈｈ□□□□ｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｉｏｏｏｏｏｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃ□□□□ｈｈｈｈｈｈｈｈｈｈｈｈ□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈｈ□□□□ｃｃｃｃｃｃｃｃｉ□□□□□ｃｃｃｃｃｃｃｃｃｃｃｃｃ□□□□□ｉｃｃｃｃｃｃｃｃ□□□□ｈｈｈｈｈｈｈｈｈｈｈｈ□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈｈ□□□□ｃｃｃｃｃｃｃｃ□□□□□□ｈｃｃｃｃｃｃｃｃｃｃｃ□□□□□□□ｃｃｃｃｃｃｃｃ□□□□ｈｈｈｈｈｈｈｈｈｈｈｈ□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈｈ□□□□ｃｃｃｃｃｃｃｉ□□□□□□□ｉｃｃｃｃｃｃｃｃｃｉ□□□□□□□ｉｃｃｃｃｃｃｃ□□□□ｈｈｈｈｈｈｈｈｈｈｈｈ□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈｈ□□□ｏ□ｉｃｃｃｃｃ□□□□□□□□ｉｃｃｃｃｃｃｃｃｃｉ□□□□□□□ｈｃｃｃｃｃｎ□□□□□ｈｈｈｈｈｈｈｈｈｈｈｈ□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈｈ□□□□□□ｉｃｃｃｃｈ□□□□□□□ｉｃｃｃｃｃｃｃｃｃｉ□□□□□□□ｉｃｃｎｃｉ□□□□□□ｈｈｈｈｈｈｈｈｈｈｈｈ□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈｈ□□□□ｈ□□□□□ｉｉ□□□□□□□ｉｃｃｃｃｃｃｃｃｃｉ□□□□□□□ｃｉ□□□□□ｈ□□□□ｈｈｈｈｈｈｈｈｈｈｈｈ□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈｈ□□□□ｈ□□□ｈ□ｉｃｎ□□□□□ｈｃｃｃｃｃｃｃｃｃｃｃｈ□□□□□ｃｃｎ□ｈ□□□ｈ□□□□ｈｈｈｈｈｈｈｈｈｈｈ□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈ□□□□ｈ□□ｈｈ□ｈｃｃｃ□□□□ｃｃｃｃｃｃｃｃｃｃｃｃｃ□□□□ｉｃｃｈ□ｈｈ□□ｈ□□□□ｈｈｈｈｈｈｈｈｈｈｈ□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈ□□□ｈｈｈｈｈｈ□ｈｃｃｃｉｉｉｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｉｉｉｃｃｃｈ□ｈｈｈｈｈｈ□□□ｈｈｈｈｈｈｈｈｈｈｈ□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈ□□□ｈｈｈｈｈｈ□ｉｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｈ□ｈｈｈｈｈｈ□□□ｈｈｈｈｈｈｈｈｈｈｈ□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈ□□□□ｈｈｈｈ□□ｉｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｉ□□ｈｈｈｈ□□□□ｈｈｈｈｈｈｈｈｈｈｈ□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈｈ□□□□ｈｈ□□□ｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃ□□□ｈｈ□□□□ｈｈｈｈｈｈｈｈｈｈｈ□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈ□□ｉ□□□□□ｃｃｃｃｃｃｃｃｃｃｃｃｎｈｈｈｈｈｃｃｃｃｃｃｃｃｃｃｃｃｉ□□□□□ｉ□□ｈｈｈｈｈｈｈｈｈｈｈ□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈ□□ｃｃｉｉｉｃｃｃｃｃｃｃｃｃｃｃｃ□□□□□□□□□ｃｃｃｃｃｃｃｃｃｃｃｃｉｉｉｃｈ□□ｈｈｈｈｈｈｈｈｈｈｈ□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈｈ□□ｏｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃ□□□□□□□□□□□ｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｈ□□ｈｈｈｈｈｈｈｈｈｈ□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□ｈｈｈｈｈｈｈｈｈ□□ｏｃｃｃｃｃｃｃｃｃｃｃｃｃｃｉ□ｈ□□□□□□□ｈ□ｉｃｃｃｃｃｃｃｃｃｃｃｃｃｃｈ□□ｈｈｈｈｈｈｈｈｈ□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□ｈｈｈｈｈｈｈｈ□ｏｃｃｃｃｃｃｃｃｃｃｃｃｃｃｈ□ｈｈｈｈｈｈｈｈｈ□ｈｃｃｃｃｃｃｃｃｃｃｃｃｃｃｏ□ｈｈｈｈｈｈｈｈ□□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□ｈｈｈｈｈｈｈ□□ｃｃｃｃｃｃｃｃｃｃｃｃｃｃｈ□ｈｈｈｈｈｈｈｈｈ□ｈｃｃｃｃｃｃｃｃｃｃｃｃｃｃ□□ｈｈｈｈｈｈｈ□□□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□□□ｈｈｈｈ□□ｃｃｃｃｃｃｃｃｃｃｃｃｃｃｈ□ｈｈｈｈｈｈｈｈｈ□ｈｃｃｃｃｃｃｃｃｃｃｃｃｃｃ□□ｈｈｈｈ□□□□□□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□□□□□□□□□ｃｃｃｃｃｃｃｃｃｃｃｃｃｃｈ□ｈｈｈｈｈｈｈｈｈ□ｈｃｃｃｃｃｃｃｃｃｃｃｃｃｃ□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□□□□□□□□□□ｉｃｃｃｃｃｃｃｃｃｃｃｃｉ□ｈｈｈｈｈｈｈｈｈ□ｉｃｃｃｃｃｃｃｃｃｃｃｃｉ□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□□ｈ□□□□□□□□ｃｃｃｃｃｃｃｃｃｃｃｃｉ□□ｈｈｈｈｈｈｈ□□ｉｃｃｃｃｃｃｃｃｃｃｃｃ□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□ｃｃｃｃｃｃｃｃｃｃｃｃｃ□□ｈｈｈｈｈ□□ｃｃｃｃｃｃｃｃｃｃｃｃｃ□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□ｉｃｃｃｃｃｃｃｃｃｃｃ□□□ｉ□□□ｉｃｃｃｃｃｃｃｃｃｃｉ□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□ｃｃｃｃｃｃｃｃｃｃｃｉｉｃｉｉｃｃｃｃｃｃｃｃｃｃｃ□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□ｉｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｉ□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□ｏｃｉｉｃｃｃｃｃｃｃｃｃｃｃｉｉｃｏ□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□ｉ□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□ｈｈｈｈｈｈ□□□□□□□□ｈ□□□□□□□□ｈｈｈｈｈｈ□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□□□□□□□□□ｈ□□□□□ｈｈｈｈｈｈｈｈｈ□□□□□ｈ□□□□□ｈｈｈｈｈｈｈｈｈ□□□□□ｈ□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□□□□□□□ｈｈｈ□□□□ｈｈｈｈｈｈｈｈｈｈ□□ｈｈ□□□ｈｈ□□ｈｈｈｈｈｈｈｈｈｈ□□□□ｈｈｈ□□□□□□□□□□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□□□□□ｈｏｏ□□□□□□ｈｈｈｈｈｈｈｈｈｈ□□ｈｈｈ□ｈｈｈ□□ｈｈｈｈｈｈｈｈｈｈ□□□□□□ｏｏｈ□□□□□□□□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□□□□ｏｏｏｏｈ□□□□□ｈｈｈｈｈｈｈｈｈｈ□□ｈｈｈｈｈｈｈ□□ｈｈｈｈｈｈｈｈｈｈ□□□□□ｈｏｏｏｏ□□□□□□□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□□□ｏｏｏｏｏｏｏ□□□□ｈｈｈｈｈｈｈｈｈｈ□□ｈｈｈｈｈｈｈ□□ｈｈｈｈｈｈｈｈｈｈ□□□□ｏｏｏｏｏｏｏ□□□□□□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□□ｏｏｏｏｏｏｏｏ□□□□ｈｈｈ□□□□□□□□□□ｈｈｈｈｈ□□□□□□□□□□ｈｈｈ□□□□ｏｏｏｏｏｏｏｏ□□□□□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□ｏｏｏｏｏｏｏｏｏｈ□□□ｈ□□□□□□□□□□□□□□□□□□□□□□□□□□□□□ｈ□□□ｈｏｏｏｏｏｏｏｏｏ□□□□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□ｏｏｏｏｏｏｏｏｏｏｏｈ□□□□□□ｈｈｈｈｈ□□□□□□□□□□□□□ｈｈｈｈｈ□□□□□□ｈｏｏｏｏｏｏｏｏｏｏｏ□□□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□ｈｏｏｏｏｏｏｏｏｏｏｏｈ□□□ｈｈｈｈ□□□□□□□□□□□□□□□□□□□□□ｈｈｈｈ□□□ｈｏｏｏｏｏｏｏｏｏｏｏｈ□□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□ｏｏｏｏｏｏｏｏｏｏｏｏｏｈ□□□ｈ□□□□□ｏｏｏｏ□□□ｈ□□□ｏｏｏｏ□□□□□ｈ□□□ｈｏｏｏｏｏｏｏｏｏｏｏｏｏ□□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□ｏｏｏｏｏｏｏｏｏｏｏｏｏｏｏｈ□□□□□ｏｃｃｃｃｃｃｎ□□□□□ｏｃｃｃｃｃｃｏ□□□□□ｈｏｏｏｏｏｏｏｏｏｏｏｏｏｏｏ□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□ｏｏｏｏｏｏｏｏｏｏｏｏｏｏｏｈ□□ｏｃｃｃｃｃｃｃｃｃｃｎ□□□ｃｃｃｃｃｃｃｃｃｃｎ□□□ｈｏｏｏｏｏｏｏｏｏｏｏｏｏｏｏ□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□ｈｏｏｏｏｏｏｏｏｏｏｏｏｏｏｈｈ□□ｃｃｃｃｃｃｃｃｃｃｃｃｃ□ｃｃｃｃｃｃｃｃｃｃｃｃｃ□□ｈｏｏｏｏｏｏｏｏｏｏｏｏｏｏｏ□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□ｈｏｏｏｏｏｏｏｏｏｏｏｏｏｏｈｈｏｈｃｃｃｃｃｃｃｃｃｃｃｃｎ□ｎｃｃｃｃｃｃｃｃｃｃｃｃ□ｈｈｏｏｏｏｏｏｏｏｏｏｏｏｏｏｏ□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□ｏｏｏｏｏｏｏｏｏｏｏｏｏｏｈｈ□ｃｃｃｃｃｃｃｃｃｃｃｃｃｉｈｃｃｃｃｃｃｃｃｃｃｃｃｃｃ□ｈｈｏｏｏｏｏｏｏｏｏｏｏｏｏｏ□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□ｏｏｏｏｏｏｏｏｏｏｏｏｏｈｈｈ□ｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃ□ｈｈｏｈｏｏｏｏｏｏｏｏｏｏｏｏ□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□ｏｏｏｏｏｏｏｏｈｈｈｈ□□□□□ｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃ□□□□□ｈｈｈｈｏｏｏｏｏｏｏｏ□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□ｏｏｏｏｏｏｏｈｈｈ□□□□□□□ｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃ□□□□□□□ｈｈｏｈｏｏｏｏｏｏ□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□ｏｏｏｏｏｏｈ□□□□ｏｃｉｎ□ｎｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｎ□ｉｉｃｏ□□□□ｈｏｏｏｏｏｏ□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□ｈｏｏｏｈｈ□□□ｉｃｃｃｃｉ□ｎｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｎ□ｉｃｃｃｃｉ□□□ｈｈｏｏｈｈ□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□ｈｈｈｈ□□□ｃｃｃｃｃｃｃｉ□ｎｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｎ□ｉｃｃｃｃｃｃｃ□□□ｈｈｈｈ□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□ｈ□□□ｈ□ｃｃｃｃｃｃｃｉ□ｎｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｎ□ｉｃｃｃｃｃｃｃ□ｈ□□□ｈ□□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□□ｈｈ□□ｃｃｃｃｃｃｏ□ｎｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｎ□ｉｃｃｃｃｃｃ□□ｈｈ□□□□□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□□□□□□ｉｃｃｃｃｃｈ□ｃｎｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｎ□ｉｃｃｃｃｃｉ□□□□□□□□□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□ｏ□□□□ｏｃｃｃｃｃｃ□ｎｎｎｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｎ□ｉｃｃｃｃｃｈ□□□□□□□□□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□□□□□□ｈｃｃｃｃｃｉ□ｎｎｎｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｎｎ□ｉｃｃｃｃｃ□□□□□□□□□□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□□□□□□□ｃｃｃｃｃｉｈ□ｎｎｎｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｎ□□ｃｃｃｃｃｃ□□□□□□□□□□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□□□□□□□ｉｃｃｃｃｃｏ□ｃｎｎｎｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｎｃ□ｈｃｃｃｃｃｃ□□□□□□□□□□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□□□□□□□□ｉｃｃｃｃｃｈｈｃｎｎｎｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃ□□ｃｃｃｃｃｉ□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□□□□□□□□□ｈｃｃｃｃｃ□ｃｈｎｎｎｎｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｈｎ□ｃｃｃｃｃｈ□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□□□□□□□□□□□ｉｃｃｃｎ□ｎ□ｎｎｎｎｎｃｃｃｃｃｃｃｃｃｃｃｃｃｃｎｎ□ｎ□ｃｃｃｃｉ□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□ｃｃｃｃｎ□ｈｎｃｎｎｎｎｎｃｃｃｃｃｃｃｃｃｃｃｎｃｎ□□ｃｃｃｃｎ□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□□□□□□□□□□ｈ□□ｃｃｃｃｎ□□ｎｎｃｎｎｎｎｎｎｎｎｎｎｎｎｎｃｈｎ□□ｎｃｃｃｃ□□ｈ□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□□□□□□□□□□ｈｈ□□ｃｃｃｃｃ□□□ｎｎｃｎｎｎｎｎｎｎｎｎｃｏｎ□□□ｃｃｃｃｃ□□ｈｈ□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□□□□□□□□□□ｈｈｈ□□□ｉｃｃｉｈ□□ｈｎｈｈｏｎｎｎｏｈｈｎｈ□□ｈｉｃｃｃ□□ｈｈｈｈ□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□□□□□□□□□ｈｈｈｈｈｈ□□□ｃｃｃｃ□□□□□□□ｃ□□□□□□□ｃｃｃｃ□□□ｈｈｈｈｈｈ□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□□□□□□□□□□□ｈｈｈｈｈ□□□ｏｉｃｃｉｏ□□□□ｈ□□□□ｏｉｃｃｉｏ□□□ｈｈｈｈｈ□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□□□□□□□□ｃ□□□ｈｈｈｈｈｈ□□□□ｃｉｈｉ□ｈｈｈｈｈ□ｉ□ｉｃ□□□□ｈｈｈｈｈｈ□□□ｃ□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□□□□□□□ｏｎｎｎｏｏｏ□ｈｈｈｈｈ□□□□ｎｏ□□ｈｈｈ□□ｏｏ□□□□ｈｈｈｈｈ□ｏｏｏｎｎｎｈ□□□□□□□□□□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□□□□□□ｃｎｎｎｎｎｎｎｃ□□□ｈｈｈｈ□□□□□□ｈｈｈ□□□□□□ｈｈｈｈ□□□ｃｎｎｎｎｎｎｎｃ□□□□□□□□□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□□□□ｎｎｎｃｃｃｃｃｎｎｎｎｏｈ□□□ｈｈｈ□□□ｈｈｈｈｈ□□□ｈｈｈ□□□ｈｏｎｎｎｎｃｃｃｃｃｎｎｎ□□□□□□□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□□□ｉｃｃｃｃｃｃｃｃｃｃｃｃｃｎｎｎｃ□□□□□□□□□□□□□□□□□□□ｃｎｎｎｃｃｃｃｃｃｃｃｃｃｃｃｃｈ□□□□□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□□□ｎｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｎｎｎｃｃｃｎｎｎｎ□ｈｎｎｎｃｃｃｎｎｎｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｎ□□□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□□ｈｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｎｎｎｎｎｎｎｎｎｎｎｎｎｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｈ□□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□ｈｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｎｎｎｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｈ□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□□ｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｉｉｉｃｃｃｃｃｃｃｃｃｃｃｃｃｃｉｉｉｉｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃ□□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□ｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃ□□□□□□□ｈｃｃｃｃｃｈ□□□□□□□ｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃ□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□□ｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃ□□ｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈ□□ｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃ□□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□ｈｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｏ□□ｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈ□□ｎｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｈ□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□□ｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃ□□□□□□□ｈｈｈｈｈｈｈｈｈｈｈ□□□□□□□ｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃ□□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□ｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃ□□ｈｈ□□□□□□□□□□□□□□□□□□□ｈｈ□ｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｎ□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□□ｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｉ□□ｈｈｈｈｈｈ□□□□□□□□□□□ｈｈｈｈｈｈ□□ｉｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃ□□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□ｈｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｏ□ｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈ□ｏｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｈ□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□□ｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｉ□□ｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈ□□ｉｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃ□□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□ｎｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃ□□ｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈ□□□ｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｎ□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□ｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃ□□ｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈ□□ｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｉ□□□□□□□□□□□□□□    //
//    □□□□□□□□□□□ｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃ□□ｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈ□□ｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃ□□□□□□□□□□□□□□    //
//    □□□□□□□□□□ｉｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｈ□□ｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈ□□ｈｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃ□□□□□□□□□□□□□    //
//    □□□□□□□□□□ｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｉｈ□□ｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈ□□ｈｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃ□□□□□□□□□□□□□    //
//    □□□□□□□□□ｏｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃｃ□□□□ｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈｈ                                                     //
//                                                                                                            //
//                                                                                                            //
//                                                                                                            //
////////////////////////////////////////////////////////////////////////////////////////////////////////////////


contract Hi is ERC1155Creator {
    constructor() ERC1155Creator("Honchii idle", "Hi") {}
}