// SPDX-License-Identifier: MIT

pragma solidity ^0.8.0;

/// @title: American AG
/// @author: manifold.xyz

import "./manifold/ERC721Creator.sol";

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//                                                                                                                                                                     //
//                                                                                                                                                                     //
//    /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////    //
//    //                                                                                                                                                         //    //
//    //                                                                                                                                                         //    //
//    //                                                                                                                                                         //    //
//    //        ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄                         //    //
//    //        ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄                         //    //
//    //        ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄;χψβΡΨΪήβξφμ;;΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄                         //    //
//    //        ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄Αφϊ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄·ΘΌχΪΆΪΆΪϋΆΆϊΪΪφΪΆΪΪΫβρι΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄·βρ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄                         //    //
//    //        ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄ώφβ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄μΆϋΆΫΫΪήΨΎΪΆΪϊ΅ΪϋΪΆΫΆψΪΪΪβββμ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄Τβξ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄                         //    //
//    //        ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄ώχβΐ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄ψΪγΪϊγϊΎΈΎΎΎ΄ΪΪϊΎνΪΪΪΎηΡΪφβΪξξβξι΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΅βββ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄                         //    //
//    //        ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄·ψββ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄ββΪΌΪΊΆΎν΄Ύ΄ΎΎΎΎΎ΅ήΆΈΎΊΪϋχΓΪβξξβββξ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄ΤββΪ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄                         //    //
//    //        ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄δθβΐ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄βΪώΪΐχΎΆΆν·΄Ύ·΄ΎΎΎ΄ΎΎϊ·ΈϋγΧγφΪββξξβββ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄Ίβββ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄                         //    //
//    //        ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄Θφβ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄;ΪξξΪχΆηΆΎ·΄΄΄΄΄΄΄΄΄΄΄·΄΄΄ΎΆΆΪχΪΪξΪβββλ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄·βββϊ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄                         //    //
//    //        ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄ήββ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄βΪΆΪΪΪγΆ΄Ύ΄΄΄΄΄΄΄΄΄΄΄΄ιΎ·΄;ΑχχξχΪχχξβββι΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄·βββΐ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄                         //    //
//    //        ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄ΪΪΤϊ΄΄΄΄΄΄΄΄΄΄΄΄΄φΪΪχχΪΎΎ΄΄΄΄΄΄΄΄΄΄΄·΄΄Ύ·ΎςΎΪΆήΪήΪχΆξΪββββ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄·βΪΰΪ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄                         //    //
//    //        ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄ΌΪήϊ΄΄΄΄΄΄΄΄΄΄΄΄΄χΐΆϋϊΎΎ΄·΄΄΄΄·΄΄΄΄·΄΄΄΄ΊΑ·ϊγΆΪΪΪχΨχχΐΪΤββί΄΄΄΄΄΄΄΄΄΄΄΄΄΄ΊΪΪΰί΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄                         //    //
//    //        ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄ΑΎβλ΄΄΄΄΄΄΄΄΄΄΄΄·χΪΪχχς΄·΄΄΄΄΄΄·΄΄ΎΎΎ΄ΎΎ΄΄ΎΎΆ΅ΆΟΌΆΪϋβΪΤββββ΄΄΄΄΄΄΄΄΄΄΄΄΄΄;ξΟΆϊ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄                         //    //
//    //        ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄;;ή;ΫΪι΄΄΄΄΄΄΄΄΄΄΄·ΌΪΪΪγ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄·ΎΎ΄ΎΎΎΆΪηχΟΕΪΪββββββ΄΄΄΄΄΄΄΄΄΄΄΄΄;ΡΪΗψΪωι΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄                         //    //
//    //        ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄·μχΚΕήΐχφβω΄΄΄΄΄΄΄΄΄;βΪβΪνϊψψθήχξψχ΄ΎΎτΆγ·;ςςηχχψχββΪΐΪξΪββββββ΄΄΄΄΄΄΄΄΄΄·ωβΐχΪχώψχχχ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄                         //    //
//    //        ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄ΤφξβφββΪξβΪξξω΄΄΄΄·ΫΪΚΪΊΐΑγγγςΫΆΪΪξξχΪχΆΪΆΪχφβξΘξΪΪχΪΡΪΪβΪξββββρ΄΄΄΄;ωήχΌήφΪχχχμβββΪ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄                         //    //
//    //        ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄ΉΫΫΤΒββξμβμΆψχωωββΚΪΪκΈΆνφξΌφξξΘήδΪμωΆΆΫφΪξΚφφβββξβΚξβΘχΰβββββμ;ϋχχΌχψχβββΚΫΫΉΉ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄                         //    //
//    //        ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄ΎΫΫΤφββξχφΪχΫχβ΄·ΎΆΪΡΨξΒΪΪΚΚΪΫΎ΄ΎΎΰΐΪΪΪΆΨΪΪΪΪΪΖΪξΚχβββΪΪθχχφχχββΪΫΎ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄                         //    //
//    //        ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄ΎΫθβΪβμχΪχ΄΄΄΅΄ΆγϋΆχωΌϊΆ΄΄΄·;ηΪ΅ΎΪχψΪΪΪχώΪωΘήφβΪΪΎ;χχψβΪΎ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄                         //    //
//    //        ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄ΫξβμϊχΪγ·Ύ·ΎςΫγΆγΆΎ΄΄΄··νΪχχΐγΫγχΪΆΪΪΪΪΚΪβΪ΄ΆχβφΪ΅΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄                         //    //
//    //        ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄ΎΪΪϊΈΪχχ΄ΎωΊΆΎ΅ι΄΄΄΄Ύ΄΄΄΄΄΄·ΊήχήΪΌΨξΪΒΪΪΎΊχχΡΎ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄                         //    //
//    //        ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄ήΪΪΫΆΆχΐ·ϊ΄;Ά΄Ύ΄·ΎΎ΄΄·΄ΎΎγΫΪΰΪΪΪΪΰΪΪϊΎΑΪψΐ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄                         //    //
//    //        ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄ΎΚΐΫΪΪΪ΄·Λ΄΄΄΄΄΄΄΄΄΄΄΄΄΄·ΎΎΫήΪϊΒΪΪΪηΥβΪ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄                         //    //
//    //        ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄ΘςήχΪξι΄ΎΎ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΅ΆΨΪχΆΪΪ;;ΆΡ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄                         //    //
//    //        ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄ΪφΪχΆΪμϊ΄΄΄΄΄΄΄΄·΄΄΄΄΄΄΄Ύγ;ΐΪώχφΪΪ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄                         //    //
//    //        ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄ΪχΪ΅ςΫθχχ;΄΄΄΄΄΄΄΄΄΄·;ΎγΊΪχΌΪφΪΐ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄                         //    //
//    //        ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄·ϊχΪωΚμΪΪχΪχ΄·΄Ύ΄···΄ΊΎ·΄·ϋΪΚχβξϊ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄                         //    //
//    //        ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄·;ΟγΪχΎΪχβρΪΪϊγωχ΄΄·χω΄ςςχ;΄·χχΪΕΒΪχΚ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄                         //    //
//    //        ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄··χχΪχβξξΪΪΫΪΪΪηωγΆ΄·Ϊ΄·ϊΆχγγΌΪφβΡωχββρωι΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄                         //    //
//    //        ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄·ΎΆξήβΐΡΪΆΆΈΪΪ΄ΎΎΎ΄΄·Ύ·΄ΊΪΆΪΪχΆΪΆβΨβξβΪγβ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄                         //    //
//    //        ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄·ΊΆΆΡΪΪ΄΄ΎΎΑΪΎ΄ΎΎ·Ύ΄ΎΊ΅ΈχγΆΪΎϊΎΪΆΎΨΊΫΪΪΪΪ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄                         //    //
//    //        ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄;΅Ϊχ·;χι΄΄΄ΎΎ΄Ύ΄ΎΎΎΎ΄ΆςΎΎΎΎΎ΄ΎΎΎ΄·ΊψβξΪΆβ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄                         //    //
//    //        ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄ΑγΆΪΓΫφΘΙ΄Ύτ΄΄΄΄΄Ύ΄΄ΎΆΎΎΎΎ΄΄·χΎ·΄ηφββΪΚβΪ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄                         //    //
//    //        ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄τΎΊΫψχήφβΐ···΄΄΄΄΄΄΄Ί΄΄Ύ΄΄΄΄Λ΄·΄;φββΪΚΪΫΐ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄                         //    //
//    //        ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄νιγψΆνΆΫξχΐ΄·΄΄΄΄΄΄΄·΄΄΄΄Ύ΄·Ύ΄·ςφβΪΘήβΪΆί΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄                         //    //
//    //        ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄ςΆχχΪ΄ΎϋΪΪΪΧχ·΄΄΄΄΄΄·΄΄·΄·ϋγςχχβββΪϋφΪΆχβξρ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄                         //    //
//    //        ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄·;Ύ΄΄ΊγΆηήνήΆββχΚχμώ΄΄;΄·΄;ι·γγψχξΫμβΪΊψβΪΪχΪΪΚθξρ;΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄                         //    //
//    //        ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄;γΆΎ΅΄··΄΄η·ΫΆΪΎΫΆββΪήΪΪιφχι;΄Ύ;χ·φβχΪββΪγχήφΪφβχΪΪχξχΪχΪξωι΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄                         //    //
//    //        ΄΄΄΄΄΄΄΄΄΄΄΄΄΄···Ύ΄΄΄΄΄ΎΎΎ΄ΎΎγ΄΄Ύ΄Ύ΄Ύ··΄·΄;΅΄ΎΎγΎΊΪΪΆΪΆήΆΤΪΪχχφΪΪβΪΪΪΤβΪ΄ΆΪΤΪχΪχβΪΪΪββχΪΪϋχΪΪΪΪβΆψξψχ;΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄                         //    //
//    //        ΄΄΄΄΄΄΄΄΄΄΄··ΎϊΎΎΎ΄·ΎΎΎ΄΄ΎΎΎΎΎΎΎΎ΄Ύ΄Ύ΄Ύ΄΄΄Ύγ΄΄νΎΈΎΈΪΪΪγΎ·ι·ιΪφΪΪΪΎΫΪΪΪΪΎΎΆΪΪφΪβΪΤΪΪΪΪΪΪΪΪΐΪΪΆΪΪΪΨΘΪΪΎΪΪΪΪξμι΄΄΄΄΄΄΄΄΄΄΄΄                         //    //
//    //        ΄΄΄΄΄΄΄΄΄΄·ΎΈ΄΄ι΄ΎΎΎ΄΄·΄΄Ύ΄ΎΎ·΄ΎΎ΄΄΄΄΄΄Ύ·ΎΎΆ΄ςΎγςγΆΪΆχ΄΄΅γς΄φβΐΪψΐΪΓΕΪΎΎ;ϋΪΪΪψΪΪΪΪΚΪΚΪήβΪξθΪΌΪΨβΪϋψΆΪΪΨΪΪΪΪΚΪξ΄΄΄΄΄΄΄΄΄΄                         //    //
//    //        ΄΄΄΄΄΄΄΄΄ΑΆΎϊ΄ω΄ω΄Ύγ΄·΄΄ΎΎ·Ύ΄΄Ύ΄΄΄΄΄΄΄΄΄΄΄΄·χΐγΊΎνΎΆΪΪϊ΄΄Ύ·γΚβΐΓΫΪϋΪΪΎ΄γΰήβΘφΪξΖΪβΪξβΪΒΪξΫξχθΪΪϋΆΫχχΪΌΆΫθΫΘΪήβΪι΄΄΄΄΄΄΄΄                         //    //
//    //        ΄΄΄΄΄΄΄΄;ΟγΆηϋΎςΎγΎ΄΄··΄·΄Ύ΄΄ΎΎ΄΄΄·΄΄΄΄΄·Ύ΄·ΆωςΫΆΎγγΌΆϊ΄΄΄ΑΨφΪϊΗγιδφΪΎ;ΆήφξβΪφβΘφΪββχβΪΌφχχΘχχΚΪΘψΆθχΪψΘχκΪχΘξββ΄΄΄΄΄΄΄΄                         //    //
//    //        ΄΄΄΄΄΄΄·ωχϋΆμΆγνιςν·Ύς·΄΄΄΄·΄·΄΄΄΄΄··΄΄΄΄΄·΄·Ϋωωγ;κ΄Έςχ·΄΄ήωββμΪ;ΪχΘΎ·ηψψΘβββΪββθβββχξήβΪβθχΘψχήθΪΌχΰςΐΪΪμμΪΪΪξΒξ΄΄΄΄΄΄΄                         //    //
//    //        ΄΄΄΄΄΄΄ώχΆγΐΎΈωγϊ·;γγ΄΄γ·΄΄·΄΄·΄··΄΄Ύ΄·΄΄΄΄Ύ΄;Ϊνψϊ΄γγγχι··φψββήΪΆχΚΪ΄΄γήχφβξββββββββΪΪφΪβΘφξχΘχχΪχχΪχήχχβΪφχψχφββ΄΄΄΄΄΄΄                         //    //
//    //        ΄΄΄΄΄΄·Άχ;ϊςχΪΎΆΎ;γςΑιγϊ΄··΄ϊ΄΄΄΄΄΄΄΄΄΄ΎΎ΄΄΄΄γχωϊΎϊΎΎΪΆΚ;μβώββΐϊχΐβΪιχΪΚξββββββξβββββΐΪΰμφΪΌΚχΚΐΪΪχΪχΪΪΪχΪΪξχβΪββί΄΄΄΄΄΄                         //    //
//    //        ΄΄΄΄΄΄φχΆΪχχΆγΪΎΆΎΎγγχ·γήγγ΄΄·΄·΄·΄΄΄΄·΄΄΄·΄ι΄Ύϊ;γγΌΪΌΚΪφΪΪψξΪϊΈβχΪϊ;χήφΪΚββββββββξΪβφΪΪΪΪΖΪΪΪΪχβΪήΪΪΪΪΕΪχΪχψΪϋββΪ΄΄΄΄΄΄                         //    //
//    //        ΄΄΄΄΄΄ΪχΌγΪΆΪΆΈΆΆϋώΎΆγΪγχϊγΊ΄΄Α΄Ύ΄·΄΄Ύ΄Ύ΄΄Ύ΄΄;Ύ;γΎΪΆΆΪχΘΰββββξφβΤΪΪΆγφήβξΪβββββββββΪβΪΪΪΪΨχχΚΪΪχχΒχχΪΪήΪΪΪΪΌΪφΪχΒΪ΄΄΄΄΄΄                         //    //
//    //        ΄΄΄΄΄·ΪΪΆΪγΪΆΆΪΆΆΆΎςΫϋΆΪΪΪΪΆΆΎ΅·Ύ΄΄΄·Ύ·΄΄΄΄··΅΄ΎΎΎ·΅ΪήΪΪβΪΪβΪβΪΪΪΪΪϋήΪΪΪΪΪΪΪβββββββΪΪΪχθΆΪΪφΪξθΘΪξβΪΪβΪΪβΪΨθΨΪϋΪΆβ΄΄΄΄΄΄                         //    //
//    //        ΄΄΄΄΄;ΪΆΪΆΪΆΆΪΪΌΆνΆγΌΆχΆΫβΪΆΪ΅γΎΎ·Ύ΄Ύ΄΄΄΄Ύ΄΄΄γΎ··΄ςγχΪξββββββββββΪΪήΘΪΫΆΫΪΆΪΪΤβββΪΪΪΌΪΪχΌΪΐΪΕΪξφΖΒΪΪΪΪΚΪΪβΘχθΫΘΪΤΒι΄΄΄΄΄                         //    //
//    //        ΄΄΄΄΄ΌχθΪΆΫΪΪΫωΪχκήχΆχΪψώΫχθΨΆ΅΄γ··Ύ·΄΄ΎΎ·Λ΄Ύ··γΆΌΪΌΪξβββββββββξβξβΐψχΆήχωχϊΆΪΤββξβΤΫψφΐΌΌΫχΘΪβξββΪώΪχΘώΆΪμΪχθΪβββϊ΄΄΄΄΄                         //    //
//    //        ΄΄΄΄΄ΌΪΪχΪ;ΘΆΪωψΪχωΆωήψΆχϋβχμϊγΎ·;·γΎ·΄·Ύ΄΄ΎγςψχγΌώΰφβξββββββξββββΪΪχξςΫχωθΆΆψώΪβΪΪΰχχξχΪχφΪχβββββΪψχΚχώξΘΪχΪψφΪχβΐ΄΄΄΄΄                         //    //
//    //        ΄΄΄΄΄ΌΪχΪήΆγψμωώχΆγχΫψβχΆΨβΪϊωϋςιϊ·΄·΄γΛ·ς·γςΆΆΆωΆψββββββββββββββββχΪχΪχΪήΆγςΫψήΪΪΪχϋΪΪξχψΘψβββββΪΪχΪΪΖΘβΘβΪχβχΚΤβΐ΄΄΄΄΄                         //    //
//    //        ΄΄΄΄΄;φΪήΪςΆΆήχχΪχΆΪχΆΪχΪχΪΪϋϊ΄ϊ΄;ι·γ΄·΄΄γςΈΆ;ΌχΆμψβββββββββββββββββββχΆψΆνψΪνχΪχΆχχΪχϋΆΆβκΐχΚβββΐβχχΪχχΪχΪφβχββββΐ΄΄΄΄΄                         //    //
//    //        ΄΄΄΄΄΅ΨΨΨΨΨΨΎΨΨΨΎΨΨΎΨΨΨΨΨΨΨΎΎΎΎΎΎΎΎΎΎ·ΎΎΎΎΎΎΎΎΎΨΨΨΨΨΨΨΨΨΨΨΨΨΨΨΨΨΨΫΨΫΨΨΨΨΨΎΎΎΎΎΨΎΨΎΨΨΨΨΨΨΨΨΨΨΨΨΨΨΨΨΨΨΨΨΨΨΨΨΨΨΨΨΨΨΫΨΪ΄΄΄΄΄                         //    //
//    //        ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄·΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄                         //    //
//    //        ΄΄΄΄΄΄΄··ΎΎ΄·΄ΎΎ΄΄ΎΎ···ΎΎ΄΄΄΄΄΄΄ΎΎ···ΎΎΎΎΎΎ΄΄ΎΎΎΎΎΎΎΎ΄΄΄΄΄΄΄΄ΎΎ··ΎΎΎ΄΄ΎΎΎΎΎΎΎ··ΎΎΎΎΎΎΎΎ΄΄ΎΎΎΎΎΎΎ΄΄΄΄΄΄΄·κώλ΄;·΄Ύ΄΄΄΄΄΄΄΄                         //    //
//    //        ΄΄΄΄΄΄΄Ύ΄·΄΄·΄΄΄΄΄΄΄΄Ύ΄·΄΄·΄΄΄΄΄΄΄΄΅΄·΄΄΄΄΄΄΄΄΄΄΄΄΄΄·΄΄΄΄΄΄΄΄Ύ΄΄···΄΄΄΄΄΄΄΄Ύ΄΄·΄·΄΄΄΄΄΄΄΄Ύ΄΄·΄΄΄΄΄΄΄΄΄΄΄ΫΎΈΒΐ΄΄΄΄΄΄΄΄΄΄΄                         //    //
//    //        ΄΄΄΄΄··΄Ύ΄΅΄΄Ύ΄΄΄΄΄΄΄΄Ύ΄΅΄΄Ύ΄΄΄΄΄΄΄΄΄΄΅΄΄Ύ·΄΄·΄΄΄΄΅΄΄Ύ΄΄΄΄΄΄΄΄΄΄΄΄··΄΄΄΄΄΄΄··΄΄΅΄Ύ΄΄΄··΄΄΄΄·····΄΄΄΄΄΄΄΄΄ΎΎ΅Ϊι΄΄΄΄΄΄΄΄΄΄  2023 juliethaas.eth    //    //
//    //        ΄΄΄΄΄΄·΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄·΄·΄΄΄΄΄΄΄΄΄΄΄·΄΄·΄΄΄΄΄΄΄΄΄΄΄·΄·΄΄΄΄΄΄Ύ΄΄΄΄·΄·΄΄΄΄΄΄΄΄΄΄΄·΄΄΄΄Ύ΄΄΄΄΄΄΄΄΄΄΄Ίχ;΄΄΄΄΄΄΄΄΄΄                         //    //
//    //                                       ____                                                                                                              //    //
//    //                 ||         ||       ||      `````|````` |         |      .'.            .'.                  ..''''                                     //    //
//    //                 ||         ||       ||______     |      |_________|    .''```.        .''```.             .''                                           //    //
//    //        .        ||         ||       ||           |      |         |  .'       `.    .'       `.        ..'                                              //    //
//    //        `..____..'`._______.'|_______||___________|      |         |.'           `..'           `.....''                                                 //    //
//    //                                                                                                                                                         //    //
//    //                                                                                                                                                         //    //
//    //                                                                                                                                                         //    //
//    /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////    //
//                                                                                                                                                                     //
//                                                                                                                                                                     //
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


contract AMERAG is ERC721Creator {
    constructor() ERC721Creator("American AG", "AMERAG") {}
}