// SPDX-License-Identifier: MIT

pragma solidity ^0.8.0;

/// @title: Divergence Experiments
/// @author: manifold.xyz

import "./ERC1155Creator.sol";

/////////////////////////////////////////////////////////////////////////
//                                                                     //
//                                                                     //
//    ʸᵒᵘ ᵖʳᵒᵇᵃᵇˡʸ ᵗʰᵒᵘᵍʰᵗ ᶦ ʷᵒᵘˡᵈ ʰᵃᵛᵉ ˢᵒᵐᵉ ᶠᵃⁿᶜʸ ᵃˢᶜᶦᶦ ᵐᵃʳᵏ ʰᵉʳᵉ,    //
//    ᵇᵘᵗ ᵗʰᵉ ᵗʳᵘᵗʰ ᶦˢ ᵗʰᵃᵗ ᵗʰᵉʳᵉ'ˢ ⁿᵒ ʳᵉᵃˡ ᵃʳᵗ ᵗʰᵃᵗ ᶦˢ ˢᵘᵖᵖᵒˢᵉᵈ ᵗᵒ    //
//    ᵇᵉ ᶜᵒⁿᵗᵃᶦⁿᵉᵈ ʷᶦᵗʰᶦⁿ ᵗʰᶦˢ ᶜᵒⁿᵗʳᵃᶜᵗ. ᵗʰᵉʳᵉ'ˢ ⁿᵒᵗʰᶦⁿᵍ ᵗᵃⁿᵍᶦᵇˡᵉ      //
//    ʰᵉʳᵉ. ᶦᵗ'ˢ ʲᵘˢᵗ ᵉˣᵖᵉʳᶦᵐᵉⁿᵗˢ ᶠᵒʳ ᵉˣᵖᵉʳᶦᵐᵉⁿᵗˢ ˢᵃᵏᵉ, ˢᵒ ʰᵒʷ ᵈᵒ      //
//    ʸᵒᵘ ʳᵉᵖʳᵉˢᵉⁿᵗ ᵗʰᵃᵗ ʷᶦᵗʰ ᵃ ᵖᶦᵉᶜᵉ ᵒᶠ ᵃˢᶜᶦᶦ ᵃʳᵗˀ                    //
//                                                                     //
//                                                                     //
/////////////////////////////////////////////////////////////////////////


contract DIVEXP is ERC1155Creator {
    constructor() ERC1155Creator() {}
}