// SPDX-License-Identifier: MIT

pragma solidity ^0.8.0;

/// @title: 蜡笔 MAGIC IS REAL
/// @author: manifold.xyz

import "./manifold/ERC721Creator.sol";

////////////////////////////////////////////////////////////////////
//                                                                //
//                                                                //
//                                                                //
//         c  c()_()        wWw  wWw   .-.   \\\  ///  oo_        //
//         (OO)(O o)    /)  (O)  (O) c(O_O)c ((O)(O)) /  _)-<     //
//       ,'.--.)|^_\  (o)(O)( \  / ),'.---.`, | \ ||  \__ `.      //
//      / //_|_\|(_))  //\\  \ \/ // /|_|_|\ \||\\||     `. |     //
//      | \___  |  /  |(__)|  \o / | \_____/ ||| \ |     _| |     //
//      '.    ) )|\\  /,-. | _/ /  '. `---' .`||  ||  ,-'   |     //
//        `-.' (/  \)-'   ''(_.'     `-...-' (_/  \_)(_..--'      //
//                                                                //
//                                                                //
//                                                                //
////////////////////////////////////////////////////////////////////


contract BRKCRN is ERC721Creator {
    constructor() ERC721Creator(unicode"蜡笔 MAGIC IS REAL", "BRKCRN") {}
}