{"SourceCode": "{{\r\n  \"language\": \"Solidity\",\r\n  \"sources\": {\r\n    \"contracts/storage/IStorage.sol\": {\r\n      \"content\": \"pragma solidity ^0.8.4;\\n// SPDX-License-Identifier: GPL-3.0-or-later\\n\\n// https://soliditytips.com/articles/solidity-interface-interact-with-other-contracts/\\ninterface IStorage {\\n    function getById(uint256 id) external returns (string memory unit);\\n    // Add more function signatures as needed.\\n}\"\r\n    },\r\n    \"contracts/storage/unit/UnitStorage14.sol\": {\r\n      \"content\": \"     \\npragma solidity ^0.8.4;\\n// SPDX-License-Identifier: GPL-3.0-or-later\\nimport \\\"../IStorage.sol\\\";\\n\\ncontract UnitStorage14 is IStorage{\\n    string[] public units;\\n    \\n    // set to onlyOwner()\\n    // check if value exists - \\n    constructor(){\\n        //250\\n       units.push(\\\"Chapter 3 presents the conceptual categories of exchange that serve as the foundation of performances. This chapter outlines the general nature of performances. It links closely with the following chapter on stake, which engages the way in which performances are valued by the network.\\\");\\n       units.push(\\\"Performances must also be understood as protocols of a network. This is a process of recognising performances as a sequence of events, making them both composable and divisible, so that they can be encoded (see Chapter 4.3). They are also interactive: across the network, they must be perceived, communicated and enacted. So each performance always includes an offer to the network, describing its organization, proposed outputs, proposed outcomes of those outputs, how their value should be measured, token issuance, governance, surplus distribution, etc.. Performances thus have scripts \\\\\\\\u2013 to \\\\\\\\u2018perform\\\\\\\\u2019 the sequence of events \\\\\\\\u2013 and are to be understood as expressions to be evaluated by the network.\\\");\\n       units.push(\\\"A performance is akin to what economics calls \\\\\\\\u2018production,\\\\\\\\u2019 but we utilize the broader term for the following reasons: \\\\\\\\n- \\\\\\\\u2018Performance\\\\\\\\u2019 puts the emphasis on creativity and innovation of those performing, unlike \\\\\\\\u2018production\\\\\\\\u2019 which is often associated with the repetitive discipline of a production line. \\\\\\\\n- How a performance is designed and implemented is determined by the performers, unlike production which is often associated with hierarchical control. \\\\\\\\n- A performance has an audience; production has a market. An audience may pay directly to consume/participate, but it may not. Part of the innovation of the new economic space is the recognition that contributions to value can take multiple forms: they won\\\\\\\\u2019t all be expressed through direct exchange in a market. \\\\\\\\n- It follows that there must be mechanisms of social (audience) acknowledgment and verification that value is being created. The returns to performers that come from a social acknowledgment of value creation are determined by relations of staking between agents, not extractive relations of wage labor and capital.\\\");\\n       units.push(\\\"So performances express what makes a postcapitalist economy a different experience for those participating in it: it places their creativity and their intention to create social meaning at the center of the economy and scripts them as offers to the network. It is then up to the network to determine whether these proposals warrant support by staking. Here is where the diversity of values, and different modes of measuring value, take on practical meaning, both in agents\\\\\\\\u2019 decisions about what to produce and how to produce it, but also in their claims to create value for the network.\\\");\\n       units.push(\\\"PERFORMING RELATIONS\\\");\\n       units.push(\\\"In the Hayekian (and neoclassical) framing of markets, there is no analysis of the process of production of outputs. There are inputs of labor, materials and technology, all acquired by exchange, and there are outputs sold for money. So there is an account for what goes into production and what comes out, but what goes on inside the production process is unexplained. Marx was decisively different in this regard. Marx depicts the relations in the process of production as the defining feature of a capitalist economy. It is the domain of the owners of the means of production (the employer of labor). The workplace runs at their discretion and wage workers must comply, subject to some degree of legally-imposed standards. These are the social relations Marx depicted as extractive: where workers produce more net output value than their wages can purchase. They produce a surplus, belonging to the owner.\\\");\\n       units.push(\\\"In a postcapitalist economy we need a different analysis of the organization of performances. The contemporary literature on postcapitalism focuses heavily on democratic workplace relations, flat hierarchies and workers\\\\\\\\u2019 control over production decisions. In the light of the disturbing histories of 20th century centrally-controlled \\\\\\\\u2018socialist\\\\\\\\u2019 states, current proposals for postcapitalist priorities tend to gravitate to the virtue of direct p2p, community modes of organization, most of which are not designed to scale.\\\");\\n       units.push(\\\"The protocols of the new economic space remain silent on the social relations of each performance. There are no standards or norms about how each performance may be defined and executed, how decisions are made, what metrics get generated and how performance revenues are shared between internal participants. In a distributed system it is the performance participants[78] who must determine the social relations of that performance and associated governance structure. However, although those \\\\\\\\u2018performing relations\\\\\\\\u2019 are determined by participants, they are nonetheless subject to network scrutiny. Performing relations are themselves a performance offer to the network, and subject to network evaluation in the same way other performance proposals are subject to network evaluation. We might anticipate that the social relations of a performance will be a critical issue for prospective stakers (and stakers of stakers). These relations can, thereby, be a site of continuing improvement, for that improvement is itself a claim to value creation.\\\\\\\\n\\\\\\\\n[78] Stakers could, for this purpose, be considered participants. They could make their staking conditional on the performance offer having a certain structure, including its social relations in production. Furthermore, we expect performing relations to become a new value layer: a critical performance outcome.\\\");\\n       units.push(\\\"PROTOCOLS OF PERFORMANCES[79]\\\\\\\\n\\\\\\\\n[79] See L\\\\\\\\u00F3pez, J. \\\\\\\\u2018Network Performance: Distributed Computing Protocol.\\\\\\\\u2019 http://network-performance.manifold.one\\\");\\n       units.push(\\\"A performance is the organization of a coherent set of actions across a network to achieve a stated goal as a network state change. It must be recognized by agents in the network as constituting a discrete series of events. Socially and culturally, a performance offer is an expression of an intention to create something of social worth and have it recognized and verified by the network; in effect, to be declared as value.\\\");\\n       units.push(\\\"The term \\\\\\\\u2018recognition\\\\\\\\u2019 is important here, and it must have a formal meaning, for while a performance may be depicted as a creative, expressive offer, it must also be ledger-compatible. As defined by the International Financial Reporting Standards (IFRS Foundation 2015:12) \\\\\\\\u2018recognition is the process of capturing an asset or liability for inclusion in the financial statements.\\\\\\\\u2019 So it links closely to the chosen units in which a financial account is compiled and presented (see Chapter 7). Suffice it here to say that recognition relates to the way a creative offer is expressed to the network in a way the network will recognise as a proposal to create a new asset.\\\");\\n       units.push(\\\"Financially, a performance implies taking on a risk position on the future: a calculation that the costs of mounting a performance will generate new value in excess of those costs (a surplus in some form). Performances will generally be intentionally planned, but it is possible that network data may reveal the conditions of an \\\\\\\\u2018unplanned\\\\\\\\u2019 performance.\\\");\\n       units.push(\\\"Performances may be \\\\\\\\u2018closed\\\\\\\\u2019 or \\\\\\\\u2018open\\\\\\\\u2019 (or have recognizable dimensions of each), reflecting distinctive risk positions: \\\\\\\\n- _A closed performance._ This is a pre-scripted process with a determinate end. It may be thought of as a one-off or a defined series. The quantification of outputs here is relatively straightforward and the risk is associated with the costs relative to Value creation of a broadly-known output. \\\\\\\\n- _An open performance._ Where the stated goal is aspirational and the performance may not have a clear beginning, nor a clear end, it is called an open-ended performance. Its outputs are likely to be inputs for \\\\\\\\u2018higher-order\\\\\\\\u2019 performances, just as its own inputs will likely be combinations of other, \\\\\\\\u2018lower-order\\\\\\\\u2019 performances. The implied complexity and coordination makes the pricing of outputs and of stake more about broader, collective, network goals than individual ones (see Appendix 4.2). It is likely that performances offered to the commons will be open rather than closed performances.\\\");\\n       units.push(\\\"In elaborating the nature of performances there are concepts that we will first define separately, and then bring together: \\\\\\\\n- _Information: any performance-related data recorded in the network._[80] The network will \\\\\\\\u2018automatically\\\\\\\\u2019 create the possibility of recording a vast range of data. These will most obviously be about times, places and prices of exchange, but there can readily be produced adjunct data. These could be about performance scripts, design and execution, the agents and their trading histories, time intervals between offers and network matching, intensities of interest from other agents, agent satisfaction, networks of connection between exchanging agents, state changes in the project organization, bits transferred, documents created, and more. \\\\\\\\n- _Event: sets of data thought to have a combined meaning (a data narrative)._ Data analytics could readily be built on top of these raw data. The simplest analytic we call an _economic event_: the identification of data happening in combinations (a+b)[81] where a and b could be raw data or themselves compiled from statistical analytics. One can imagine a tree of a\\\\\\\\u2019s and b\\\\\\\\u2019s combining to form new, \\\\\\\\u2018higher-order\\\\\\\\u2019 a\\\\\\\\u2019s and new b\\\\\\\\u2019s. \\\\\\\\n- _Events in combinations: events (data narratives) which can cause desired effects_. Events are devoid of a causal proposition over time. But when we propose causality (a+b leads to c), we invoke the conditions for a performance. Events in combinations may then be treated as higher-order events themselves. When data are encoded as narratives, they adopt the grammar of value, but still lack the verification of the network that is the condition of value. \\\\\\\\n- _Performance: innovation and risk._ Events in combinations propose causality, but no innovation. So if the proposition a+b leads to c were posed in the subjunctive tense \\\\\\\\u2013 if a+b _were to_ lead to c \\\\\\\\u2013 we add a contingency, for a+b may or may not lead to c. The subjunctive proposition becomes a risk exposure when the occurrence of c has consequences which can be expressed financially. This is a performance in the domain of taking a position on the future: a performance, framed in the subjunctive, with financial consequences. \\\\\\\\n- _Performance index: measuring the execution of a performance._ This is a specific calculation on the information produced by the technical data on performance (it is the result of a mathematical formula). It has a magnitude that is expected to change over time. It also has a type, which is the particular dimension of quantifiable measurement (e.g. transaction speed, liquidity index, average transaction volume, carbon footprint, engagement index) that makes all performances commensurable in these dimensions. \\\\\\\\n- _A measurement of value: network responses to a performance._ This involves the identification of whether a performance has met its verifiable outcome targets (measures of social effects) sufficient to be validated by the network as the creation of value. No measure can be made until the completion of a first performance, but this measurement serves as information for staking on second and subsequent performances. \\\\\\\\n- _Stake: network calculation of future performances._ This results from the preparedness to invest in some ownership of a performance. Stake frames contingency as potentiality. It takes the contractual form: \\\\\\\\u2018I am prepared to stake an asset in expectation of a yield, should future events occur.\\\\\\\\u2019 All the above data can impact decisions to stake a performance, but most obviously the performance index and the measurement of value.\\\\\\\\n\\\\\\\\n[80] The network holds all records, of which the ledger is just one type; for example, records of offers made, even if they do not get a match. Moreover, it warrants emphasizing that it is performances that encode information with meaning.\\\\\\\\n [81] By \\\\\\\\u2018+\\\\\\\\u2019 in this context we mean simply \\\\\\\\u2018in combination with,\\\\\\\\u2019 where combinations may be expressed in any way that is deemed to have economic significance.\\\");\\n       units.push(\\\"We can now see these dimensions in combination. The information generation that is triggered around an act of exchange and the enactment of a performance can be framed as the basis for individual agents to take positions on the performance or consequences of the economic endeavor. With slight elaboration, we identify the codification of data into performances whose contingency can be staked. A critical proposition follows. Something produced with potential, measurable social significance - be it a physical good, a service, or an intangible - could be offered to the network. It is expressed socially as a performance, qualitatively as a measurement of value, quantitatively as a performance index and made investable as a stake.\\\");\\n       units.push(\\\"PERFORMANCE INDICES AND VALUE MEASURES\\\");\\n       units.push(\\\"Any agent can transform information into an index or \\\\\\\\u2018measure\\\\\\\\u2019 and publish it to the market, but whether it becomes network-recognized will depend on others adopting it to measure their activities consistent with its meaning. An index or other measure must be endorsed by the network and in this sense, indices have attributes of produced commodities: they are themselves \\\\\\\\u2018performed.\\\\\\\\u2019\\\");\\n       units.push(\\\"Performance indices \\\\\\\\nThese measure performances of technical processes of output creation. They are the mode of measuring (counting) outputs of a performance. Quantification is critical in any economy, but in the Economic Space Protocol these quantities are not immediately or always converted to a universal unit of exchange (prices and revenues). The compilation of indices must preserve how output and outcome qualities are different-but-measurable.\\\");\\n       units.push(\\\"Performance indexes measure combinations of data that seek to capture statistical relations designed to depict events, using nominated measures such as repetitions, influence, replications and attraction. A performance could be a single event-with-consequences (e.g. other performances reference/adopt/adapt this performance) or the event is itself repeated, with each repeat triggering recognition. Either way, it involves the identification and quantification of a continuous set of indicators, that are defined at the time the performance is offered for stake. Quantifying occurrences makes different outputs quantitatively commensurable (as a spread), without reducing them to a single measure. Notice that this framing preserves the diversity of measures to preclude them being reduced to a single index (which would then look like a conventional price). In summary, performance indices preserve what is qualitatively distinctive about outputs and outcomes while at the same time counting their occurrences (quantifying).\\\");\\n       //268\\n    }\\n    function set(uint256 location, string calldata _unit) external {\\n        units[location] = _unit;\\n    }\\n    function getById(uint256 location) external override returns (string memory unit) {\\n        return units[location];\\n    }\\n\\n}\"\r\n    }\r\n  },\r\n  \"settings\": {\r\n    \"optimizer\": {\r\n      \"enabled\": false,\r\n      \"runs\": 200\r\n    },\r\n    \"outputSelection\": {\r\n      \"*\": {\r\n        \"*\": [\r\n          \"evm.bytecode\",\r\n          \"evm.deployedBytecode\",\r\n          \"devdoc\",\r\n          \"userdoc\",\r\n          \"metadata\",\r\n          \"abi\"\r\n        ]\r\n      }\r\n    },\r\n    \"libraries\": {}\r\n  }\r\n}}", "ABI": "[{\"inputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"constructor\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"location\",\"type\":\"uint256\"}],\"name\":\"getById\",\"outputs\":[{\"internalType\":\"string\",\"name\":\"unit\",\"type\":\"string\"}],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"location\",\"type\":\"uint256\"},{\"internalType\":\"string\",\"name\":\"_unit\",\"type\":\"string\"}],\"name\":\"set\",\"outputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"\",\"type\":\"uint256\"}],\"name\":\"units\",\"outputs\":[{\"internalType\":\"string\",\"name\":\"\",\"type\":\"string\"}],\"stateMutability\":\"view\",\"type\":\"function\"}]", "ContractName": "UnitStorage14", "CompilerVersion": "v0.8.4+commit.c7e474f2", "OptimizationUsed": "0", "Runs": "200", "ConstructorArguments": "", "EVMVersion": "Default", "Library": "", "LicenseType": "", "Proxy": "0", "Implementation": "", "SwarmSource": ""}