// SPDX-License-Identifier: MIT

pragma solidity ^0.8.0;

/// @title: 【 𝕄𝕒𝕘𝕚𝕔𝕒𝕝 ℙ𝕒𝕣𝕒𝕕𝕖, 𝔹𝕦𝕟𝕟𝕪 】
/// @author: manifold.xyz

import "./manifold/ERC721Creator.sol";

////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//                                                                                                            //
//                                                                                                            //
//    𝕋𝕙𝕖 𝕡𝕒𝕣𝕒𝕕𝕖 𝕟𝕖𝕧𝕖𝕣 𝕤𝕥𝕠𝕡𝕤.                                                              //
//    𝔸𝕤 𝕝𝕠𝕟𝕘 𝕒𝕤 𝕥𝕙𝕖 𝕛𝕠𝕪𝕗𝕦𝕝 𝕞𝕖𝕝𝕠𝕕𝕪 𝕚𝕟 𝕠𝕦𝕣 𝕙𝕖𝕒𝕣𝕥𝕤 𝕕𝕠𝕖𝕤𝕟'𝕥 𝕤𝕥𝕠𝕡!    //
//                                                                                                            //
//                                                                                                            //
//                                                                                                            //
////////////////////////////////////////////////////////////////////////////////////////////////////////////////


contract MPB is ERC721Creator {
    constructor() ERC721Creator(unicode"【 𝕄𝕒𝕘𝕚𝕔𝕒𝕝 ℙ𝕒𝕣𝕒𝕕𝕖, 𝔹𝕦𝕟𝕟𝕪 】", "MPB") {}
}