// SPDX-License-Identifier: MIT

pragma solidity ^0.8.0;

/// @title: Cosmic Pepe
/// @author: manifold.xyz

import "./ERC1155Creator.sol";

////////////////////////////////////////////////////////////////////////////////////////////////
//                                                                                            //
//                                                                                            //
//                                                                                            //
//        ββββββββββββββββββββββββββββββββββββββββββββββββββββββββββββββββββββββββββββββββ    //
//        βββββββββββββββββββββββββββββββββββββββββββββββββββββββΒΦΦββββββββββββββββββββββ    //
//        βββββββββββββββββββββββββββββββββββββββββββββββββΦββ;΄΄΄΄΄΄;ββββββββββββββββββββ    //
//        βββββββββββββββββββββββββββββββββββββββββββ;;Π΄Φ΄΄ί;΄΄΄ββψ΄΄;βββββββββββββββββββ    //
//        ββββββββββββββββββββββββββββββββββββΦβ;΄΄΄΄΄΄΄·;;΄΄β΄΄΄;ββββββββββββββββββββββββ    //
//        ββββββββββββββββββββββββββββββββ;΄΄΄΄;Φ΄;;΄΄΄;βββ;ΦβΦ΄΄΄΄΄;;Φβββββββββββββββββββ    //
//        ββββββββββββββββββββββΒβββ;΄΄΄ββΦ΄΄΄΄΄ΪβββΦ΄΄΄Φββββββββ;΄΄΄΄΄΄;βββββββββββββββββ    //
//        βββββββββββββββββ;;΄;΄΄;βββ΄΄΄;ββ΄΄΄ψ΄΄΄βββ;΄΄΄ββββββββββββ;΄΄΄;ββββββββββββββββ    //
//        βββββββββββΦ΄΄΄ββ;΄΄;΄΄΄;ββΦ΄΄΄Φβ;΄΄Β;΄΄΄Φββ΄΄΄;ββββββΦ΄΄΄βββ΄΄΄ββββββββββββββββ    //
//        ββββββ΄΄΄;ββ΄΄΄΄ββ΄΄΄Φ΄΄΄ΦββΈ΄΄΄βΦ΄΄;β;΄΄΄Φββ΄΄΄Φββββββ;΄΄΄΄΄΄΄;ββββββββββββββββ    //
//        βββββββ΄΄΄;β;΄΄΄΄β;΄΄Φ;΄΄΄΄΄΄΄΄΄;β΄΄΄Φ;΄΄΄΄Φβ;΄΄΄Φβββββββ;;;;βββββββββββββββββββ    //
//        ββββββββ΄΄΄;β΄΄΄΄΄β΄΄΄β΄΄΄·;ββ΄΄΄Φ;΄΄΄΄΄΄΄΄΄;ββ΄΄΄ββββββββββββββββββββββββββββββ    //
//        βββββββββ΄΄΄;;΄΄΄΄΄;΄΄Ββ΄΄΄Φββ;΄΄΄Φ΄΄΄ββββ΄΄΄ββ;ββββββββββββββββββββββββββββββββ    //
//        ββββββββββ΄΄΄;΄΄;΄΄΄΄΄΄β;΄΄΄βββτ΄΄΄΄΄΄ββββββββββββββββββββββββββββββββββββββββββ    //
//        βββββββββββ΄΄΄΄΄΄β΄΄΄΄΄Φβω΄΄΄βββ;;;;;βββββββββββββββββββββββββββββββββββββββββββ    //
//        ββββββββββββ΄΄΄΄΄;β΄΄΄΄;ββ;βββββ΄΄΄΄΄΄ββββββββββββββββββββββββββββββββββββββββββ    //
//        βββββββββββββ΄΄΄΄βββ;ββ;΄΄;βββββΦ΄΄΄΄΄΄Φββββββββββββββββββββββββββββββββββββββββ    //
//        βββββββββββββΦ;;β΄΄΄΄;ββ΄΄΄Φβββββ΄΄΄;΄΄΄Φβββββββββββββββββββββββββββββββββββββββ    //
//        βββββββββββββ΄΄΄;;΄΄΄΄΄ΦΦ΄΄΄βββββ;΄΄Β;΄΄΄Φββββββββββββββββββββββββββββββββββββββ    //
//        ββββββββββββββ΄΄΄Φψ΄΄΄΄΄;;΄΄;ββββΦ΄΄;βΦ΄΄΄;βββββββββββββββββββββββ;΄΄΄΄;ββββββββ    //
//        ββββββββββββββ;΄΄΄Φ΄΄΄;΄΄΄΄΄΄Φββββ΄΄΄;΄΄΄΄΄;ββββββββββββββΦ;ββββ;΄΄΄΄΄΄΄΄βββββββ    //
//        βββββββββββββββ΄΄΄΄Φ΄΄΄β΄΄΄΄΄΄Φβββ;΄΄΄΄;;΄΄΄;βββββββ;;΅΄΄΄΄΄;βββ΄΄΄;ββ΄΄΄;ββββββ    //
//        ββββββββββββββββ΄΄΄;;΄΄;β;΄΄΄΄΄βββΦ΄΄΄ββββ΄;;ββ;΄΄΄;;΄΄΄;;βββββββ΄΄;ββ;΄΄;ββββββ    //
//        ββββββββββββββββΦ΄΄΄Φ΄΄΄Φββ΄΄΄΄;βββ΄φ;β;;΄΄;βββ΄΄΄΄΄Φ΄΄΄;βββββββββββββ΄΄΄βββββββ    //
//        βββββββββββββββββ;΄΄΄β΄΄΄Φββ;΄;;;;;΄Φββψ΄΄΄΄;ββ;΄΄΄΄΄β΄΄΄;;;΄;βββββββ;΄΄;βββββββ    //
//        ββββββββββββββββββ΄΄΄;Φ;;β;;;ββ;΄΄΄΄΄Φββ΄΄΄΄΄;ββ΄΄΄΄΄;;΄΄΄΄΄΄;βββββββΦ΄΄΄βββββββ    //
//        βββββββββββββββββββ;;΄΄;ββ΄΄΄Φββ΄΄΄΄΄΄;βΦ΄΄΄΄΄΄β΄΄;΄΄΄Φ΄΄΄Αββββββββββββ;;;ββββββ    //
//        βββββββββββββββββββΦ΄΄΄΄΄Φβ΄΄΄ββ΄΄΄β΄΄΄;β;΄΄;΄΄΄;΄΄Φ΄΄΄β΄΄΄;ββββ;ββββββ΄΄΄ββββββ    //
//        ββββββββββββββββββββ;΄΄΄΄΄;;΄΄;βΦ΄΄;β΄΄΄;β΄΄΄Φ΄΄΄΄΄;;΄΄΄Φ΄΄΄΄΄΄΄΄;ββββββββββββββ    //
//        βββββββββββββββββββββ΄΄΄;΄΄Ϊ΄΄΄;β΄΄΄ββ΄΄΄΄β΄΄΄β΄΄΄΄΄β΄΄΄;;΄΄΄;;βββββββββββββββββ    //
//        ββββββββββββββββββββββ΄΄΄β΄΄΄΄΄΄Φ;΄΄΄΄΄΄΄΄΄;΄΄Αβ;΄΄΄ββχ;ββββββββββββββββββββββββ    //
//        ββββββββββββββββββββββ;΄΄;β;΄΄΄΄΄Φ΄΄΄;;β;΄΄΄;΄΄βββββββββββββββββββββββββββββββββ    //
//        βββββββββββββββββββββββ΄΄΄;βΦ΄΄΄΄;΄΄΄ββββ;;βββββββββββββββββββββββββββββββββββββ    //
//        ββββββββββββββββββββββββ΄΄΄Φββ;΄΄΄;;;βββββββββββββββββββββββββββββββββββββββββββ    //
//        ββββββββββββββββββββββββΦ΄΄;ββββββββββββββββββββββββββββββββββββββββββββββββββββ    //
//        ββββββββββββββββββββββββββββββββββββββββββββββββββββββββββββββββββββββββββββββββ    //
//        ββββββββββββββββββββββββββββββββββββββββββββββββββββββββββββββββββββββββββββββββ    //
//                                                                                            //
//                                                                                            //
//                                                                                            //
////////////////////////////////////////////////////////////////////////////////////////////////


contract CPP is ERC1155Creator {
    constructor() ERC1155Creator() {}
}