// SPDX-License-Identifier: MIT

pragma solidity ^0.8.0;

/// @title: góðan daginn
/// @author: manifold.xyz

import "./manifold/ERC1155Creator.sol";

//////////////////////////////////////////////////////////
//                                                      //
//                                                      //
//    ._____.___ ._______._______.________.___.__       //
//    :         |: .____/: .____/|    ___/:   |  \      //
//    |   \  /  || : _/\ | : _/\ |___    \|   :   |     //
//    |   |\/   ||   /  \|   /  \|       /|   .   |     //
//    |___| |   ||_.: __/|_.: __/|__:___/ |___|   |     //
//          |___|   :/      :/      :         |___|     //
//                                                      //
//                           '                          //
//                        \  ,  /                       //
//                    ' ,___/_\___, '                   //
//                       \ /o.o\ /                      //
//                   -=   > \_/ <   =-                  //
//                       /_\___/_\                      //
//                    . `   \ /   ` .                   //
//                        /  `  \                       //
//                                                      //
//                           .                          //
//        góðan daginn (Icelandic for Good Morning)     //
//                 Bidders Edition //                   //
//                                                      //
//                                                      //
//                                                      //
//                                                      //
//////////////////////////////////////////////////////////


contract GM is ERC1155Creator {
    constructor() ERC1155Creator(unicode"góðan daginn", "GM") {}
}