// SPDX-License-Identifier: MIT

pragma solidity ^0.8.0;

/// @title: À Fleur de Peau
/// @author: manifold.xyz

import "./manifold/ERC721Creator.sol";

/////////////////////////////////////////////////////////////////////////////
//                                                                         //
//                                                                         //
//                                                                         //
//             /\        .----.     .-._.---'.                             //
//         _  / |          /   `   (_) /    /                              //
//        (  /  |  .      /           /--. / .-._.`)    (   .-.  ).--.     //
//         `/.__|_.'     /           /    / (   ) /  .   )./.-'_/          //
//     .:' /    |       /         .-/   _/_.-`-' (_.' `-' (__.'/           //
//    (__.'     `-'.---------'   (_/                                       //
//                                                                         //
//                                                                         //
//                                                                         //
/////////////////////////////////////////////////////////////////////////////


contract AIFP is ERC721Creator {
    constructor() ERC721Creator(unicode"À Fleur de Peau", "AIFP") {}
}