{"SourceCode": "{{\r\n  \"language\": \"Solidity\",\r\n  \"sources\": {\r\n    \"contracts/storage/IStorage.sol\": {\r\n      \"content\": \"pragma solidity ^0.8.4;\\n// SPDX-License-Identifier: GPL-3.0-or-later\\n\\n// https://soliditytips.com/articles/solidity-interface-interact-with-other-contracts/\\ninterface IStorage {\\n    function getById(uint256 id) external returns (string memory unit);\\n    // Add more function signatures as needed.\\n}\"\r\n    },\r\n    \"contracts/storage/unit/UnitStorage9.sol\": {\r\n      \"content\": \"     \\npragma solidity ^0.8.4;\\n// SPDX-License-Identifier: GPL-3.0-or-later\\nimport \\\"../IStorage.sol\\\";\\ncontract UnitStorage9 is IStorage{\\n    string[] public units;\\n    \\n    // set to onlyOwner()\\n    // check if value exists - \\n    constructor(){\\n        //155\\n       units.push(\\\"So Hayek has identified a critical issue: that markets, as a protocol, construct indices of measurement, in this case a rate of exchange, so that any small component of the economy can be commensurated against the whole, for this is the condition of tracing how a change in that small thing impacts the whole. This is an issue we return to consistently: the construction of distinctly postcapitalist communication networks and ways of measurement.\\\");\\n       units.push(\\\"Hayek\\\\\\\\u2019s notion of \\\\\\\\u2018free\\\\\\\\u2019 markets and prices transmitting information may be one technical \\\\\\\\u2018solution\\\\\\\\u2019 (if we leave to one side the conceptually trivial and therefore socially dangerous idea of \\\\\\\\u2018free\\\\\\\\u2019 markets[43]), but it is only one, and a decidedly capitalist, \\\\\\\\u2018solution.\\\\\\\\u2019 For Hayek, price is the reduction of complexly-layered knowledge to a single index. With everyone speaking the language of price and the pursuit of profit as a singular objective for decision-making, market interactions are said to generate spontaneous order, but what they actually do is to structure the space of the possible. Hayek\\\\\\\\u2019s mid 20th century advocacy of \\\\\\\\u2018the market\\\\\\\\u2019 and trust in \\\\\\\\u2018prices\\\\\\\\u2019 may stand strong as an alternative to Soviet central planning, but 75 years on the argument must be different.\\\\\\\\n\\\\\\\\n[43] Hayek\\\\\\\\u2019s explicit reference to a means-end structure signals that the ends are beyond evaluation.\\\");\\n       units.push(\\\"It is important to understand that alternative economic indexes can be based in different knowledge, producing a different logic: a different space of what is possible. We want indexed movements to measure economic performance(s) and surpluses and to trigger trading strategies for agents that lead to wider economic decisions about what is produced and how. We want to avoid automatic reliance on indices that embed profit maximizing strategies or situate in monetary processes driven by interest extraction. We depict our preferred measures as the performance indices of the new economic space. Performance indices are explored in Chapter 4.\\\");\\n       units.push(\\\"We should note the way in which Hayek depicts price as a simplified index that obviates the need for agents to hold full knowledge. Via cultural enmeshment, agents come to believe that price can be trusted to incorporate knowledge. \\\\\\\\nThe most significant fact about this system is the economy of knowledge with which it operates, or how little the individual participants need to know in order to be able to take the right action. In abbreviated form, by a kind of symbol, only the most essential information is passed on, and passed on only to those concerned. It is more than a metaphor to describe the price system as a kind of machinery for registering change, or a system of telecommunications which enables individual producers to watch merely the movement of a few pointers, as an engineer might watch the hands of a few dials, in order to adjust their activities to changes of which they never know more than is reflected in the price movement. (Hayek, 1945: 526-27)\\\");\\n       units.push(\\\"It would be a misrepresentation of Hayek to read from this quote that prices are the _only_ data on which agents make decisions: after all, no-one buys anything simply because of its price. Price may initiate exchange as the trigger information, but it is not sufficient information to explain exchange.[44] Individuals are also \\\\\\\\u2018readers\\\\\\\\u2019 of themselves and of the \\\\\\\\u2018market conditions\\\\\\\\u2019 and they trade on the basis of their subjective preferences, informed by whatever information they choose to utilize. The brilliance of markets, he thought, is the reduction of a complexity of data to a single index of exchange.[45] Through price signals, markets transmit \\\\\\\\u2018tacit\\\\\\\\u2019 or \\\\\\\\u2018dispersed\\\\\\\\u2019 knowledge. But, for all the information individuals may potentially generate \\\\\\\\u2013 including their affects and velleities[46] \\\\\\\\u2013 it is only the transaction-at-a-price that triggers a data entry.\\\\\\\\n\\\\\\\\n[44] Morozov (2019) contends it is just a neoclassical interpretation of Hayek that argues _all_ information reduces to price.\\\\\\\\n [45] For example, when I pay $5 for a cup of coffee I am not actually going through a complex calculation of the costs of all the technologies, raw materials, transport, labor, taxes, consumer preferences etc. that lie behind a cup of coffee. I just reduce all that to the acceptance of the price, pass over the debit card, and receive the coffee.\\\\\\\\n [46] This is the perfect word in this context, but it is not in common usage, so we offer a definition. A velleity is a wish or inclination not strong enough to lead to action.\\\");\\n       units.push(\\\"In Hayek\\\\\\\\u2019s framing, price may be the condensation of a complex set of knowledges, but knowledge is not intended to be reverse engineered from price.[47] All other data about an output and the interactions around its creation and exchange are thereby lost when price is elevated as the form in which knowledge is transmitted. Yet we now know that, in the current world, social media and on-line marketing are assembling all sorts of data about individuals, their velleities, \\\\\\\\u2018attributes\\\\\\\\u2019 and networks. In these \\\\\\\\u2018attention markets\\\\\\\\u2019 price is just one amongst many data points valued by corporations. A postcapitalist economy not driven by extractive relations or surveillance, will nonetheless need data-rich architecture. This issue is taken up in Appendix 2.1\\\\\\\\n\\\\\\\\n[47] Financial market models that attempt this reverse engineering are at best crude, and were not envisioned by Hayek.\\\");\\n       units.push(\\\"Price is not the condensation of knowledge. Price is, after all, no more than one index: it measures _relative_ exchange values (between commodities; over time). But in the hands of Hayek (and the neo-classicals), with their version of \\\\\\\\u2018the market\\\\\\\\u2019 naturalized as a platform, price can be treated socially as an _absolute_ social measure. Indeed this is the analytical objective: to create the impression that price formation is the social expression of the natural order of markets. Prices slide from being technically relative values framed in a particular social and economic context to being presented as socially absolute values.\\\");\\n       units.push(\\\"Here is where many crypto analysts who profess dissent from capitalist values get unwittingly trapped: by celebrating the creation of a monetary system freed from the state, but embracing the reliance on markets and self interest they embed the values they are seeking to escape. How we frame markets, prices and units of account are the central economic questions of a distributed postcapitalist economy.\\\");\\n       units.push(\\\"PRICES FREED FROM PROFIT\\\");\\n       units.push(\\\"Our starting point is that information must \\\\\\\\u2018from the start\\\\\\\\u2019 be an expression of social values, in the same way that Hayek\\\\\\\\u2019s information \\\\\\\\u2018from the start\\\\\\\\u2019 expresses capitalist values. Our postcapitalist network will require data on flows of intentions, affect and emotional commitments - expressions of the sorts of values that will frame the direction of this economy \\\\\\\\u2013 for these data will inform the debates and choices about making that future.\\\");\\n       units.push(\\\"Prices in a capitalist economy are determined, generally, by the interaction of supply and demand. Demand may be all about individual \\\\\\\\u2018tastes\\\\\\\\u2019: their values, aesthetics, needs, etc.: a domain generally inaccessible to economics, except as data. Supply in a capitalist economy is more telling. It is dictated, other than in exceptional cases, by the condition of profitability. Whether adopting a competitive market explanation or a post-Keynesian mark-up (cost plus a rate of profit) explanation of prices, profitability is at the center. Producers will not supply to a market unless it is profitable to do so.[48] The value of capital assets are defined by their profit-generating potential, and so on.\\\\\\\\n\\\\\\\\n[48] We note the short term supply condition of covering fixed costs, so ours is a longer-term and more general proposition.\\\");\\n       units.push(\\\"Further, prices-linked-to-profit are based in the way profit is calculated, and that points to the structure of accounting. There exists an extensive literature in the history of accounting, tying the system of double entry book-keeping to the rise of capitalism.[49] Double entry book-keeping, as it developed, became central to the way wealth is specified as \\\\\\\\u2018capital\\\\\\\\u2019; how profit (the extraction of a surplus from production by the owners of capital) became legitimized by the mode of its inclusion into the structure of corporate accounts, and how the concept of \\\\\\\\u2018profit\\\\\\\\u2019 evolved as capitalism itself has evolved.[50]\\\\\\\\n\\\\\\\\n[49] The work of R.A Bryer is particularly important in this analysis. See https://www.researchgate.net/scientific-contributions/RA-Bryer-2003195221. For a summary of and insight on the literature accounting and capitalism, see Chiapello (2007) and Chapter 6.3.\\\\\\\\n [50] Indeed, it was not until the middle of the 19th century and the rise of joint stock companies (ownership diversified through a stock exchange), that the rules of these accounts became generalized. In essence, owners and prospective owners needed reputable information on which to base their decisions to buy and sell.\\\");\\n       units.push(\\\"A postcapitalist economy cannot adopt capitalist modes of accounting. Yet, in parallel with our contentions about prices and markets, it is important to differentiate the particular capitalist application of double entry ledgers \\\\\\\\u2013 the units in which measurement is recorded \\\\\\\\u2013 from the logic of ledgers formulated with a system of entries and counter-entries. The use of tokens and a ledger-based accounting system are central to the Economic Space Protocol and in later chapters we will explore the way in which an economic space, with double entry book-keeping measured with a different units of value, opens the possibility for a different determination of \\\\\\\\u2018prices\\\\\\\\u2019 and designation of a surplus, and how these link to designing postcapitalist value.\\\");\\n       units.push(\\\"Indeed, as will be explained in Chapter 4, combinations of information, and propositions of their economic significance (what we call \\\\\\\\u2018performances\\\\\\\\u2019), come to the fore as the critical, frontier products of the new economy. Giving meaning (even competing meanings) to information is the critical economic agenda for the future. This is about using information to create narratives of the future, as a way of opening up new possibilities, rather than codifying data into price for individual market choices. Why then is \\\\\\\\u2018price,\\\\\\\\u2019 as it is currently measured, the privileged index of valuation? Why do we not use (for example) sociality (social impact) as the privileged index of valuation? Or environmental impact? The answer is that these issues are not currently being tracked in the records (the ledgers) on which the current economy operates.\\\");\\n       units.push(\\\"We are interested in focusing on the richness of information _flows_ and not just with the specific indices (\\\\\\\\u2018prices\\\\\\\\u2019) that get generated as part of the flows. And we want \\\\\\\\u2018price\\\\\\\\u2019 (or the quantum attributed to an output which has been validated by the network through market expression) to itself express \\\\\\\\u2018social values\\\\\\\\u2019; not profit per se.\\\");\\n       units.push(\\\"TURNING HAYEK ON HIS HEAD\\\");\\n       units.push(\\\"The challenge we\\\\\\\\u2019ve mounted is to make clear that the process of price formation \\\\\\\\u2018price,\\\\\\\\u2019 as it is conventionally understood, can be re-framed as just one set of protocols but not, as Hayek would have us believe, the _only_ one. In the context of distributed ownership and distributed issuance of \\\\\\\\u2018money,\\\\\\\\u2019 the social processes of the economy will be profoundly challenged.\\\");\\n       units.push(\\\"Three challenges are pivotal, and they drive the analytical agenda of our analysis: \\\\\\\\n_Network value._ How does a network place a value on outputs not produced for sale in a market, for example an art display, creating green spaces, new open source technology and human care?[51] Outputs-with-no-price cannot be interpreted in a Hayekian framing. Our preferred approach comes not via value in exchange, but via how agents in the network place a value on the performances which produce the outputs. We are interested in the _performance_ of care; the _vision_ of green space, the _potential_ of open technology, and these cannot be framed in standard market analysis devoid of time, affect and contingency.\\\\\\\\n\\\\\\\\n[51] Of course these outputs _can_ be designed for commercial sale, but that will capture only a fraction of their social contribution/collective value.\\\");\\n       units.push(\\\"The role of the Economic Space Protocol is to build ways to express the value of outputs, without reliance on a direct price (see Chapter 3.5.). Moreover, those who create outputs-with-no-price should participate in rewards based on social assessment of their contribution. The reward is to be understood simply as a share of a surplus created in production (see Chapter 5 and Appendix 5.2).[52]\\\\\\\\n\\\\\\\\n[52] At this point in the analysis, a surplus can be taken to mean any excess over what is required to reproduce the current conditions of the network. It is usually thought in financial terms (profit rent, interest) or commodity outputs in excess of commodity inputs (e.g. Sraffa, 1960). We will later invoke broader, more social perspectives on \\\\\\\\u2018surplus.\\\\\\\\u2019\\\");\\n        // 173\\n    }\\n    function set(uint256 location, string calldata _unit) external {\\n        units[location] = _unit;\\n    }\\n    function getById(uint256 location) external override returns (string memory unit) {\\n        return units[location];\\n    }\\n\\n}\"\r\n    }\r\n  },\r\n  \"settings\": {\r\n    \"optimizer\": {\r\n      \"enabled\": false,\r\n      \"runs\": 200\r\n    },\r\n    \"outputSelection\": {\r\n      \"*\": {\r\n        \"*\": [\r\n          \"evm.bytecode\",\r\n          \"evm.deployedBytecode\",\r\n          \"devdoc\",\r\n          \"userdoc\",\r\n          \"metadata\",\r\n          \"abi\"\r\n        ]\r\n      }\r\n    },\r\n    \"libraries\": {}\r\n  }\r\n}}", "ABI": "[{\"inputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"constructor\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"location\",\"type\":\"uint256\"}],\"name\":\"getById\",\"outputs\":[{\"internalType\":\"string\",\"name\":\"unit\",\"type\":\"string\"}],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"location\",\"type\":\"uint256\"},{\"internalType\":\"string\",\"name\":\"_unit\",\"type\":\"string\"}],\"name\":\"set\",\"outputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"\",\"type\":\"uint256\"}],\"name\":\"units\",\"outputs\":[{\"internalType\":\"string\",\"name\":\"\",\"type\":\"string\"}],\"stateMutability\":\"view\",\"type\":\"function\"}]", "ContractName": "UnitStorage9", "CompilerVersion": "v0.8.4+commit.c7e474f2", "OptimizationUsed": "0", "Runs": "200", "ConstructorArguments": "", "EVMVersion": "Default", "Library": "", "LicenseType": "", "Proxy": "0", "Implementation": "", "SwarmSource": ""}