{"SourceCode": "{{\r\n  \"language\": \"Solidity\",\r\n  \"sources\": {\r\n    \"contracts/storage/IStorage.sol\": {\r\n      \"content\": \"pragma solidity ^0.8.4;\\n// SPDX-License-Identifier: GPL-3.0-or-later\\n\\n// https://soliditytips.com/articles/solidity-interface-interact-with-other-contracts/\\ninterface IStorage {\\n    function getById(uint256 id) external returns (string memory unit);\\n    // Add more function signatures as needed.\\n}\"\r\n    },\r\n    \"contracts/storage/unit/UnitStorage31.sol\": {\r\n      \"content\": \"     \\npragma solidity ^0.8.4;\\n// SPDX-License-Identifier: GPL-3.0-or-later\\nimport \\\"../IStorage.sol\\\";\\n\\ncontract UnitStorage31 is IStorage{\\n    string[] public units;\\n    \\n    // set to onlyOwner()\\n    // check if value exists - \\n    constructor(){\\n       //575\\n       units.push(\\\"The above depiction, making a clear and direct connection of tokens to output, is contingent upon a direct offer matching and complete netting. The introduction of a time interval (credit) and the possibility that matching may be indirect, or mediated through a web of matchings, requires a deeper explanation.\\\");\\n       units.push(\\\"Netting is not itself an explanation of fundamental value when trades occur at different times and there is not a one-to-one correspondence between offers. Put simply, netting presupposes the existence of the things to be netted, yet their delivery to market will not be simultaneous with the offer. Temporal gaps open a need for credit to provide liquidity to the time interval. Hence fundamental value must be explained in the context of credit and the need to create liquidity across a time interval. In this context, credit itself has fundamental value: delivery on its promise of future exchangeability.\\\");\\n       units.push(\\\"THE CONDITIONS OF A DIGITAL POSTCAPITALIST ECONOMY\\\");\\n       units.push(\\\"INTRODUCTION\\\");\\n       units.push(\\\"The Economic Space Protocol proposes an economy of distributed relations, without reliance on a central 3rd party authority. This is not a proposition that current nation states are redundant, for there are many centralized facets of society, and the rule of law is a conspicuous one, which impact directly on the economy. The new economy will exist in any foreseeable future within a mainstream social and economic context. It is simply presenting an alternative economic way of being and doing, and it offers a protocol that can be readily adopted by anyone, without the sponsorship of any nation-state.\\\");\\n       units.push(\\\"How the new economy interfaces with the conventional economy is an open design space, but also a domain of uncertainty. The specific objective of our analysis is to present the case, and it can be no more than a case, that, after an initial bootstrapping phase, the Economic Space Protocol offers a set of economic relations that can be self-reproducing. There will be porous boundaries between the conventional economy and the new economy: fiat money, commodities and people will move between the two systems. Indeed it is likely that every single user will have a foot in each system. But it is critical that we can present an economic logic for a coherent alternative that can become independent of constant financial top-up from outside (for example in dollars). A design goal is that the new economy can produce a surplus that generates its own conditions of continuation and expansion.\\\");\\n       units.push(\\\"Self-sustainability in a narrow economic sense is important, but it would be a modest achievement if the alternative we are proposing looks pretty much the same as the existing system. The new economic space we are proposing offers a new vision of economic relations: the conditions of increasing equality of living standards, the creation of environmental health, and an economy sensitive to the aesthetic, cultural, and emotional attachments of participants. These are the collectively-determined, socially-defined conceptions of calculable value creation, or what we can term simply \\\\\\\\u2018network value.\\\\\\\\u2019\\\");\\n       units.push(\\\"NETWORK VALUE\\\");\\n       units.push(\\\"The contention throughout this analysis is the capacity of the new economic space to incorporate performances creating outputs motivated by network value, and the capacity of the network to reward the performances that animate network value creation. We need to make as clear as possible the connection between network value, rewards and system reproduction. It requires all elements of the Economic Space Protocol, and all the earlier chapters to be brought together.\\\");\\n       units.push(\\\"Performances motivated by network value are already familiar: philanthropy, crowdfunding, etc. are all expressions of this agenda. The challenge is to show the conditions under which network value is sustained and reproduced without the need for continual injections of outside money. In other words, the social surplus recognized in network value needs to be seen as equivalent to profit in capitalism: where the market evaluates and rewards performances with a yield of some form recognized by the network, either through individual agents or the commons.\\\");\\n       units.push(\\\"Outputs being \\\\\\\\u2018recognized by the network\\\\\\\\u2019 is the term we use rather than \\\\\\\\u2018selling for a profit,\\\\\\\\u2019 for many performances may not generate profit; indeed are not targeting that objective. But they are targeting _some_ objective: we are not compiling the conditions where just any old performance might expect reward.\\\");\\n       units.push(\\\"The \\\\\\\\u2018yield,\\\\\\\\u2019 if not profit, must be in a form acceptable to the network: it could be commodities, credit, stake or indeed any kind of governance or access rights. The condition of the network being capable of self-reproducing is that the yield takes a form that the network can use for its reproduction: the yield is, or can be converted to, the inputs required to open another circuit of accumulation. This capacity to form a circuit is critical to the difference from philanthropy, which requires on-going injections of outside money for a new circuit to commence.\\\");\\n       units.push(\\\"The question remains: how does the network systematically recognize the values that animate performances, such that those values are recognized and reproduced by the circuit of accumulation? Here, the issue of staking is pivotal. The market-based determination of which performances agents are willing to stake is the network\\\\\\\\u2019s way of declaring what sorts of outputs (and the notions of value they embed) the network is backing financially. If we assume that staking is undertaken for reward, as described above, it must be the case that the ways outputs get recognized by the network provide the conditions of reproduction of the circuit, including the remuneration of stake.\\\");\\n       units.push(\\\"However, this is not a sufficient framing to complete the argument, for it is posed only in terms of the conditions of reproduction of individual stakes and individual outputs and their outcomes; not the network as a whole. The additional dimension relevant here is that stake is the collateral for credit, and credit is paid down out of both commodity token exchanges and rewards for performances. With a focus on the conditions of issuance and repayment of credit, the analysis takes the general form, expressed now in the network\\\\\\\\u2019s unit of credit. The ultimate test of the network\\\\\\\\u2019s embrace of network value, and outputs produced in accordance with that value calculus, is whether a commodity token, received in return for the provision of a particular commodity output, will be accepted by (all agents in) the network for purposes of clearing credit. Its acceptance is network verification; its denial is the opposite.\\\");\\n       units.push(\\\"Acceptance will not be a sudden and arbitrary determination at the moment of offer, as the above depiction may seem to suggest. Information flows in the network, taking the form of performances (for data must be encoded with meaning), will be providing agents in the network with real-time information on how offers are being evaluated and matched. So, working backwards from the acceptance of a commodity token in paying down credit, we can identify the social logic that leads to its likelihood of acceptance: the commodity token must relate to a commodity deemed valuable, which must come from a performance deemed value-creating, which is funded by stake deemed by a critical number of staking agents to be an investment in value creation and deemed by the network as providing collateral worthy of credit issuance.\\\");\\n       units.push(\\\"This is the general process by which the Economic Space Protocol supports and sustains an economy of network value. In the new economy, everything depends on everything else, as it does in a capitalist economy or any economic system. The taxonomies and measures, the systems of valuation and rewards and the pulses that keep the system moving are all mutually defining. It cannot be otherwise. At the core of the Economic Space Protocol is a simple proposition: in a distributed economy, everything depends on the generation and processing of agent-generated information, and the way that information is compiled, evaluated and acted on must also be agent-centered. So the Economic Space Protocol is a case for agent-centered internal credibility and coherence, and the condition of entry is the desire to experiment.\\\");\\n       units.push(\\\"WHERE TO FROM HERE?\\\");\\n       units.push(\\\"The protocol design principles of the new economic space have required that we cover some detailed and diverse conceptual and philosophical issues and combine them with the capacities of programmable protocol design. There are, no doubt, other ways to imagine and initiate a transition to postcapitalism, and we welcome that debate.\\\");\\n       units.push(\\\"The proposal presented here makes the case that the conditions of postcapitalism lie latent within capitalism and, to make that latent potential imminent, we must develop ways to engage capitalism at its contemporary frontier of innovation; to go beyond, rather than to turn back. In particular, we need to engage three related elements.\\\");\\n       // 593\\n    }\\n    function set(uint256 location, string calldata _unit) external {\\n        units[location] = _unit;\\n    }\\n    function getById(uint256 location) external override returns (string memory unit) {\\n        return units[location];\\n    }\\n\\n}\"\r\n    }\r\n  },\r\n  \"settings\": {\r\n    \"optimizer\": {\r\n      \"enabled\": false,\r\n      \"runs\": 200\r\n    },\r\n    \"outputSelection\": {\r\n      \"*\": {\r\n        \"*\": [\r\n          \"evm.bytecode\",\r\n          \"evm.deployedBytecode\",\r\n          \"devdoc\",\r\n          \"userdoc\",\r\n          \"metadata\",\r\n          \"abi\"\r\n        ]\r\n      }\r\n    },\r\n    \"libraries\": {}\r\n  }\r\n}}", "ABI": "[{\"inputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"constructor\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"location\",\"type\":\"uint256\"}],\"name\":\"getById\",\"outputs\":[{\"internalType\":\"string\",\"name\":\"unit\",\"type\":\"string\"}],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"location\",\"type\":\"uint256\"},{\"internalType\":\"string\",\"name\":\"_unit\",\"type\":\"string\"}],\"name\":\"set\",\"outputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"\",\"type\":\"uint256\"}],\"name\":\"units\",\"outputs\":[{\"internalType\":\"string\",\"name\":\"\",\"type\":\"string\"}],\"stateMutability\":\"view\",\"type\":\"function\"}]", "ContractName": "UnitStorage31", "CompilerVersion": "v0.8.4+commit.c7e474f2", "OptimizationUsed": "0", "Runs": "200", "ConstructorArguments": "", "EVMVersion": "Default", "Library": "", "LicenseType": "", "Proxy": "0", "Implementation": "", "SwarmSource": ""}