{"SourceCode": "{{\r\n  \"language\": \"Solidity\",\r\n  \"sources\": {\r\n    \"contracts/storage/IStorage.sol\": {\r\n      \"content\": \"pragma solidity ^0.8.4;\\n// SPDX-License-Identifier: GPL-3.0-or-later\\n\\n// https://soliditytips.com/articles/solidity-interface-interact-with-other-contracts/\\ninterface IStorage {\\n    function getById(uint256 id) external returns (string memory unit);\\n    // Add more function signatures as needed.\\n}\"\r\n    },\r\n    \"contracts/storage/unit/UnitStorage33.sol\": {\r\n      \"content\": \"     \\npragma solidity ^0.8.4;\\n// SPDX-License-Identifier: GPL-3.0-or-later\\nimport \\\"../IStorage.sol\\\";\\n\\ncontract UnitStorage33 is IStorage{\\n    string[] public units;\\n    \\n    // set to onlyOwner()\\n    // check if value exists - \\n    constructor(){\\n       units.push(\\\"A circuit of value refers to the process where an economy goes through continuous processes of production, sale, consumption and investment leading to new production (hence a circuit). Expansion sees the value of output grow as it moves round the circuit. Crisis is associated with a break in the circuit.\\\");\\n       units.push(\\\"Clearing is technically netting with a temporal component. In banking we see it as bilateral reduction of balance sheet leverage done at certain intervals. It is a necessary element in any credit system. Centralized clearing divides agents in the network in two classes: those that can issue/clear money, and those that cannot. In the economic space protocol, clearing is a network process where every agent participates and collectively assumes the role commonly taken by a specialized third party like a clearing house. Every economic space agent also becomes clearer i.e. like a little banker who is part of a credit issuing and clearing network which is run just by participating in a joint protocol. Economic space agents learn to do clearing through the creation of liquidity tokens: when you issue a liquidity token, you issue it to the credit network. Every liquidity token becomes thus part of the credit network. That is how it is possible for them to clear. Liquidity tokens are used to facilitate and confirm ledger entries, generating stability in economic flows; they are not coins to accumulate or loaned for profit.\\\");\\n       units.push(\\\"Coins are in themselves a preferred or agreed upon store of value. Coins are \\\\\\\\u2018minted\\\\\\\\u2019 or exclusively issued by privileged third parties. Tokens in the economic space protocol are not coins. Rather, they are economic objects (bundles of rights) that refer to an asset and can affect the network state (bearer smart contracts). A token is always attached to (stands for) a \\\\\\\\u2018real\\\\\\\\u2019 asset (encoded as a set of contractual rights). A more precise concept would be a \\\\\\\\u2018material underlier\\\\\\\\u2019 and there are always \\\\\\\\u2018real\\\\\\\\u2019 asset transfers associated with token exchanges. For example, wealth may be stored as stake, and recorded by a token entry in the network ledger to that effect (an asset recorded in a ledger as X stake tokens). Furthermore, in the economic space protocol communication is not exchange of messages, but exchange of objects (bundles of rights, capabilities, authority). Tokens are such objects, but what makes them special is that they are mutually exclusive: they are \\\\\\\\u201Ctokens of authority\\\\\\\\u201D. In this sense they are like an authority modulation logic, transmitting value and authority. Tokens are access to authority and capacity to affect the network in a particular way, plus a measurement (amount). In other words, tokens are quantified authority or quantified authorship, authorship with a strength. That is a formal definition of value for the economic space protocol.\\\");\\n       units.push(\\\"When we turn to the digital economy and cryptographically enabled decentralized economic systems, the state cannot be invoked as the _deus ex machina_ of economic conflicts. There can be no reliance on the state to \\\\\\\\u2018balance\\\\\\\\u2019 the interests of creditors and industry and merchants. But there is a further, more critical, burden that falls to finance in the absence of a role of the state: _how to link the present to the future; how to give intertemporal coherence, and the sense that the circuits (or loops) of capital are reproducible over time. _This requires techniques to make the future imaginable, tangible and in some sense negotiable. This is the deepest (and broadest) sense in which finance must be collaborative. In a capitalist economy, the state\\\\\\\\u2019s monetary, fiscal and industry policies \\\\\\\\u2013 and not just in their technical mechanisms of economic management, but also in collective the cultural belief in the integrity of those policy institutions \\\\\\\\u2013 link tightly the present to the future. More than verified success, the system relies on a popular trust that the state knows what it is doing and will get it right or right enough. Mounting evidence of states not getting it right builds political vulnerability \\\\\\\\u2013 a space cryptoeconomics seeks to build on. Without this role of the state, and a propensity for financial disintermediation, cryptonetworks must build explicit different social mechanisms of collaboration to link the present to the future. The ECSA take on collaborative finance is based on this insight. For more see Dick Bryan (2023): The ECSA Take on Collaborative Finance.\\\");\\n       units.push(\\\"The ability to capitalize one\\\\\\\\u2019s wealth by putting one\\\\\\\\u2019s assets up as collateral is a key source of social and economic power in capitalism. The collateral question is really a question about who gets to determine what \\\\\\\\u201Cassets\\\\\\\\u201D are, and how they can be utilised for leverage. In the existing economic space workers\\\\\\\\u2019 primary asset - their labor power - is only collateral in the context of slavery: the capacity of the employer (owner) to use the worker as collateral; not the workers\\\\\\\\u2019 capacity to use what they are capable of as collateral. The collateral question is the financial version of \\\\\\\\u2018class\\\\\\\\u2019. In postcapitalist economic space, all agents can issue assets to be used as collateral and central amongst these will be stake: agents will use the stake they hold as collateral, and lenders can determine credit limits on the basis of the valuation of stake. The construction of a protocol for distributed determination of collateral is the key challenge to the current capitalist order. It is the centrepiece of our strategy for a distributed economic system.\\\");\\n       units.push(\\\"In the ECSA discourse, commodity includes all output produced for and recognized by a network. This is not Marx\\\\\\\\u2019s use of the term, which associates commodities with capitalist production relations. There, commodity production has two dimensions: it is extractive, in the sense that commodities are produced by the workers and owned by the capitalist, and produced to be sold for a profit. This latter emphasis gives rise to the term \\\\\\\\u201Ccommodification\\\\\\\\u201D, meaning more and more facets of social life turned into marketable opportunitsies for extraction. Our use of the term \\\\\\\\u2018commodity\\\\\\\\u2019 is more like Straffa (1960) in his book _Production of Commodities by Means of Commodities_. There, commodities are all produced outputs. They are produced for a market, but they are not exchanged for money. This gives space for our proposition that commodities can be produced for the commons (without a price). Similarly, there can be no suggestion that our use of the term commodity is subject to a \\\\\\\\u2018fetishism\\\\\\\\u2019 of commodities, developed by Marx at the end Chapter 1 of Volume I of _Capital_, for this term too, is capitalist-specific. In many analyses, the political response to fetishism is to take goods and services out of market relations. Our proposal is to change the nature of markets.\\\");\\n       units.push(\\\"Commodity tokens are issued by an economic agent on completion of an exchange. The token represents a right to a specific output (the \\\\\\\\u2018underlier\\\\\\\\u2019 it describes). Basically, a commodity token refers to a promise of someone to do something: it is a right to a future performance. In essence, it makes any informational event exchangeable. The commodity tokens transacted in the economic space protocol represent informational events that include, but are not limited to, the delivery of actual goods and services. The term \\\\\\\\u2018commodity\\\\\\\\u2019 means here any good or service (tangible or intangible) produced for, and validated by, the network. In a single commodity exchange, price is just one data event, with the potential statistical significance of other data events awaiting discovery within the network. Commodity transactions will be tied to credit issuance in a dynamic system of exchange. A commodity token verifying the creation of commodity value can be utilized to settle credit. Credit tokens and commodity tokens will therefore often be paired in clearing a ledger entry.\\\");\\n       units.push(\\\"Resources that have shared ownership and are built and curated in a distributed way. Particularly in a digital era performances and outputs are becoming commons compatible. Non-divisibility of outputs and (close to) zero marginal costs of production, as found in software and other digital goods, are all conditions for a commons. Commons attributes are everywhere: inside agents, between agents, and across and between networks. A propensity towards participatory common ownership is integral to a postcapitalist vision.\\\");\\n       units.push(\\\"The first distributed computational medium was most likely a network of bookkeepers and their ledgers bound together by their accounting practice, whether recording on clay, tablet, or paper. Even if such networks predate our current digital infrastructure by millennia, we think that they have given rise to it and are its ancestors. Computational networks with high informational capacities, bandwidth and connectivity are the new medium of our economic networks, hosting the record-keeping and the calculation historically undertaken by their primary forms. As a result, they have rendered the updates on our ledgers, our transactions, incredibly fast and incredibly vast. The ECSA vision is to open this computational media to the possibility of reprogramming the economic layer of computing by non-state and non-corporate actors \\\\\\\\u2013 making our economic communication networks programmable from below.\\\");\\n       units.push(\\\"Co-reference signals the referential relationships between utterances. It is the way discourses [a.k.a. performances i.e. series of events that follow each other] are formed: it creates the social history of discourse. Metapragmatic grammar is co-referential. It allows you to link one speech event to another. Co-reference builds upon the flow of indexical time through a past, present, and future. Each utterance signals its relationship to previous discourse through the rhythm of a discourse (the poetic function of meter) and through co-reference.\\\");\\n       units.push(\\\"Credit is essentially a system of IOUs that connect the present to the future and no economy can work without credit. Credit secures network liquidity, it bridges the intertemporal gap of production, and brings forward the capacities of agents to create that future. Because it is a system of IOUs it requires systemic trust, scale and collateral. The current world of institutional banking and finance perform these and other functions in a way that extracts wealth from, and imposes surveillance on, those who borrow and lend. The ability to charge interest as rent on money is based on the privileged right of certain agents in the system to issue and clear credit, and others not. In the economic space protocol every agent has the same rights to issue and clear. Such reciprocal credit network functions as a distributed payment and settlement system which does not require the external third party issuer of \\\\\\\\u201Cmoney\\\\\\\\u201D Credit is thus only about closing the intertemporal gap of production,it does not function as a store of value, and it is just used to settle and pay - but without needing the third party issuer. Such distributed credit issuance is different from centralized credit issuance because it is an agent-to-agent relationship (or more precisely, an agent-to-network-to-agent relationship). All agents have the capacity to offer and/or accept credit to/from other agents. This means that each agent is not just a producer, participating in performances, and an investor, staking other agents\\\\\\\\u2019 performances, but also a \\\\\\\\u2018bank,\\\\\\\\u2019 issuing and receiving credit. In contrast, centralized credit issuance is typically done by banks or other financial institutions that have the power to create money through fractional reserve banking. In the economic space protocol, credit gives an agent the right to amend the network ledger \\\\\\\\u2013 to match an offer and issue a token \\\\\\\\u2013 when that token is, in effect, provided by another agent. Credit is the key to liquidity because it enables agents to settle token transfers and maintain liquidity in the network. The issuance of IOUs also connects directly to issues of securing network liquidity. In the absence of centrally-issued money, and the associated capacities of a central bank to regulate liquidity, distributed issuance of credit performs money-like functions that must create and sustain liquidity. It is important to remember that credit is also in the economic space protocol still about taking a risk-position. The breakthrough in the economic space protocol is to connect credit to stake as the preferred collateral for reciprocal issuance of credit. It provides credit a material and expandable foundation through which credit issuance, risk assessment and management takes place. More see Beller, Bryan, Lee, Lopez & Virtanen (2019): Rethinking Money and Credit in  Cryptoeconomy: Securing Liquidity without the Central Control of Issuance.\\\");\\n       units.push(\\\"We think of cryptoeconomics as the economics of the hidden, i.e., of the social and informational relationality of value production. From the Greek _kryptos_ (hidden, concealed, secret).\\\");\\n       units.push(\\\"One of the most difficult things to understand about the cryptoeconomy is that it has a potential to cause an irreversible change in the economy itself: it has the power to turn the economy and its key conventions in themselves into a place of creation. Yet if you look at what is mostly going on in cryptoeconomics and decentralized finance you\\\\\\\\u2019ll immediately recognize the implicit embrace of the conservative economics orthodoxy of what is money, what are markets, what is credit used for, what accepted as collateral and what incentives give the best social outcomes. We think it is this orthodoxy that is blocking the real potentiality of the emerging distributed computational substrate. That is why we have been especially focusing on re-thinking the economic component of cryptoeconomics: what exactly becomes economically and politically possible when our economic-organizational composition becomes bounded only by our creativity (when it becomes a software design question)? We want to unlock the potentiality of distributed computation by a new understanding of economy as a programmable network: a group of agents interacting according to a shared understanding about the relations that make the network, its state and how it changes - opening its interaction protocols as a design and expression space for everyone. If you ask what is that new thing that the native properties of the emerging p2p networking technologies are making possible, our answer is: postcapitalist economic media. It is a more expressive medium to describe our economic networks, their participants, the nature of their relations and how they change, what they value, how it is counted and exchanged.\\\");\\n       units.push(\\\"\\\\\\\\u2018One last dangerous game\\\\\\\\u2019, says Dolores to herself in the emptied world at the smoking end of four seasons of _Westworld_ tragedies. What is that game? The series does not tell us, but ECSA is proposing one: a new form of economic intelligence and value-computing. Measures that do not collapse the qualitative concerns for well-being and being-with of those who currently are subjects of and subject to racial capitalism. A way to allow for the expression and persistence of qualitative values on a computational substrate, an economic medium, such that these values are capable of (collectively) organizing economy. This proposed re-organization of value production and thus also of sociality requires a re-casting of what we today think of as the real or natural economic forms indexed under notions including \\\\\\\\u2018equity\\\\\\\\u2019, \\\\\\\\u2018credit\\\\\\\\u2019 and (productive) \\\\\\\\u2018labor\\\\\\\\u2019. These traditional terms have been decomposed, grasped as social arrangements, and recomposed such that new conceptualizations and new types of actions and inflections \\\\\\\\u2013 new socialities \\\\\\\\u2013 become possible, while undervalued and marginalized traditional forms of sociality might thrive. In the ECSA operation, the protocols for constituting and holding equity become those for the distributed sharing of stake and thus for collectivizing risks and returns. The protocols for bank credit and monetary issuance become protocols for the peer-to-peer issuance of credit and for peer-to-peer credit clearing that is interoperable through a network of peers. The protocols for the organization of labor become protocols for the distributed assemblage of \\\\\\\\u2018performances\\\\\\\\u2019. Unitss of account become qualified measures and indices, devoted to the emergence of interoperable qualitative values. Economy moves from stranger-based to interpersonal to collective; the imperial organization of commodities by the accumulation of capital becomes the collection organization of sociality by all. Through this process of deconstruction and recomposition of actual and social computing, ECSA has developed a political-economic, computational strategy; a \\\\\\\\u2018play\\\\\\\\u2019, for economics and for futurity, in what may well be the \\\\\\\\u2018one last dangerous game\\\\\\\\u2019. It is dangerous not only because of the current conditions on planet Earth, but because ECSA_ _accepts aspects of the power of the value form and of economic calculus to organize societies at scale. Even as we recognize the necessity for constellations of qualified local inputs that can persist on an economic substrate, we accept the need for large scale organization, economic interoperability and network-specific unitss of account. We actually propose that \\\\\\\\u2018economy\\\\\\\\u2019 needs to become more granular and more generalized. What needs to be altered is _what_ the controls are, _who_ has access to them, and the kind of literacy and feedback they require. For more, see Jonathan Beller (2023): _On Economic Intelligence_.\\\");\\n       units.push(\\\"A market needs to have two prices. A dealer makes the market by creating the inside spread, the spread that appears as \\\\\\\\u201Cthe market\\\\\\\\u201D. The dealer collects the inside spread. And crosses the outside spread. The dealer model of providing liquidity is very different from the lender model. In the dealer model, the dealer function provides agents with the capacity to demand to transact or to transact in desired directions at desired times. The dealer is that whom/which accommodates the demand to transact without demanding it itself.\\\");\\n       units.push(\\\"Debt is a liability on the balance sheet of one agent held as an asset on the balance sheet of another. Credit is a special case of debt, in which two agents expand their balance sheets by issuing one another off-setting debts that can later be cleared. To the extent that credit fails to clear, it leaves debt as a residue, which must either be rolled over or closed out with a transfer of real balances (outside money or collateral). In financial capitalism the growth in the forms of indebtedness is the condition and strategy for capital accumulation, just like expansion of labor force participation, was for expanding commodity production. Our collective capacity to assume debt and pay taxes and be the direct bearer of austerity measures create direct vehicles for financial asset accumulation. The increasing supply of government bonds is possible only through deficit cuts and excluding all inflationary spending. This is like the financial equivalent of raw material for industrial production. In financial economy the surplus is extracted more directly from this collective capacity to become more indebted and pay taxes than from the stagnating number of people employed in goods and services production.\\\");\\n       units.push(\\\"DeFi has so far introduced \\\\\\\\u2018stablecoins\\\\\\\\u2019 as mechanisms for token exchange rate stability with respect to fiat currencies and pooling mechanisms for stabilizing token prices; and, more recently, also decentralized banking and insurance protocols: that assets need not lie idle, but can be mobilized for borrowing and lending, with mechanisms of insurance offered on the side. Lending is then giving rise to the potential for leverage: borrowing in order to take positions in markets. That, in turn, is opening up issues like collateral requirements with margin calls and default risk. Predictably, we are seeing next the issuance of derivative financial products like credit default swaps (CDS) and collateralized debt obligations (CDO) designed to on-sell default risk from those who wish to avoid it to those prepared to carry it for a fee. These developments have the hallmark of the sorts of derivative products being traded in the lead-up to the 2007 global financial crisis. Whether they are pointing to crypto\\\\\\\\u2019s \\\\\\\\u2018Minsky moment\\\\\\\\u2019 is the question, for the products themselves were never the source of crisis; it was their governance, expressed in pricing models and the conditions of access to leverage they were built upon. It is not surprising that the emergence of cryptoderivatives and a focus on DeFi governance are emerging concurrently. In fact, historically speaking decentralized finance is redundant: finance has been historically decentralized. The problem is that financial instability leads financial markets to self-organize governance institutions, which then get taken over by the state. For example, the US had a private clearinghouse acting as a de facto central bank before this facility was essentially taken over by the government. The bankers organized it because they needed it. We are interested in moving from DeFi to social derivatives: to using finance to create different socialities, which always means different governances.\\\");\\n       units.push(\\\"Decolonising finance means the necessity of financial protocols to become the focus of democratic demands. Yet it is very different to DeFi: decolonisation means unmaking the naturnalness of dominating principles of rule (the protocols) and the mostly unconscious embrace of terms of exchange that are uneven and unequal but encasing forms of economic and financial association, communitsy and selves. Decolonisation is never a straightforward question of escape (like we\\\\\\\\u2019ve learned from Franz Fanon, the colonised _desire_ their colonisation and hate the decolonised), but rather of reappropriating the capacity of assembly, of affinity, of association, of value giving circulation - that capital & finance claim to belong to them. Decolonisation means reorienting the principles (the protocols) by which people rule their own movements & how they value these associations on their own terms. ECSA is decolonising finance.\\\");\\n       units.push(\\\"Deconstruction moves grammar from identifying signs against the truth into infinite semiosis, where every sign is a translation of a sign with a previous sign into a mode that is slightly different. Metapragmatic grammar assumes deconstruction which is a technical way of looking into the relationships each speech event has with another.\\\");\\n       units.push(\\\"ECSA is approaching decision-making, and thus human behavior and subjectivity, in a different way than usual in economics, game-theory and finance. The roots of the decision-making model in finance lie in the axiomization of expected utility in Von Neumann and Morgenstern\\\\\\\\u2019s _A Theory of Games and Economic Behavior,_ which relied upon lotteries to differentiate between the strength of preferences (i.e., the quantitative measurement of desires) and beliefs about the likelihood of outcomes. Since this was in the first chapter of a book that would provide the formal foundations for game theory, expected utility theory and game theory became the way to analyze human action. In the hands of e.g. Donald Davidson, it would provide the framework for his work in the philosophy of action and language (the \\\\\\\\u201Cbelief-desire\\\\\\\\u201D model now dominant in the analytic philosophy of action) and in the hands of John Rawls and Robert Nozick, it would frame contemporary discussions in moral philosophy \\\\\\\\u2013 with Rawls providing the liberal side of neoliberalism and Nozick its libertarian counterpart. It\\\\\\\\u2019s hard to overestimate Rawls\\\\\\\\u2019 and Nozick\\\\\\\\u2019s influence in defining the parameters of moral theory to this day; Rawls provided the now classic argument for distributive justice while Nozick made libertarian thought philosophically acceptable. The game theoretic model becomes \\\\\\\\u201Cdecision-making under uncertainty\\\\\\\\u201D in economics and finance, and expected utility theory is a fundamental presupposition of portfolio theory and most of finance; indeed, early portfolio was cluttered with \\\\\\\\u201Cindifference curves\\\\\\\\u201D and \\\\\\\\u201Cinterpersonal comparisons of utility\\\\\\\\u201D until the development of the Capital Asset Pricing Model (CAPM), which demonstrated that with a small set of assumptions, everyone would pick the same portfolio, i.e., the market portfolio, and one could jettison indifference curves. Binomial trees, perhaps the most popular way of pricing options, are usually interpreted as \\\\\\\\u201Cdecision-trees\\\\\\\\u201D reinforcing the notion that market-making could be analyzed by a decision-making model. However, there is also a different tradition of thinking about decision-making and human action. It includes \\\\\\\\u0022thinking\\\\\\\\u0022 that is driven by affect and emotions, pointing to a different model of subjectivity than \\\\\\\\u0022punctual decision-making under uncertainty\\\\\\\\u0022. It is present for example in Henri Bergson\\\\\\\\u2019s discussion of qualitative magnitudes and the pre-quantitative modulation of intensities in affects, feelings, and emotions, where a very different model emerges \\\\\\\\u2013 speaking of affects and feelings as acting like waves, \\\\\\\\u201Cswamping\\\\\\\\u201D or \\\\\\\\u201Ccarrying us away\\\\\\\\u201D in their turbulence. The basic model for affects is what Mihaly Csikzentmihalyi has called \\\\\\\\u201Cflow\\\\\\\\u201D This \\\\\\\\u0022flow\\\\\\\\u0022 tradition, that can be traced back to Spinoza, is that affect and emotions are \\\\\\\\u0022wave-like\\\\\\\\u0022 and flow is an affective \\\\\\\\u0022peak\\\\\\\\u0022 experience of effortless concentration in which one loses sense of time. Bergson, for example, insists that subjective experience is mediated by time in the form of _duration_ \\\\\\\\u2013 the flow of time from the present to the past and future. This differs from the \\\\\\\\u0022empty, homogenous\\\\\\\\u0022 time of mathematics and science, in which all events are supposed to take place. In linguistics, calendar time is contrasted to indexical time, i.e., tense in the form of past, present, and future. Temporal reference shifts with every event of speaking, and is logically intensional, as are verbs of thinking, feeling, and speaking and modality (necessity and possibility). Logic, mathematics, and science are logically extensional which means that substitution of identities doesn\\\\\\\\u2019t change truth value. But we could say, in a language that Bergson wouldn\\\\\\\\u2019t have used, that in fact subjectivity and indexicality are both logically intensional. If we combine the intensionality of intentionality with the intensionality of indexical time, we provide intentional states with an intensional temporal dynamic; the indexicality of time in the form of duration (the flow time from past to present and future and vice versa) provides the dynamics for subjectivity \\\\\\\\u2013 represented in verbs of thinking, feeling, and speaking. We start to see a path starting with everything being in motion and having a basic volatility, which is then transformed into \\\\\\\\u0022images\\\\\\\\u0022 by perception that are made interpretable and meaningful by the passage of time, especially memory. Resonance represents the sympathetic alignment of subjectivities, which are stimulated by mutual \\\\\\\\u0022intunement\\\\\\\\u0022. Because for Bergson all matter is in motion and vibrating, it\\\\\\\\u2019s not hard to see him as providing an account of subjectivity that is compatible with volatility. We think \\\\\\\\u201Crational decision-making under uncertainty\\\\\\\\u201D is far too narrow and restricted framework to understand and model our behavior, and it must be exploded to include wave-properties of the flow-model of affect that interacts with the decision-making model in situations such as this following discussion of market-making by Elie Ayache (2008: 36-37): \\\\\\\\u201CThrough the dynamic delta-hedging and the anxiety that it generates (Will I execute it right? When to rebalance it, etc.), the market-maker penetrated the market. He penetrated its volatility and he could now feel it in his guts. In a word, he became a dynamic trader. He now understood \\\\\\\\u2013 not conceptually, but through his senses, through his body \\\\\\\\u2013 the inexorability of time decay, the pains and joys of convexity\\\\\\\\u201D \\\\\\\\u201CDelta-hedging,\\\\\\\\u201D \\\\\\\\u201Ctime decay,\\\\\\\\u201D and \\\\\\\\u201Cconvexity\\\\\\\\u201D are technical terms that refer to different aspects of the Black-Scholes formula for pricing options, which presupposes all the apparatus of von-Neumann-Morgenstern expected utility theory. In the act of trading each of these quantitative terms are associated with particular affects \\\\\\\\u2013 \\\\\\\\u201Canxiety,\\\\\\\\u201D \\\\\\\\u201Cinexorability,\\\\\\\\u201D \\\\\\\\u201Cpains and joys\\\\\\\\u201D \\\\\\\\u2013 that are felt by the trader \\\\\\\\u201Cin his guts.\\\\\\\\u201D Trading brings together a quantitative dimension compatible with the expected utility and decision theory and a qualitative dimension that is more describable in terms of the ebb and flow (\\\\\\\\u201Cmodulation\\\\\\\\u201D of affective intensities rather than any form of decision-making. Ayache\\\\\\\\u2019s description portrays market-making not in terms of rational decision-making, but in affective terms that would fit extreme sports, a not surprising choice, as traders often describe trading as \\\\\\\\u201Csurfing the volatility wave.\\\\\\\\u201D Trading is less like a decision-making process than a \\\\\\\\u201Cflow experience\\\\\\\\u201D that is shared among expert practitioners such as musicians, dancers, athletes, and traders. In this ethnographic description by Caitlin Zaloom of open outcry in the pits of the Chicago Commodities Exchange, moments of decision-making \\\\\\\\u201Cride\\\\\\\\u201D upon the ebb and flow of socially shared affects (Out of the Pits, 2006:135): \\\\\\\\u201CTraders speak of their best trading moments in ways that make them sound like mystical engagements. They need to abandon self-consciousness to gain full access to the market\\\\\\\\u2019s interior and use discipline to block outside contexts from their conscious thoughts and to enhance their abilities to read, interpret, and ultimately merge with the market. Traders often speak of being \\\\\\\\u201Cin the zone\\\\\\\\u201D or of a \\\\\\\\u201Cflow\\\\\\\\u201D experience. In the zone, economic judgments and actions seem to come without effort from the instincts of the trader. The market and the trader merge, giving him special access to the natural rhythms of financial fluctuations.\\\\\\\\u201D Our wager is that the economic space protocol turns the individual punctual event of decision-making more into an experience of an aggregate behavior that \\\\\\\\u0022flows.\\\\\\\\u0022 See Economic intellect.\\\");\\n       units.push(\\\"Derivative means generally a financial exposure to movements of an index (predominantly but not exclusively price), but without necessarily ownership of the underlier to which the index refers. They therefore price risk, and enable all risks to be compared. Derivative contracts differ according to the sort of exposure attached to an index. In other words derivatives are contingent claims. They open a temporal gap in which something may happen, and their value depends then on what happens in that gap. ECSA is moving from a definition of derivative as a \\\\\\\\u201Cself-executing contract that reduces counterparty risk\\\\\\\\u201D (Ethereum white paper) to understanding a derivative as a sensitivity to changes or a relationship between co-text and context: we understand derivatives as an ongoing ability to isolate co-text from context, to turn co-text into something useful for measuring. This is a very different sense of \\\\\\\\u201Csmartness\\\\\\\\u201D in derivatives. We think they have a social logic. See Social Derivative. And Ben Lee: Token as a Derivative and a Gift.\\\");\\n       units.push(\\\"Also known as a composite agent, synthetic agent, collective agent, i.e., an agency. See Agency.\\\");\\n       units.push(\\\"A failed revolution. Social media horizontalized our communication, but left the information and protocol layer called the economy untouched.\\\");\\n    }\\n    function set(uint256 location, string calldata _unit) external {\\n        units[location] = _unit;\\n    }\\n    function getById(uint256 location) external override returns (string memory unit) {\\n        return units[location];\\n    }\\n\\n}\"\r\n    }\r\n  },\r\n  \"settings\": {\r\n    \"optimizer\": {\r\n      \"enabled\": false,\r\n      \"runs\": 200\r\n    },\r\n    \"outputSelection\": {\r\n      \"*\": {\r\n        \"*\": [\r\n          \"evm.bytecode\",\r\n          \"evm.deployedBytecode\",\r\n          \"devdoc\",\r\n          \"userdoc\",\r\n          \"metadata\",\r\n          \"abi\"\r\n        ]\r\n      }\r\n    },\r\n    \"libraries\": {}\r\n  }\r\n}}", "ABI": "[{\"inputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"constructor\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"location\",\"type\":\"uint256\"}],\"name\":\"getById\",\"outputs\":[{\"internalType\":\"string\",\"name\":\"unit\",\"type\":\"string\"}],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"location\",\"type\":\"uint256\"},{\"internalType\":\"string\",\"name\":\"_unit\",\"type\":\"string\"}],\"name\":\"set\",\"outputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"\",\"type\":\"uint256\"}],\"name\":\"units\",\"outputs\":[{\"internalType\":\"string\",\"name\":\"\",\"type\":\"string\"}],\"stateMutability\":\"view\",\"type\":\"function\"}]", "ContractName": "UnitStorage33", "CompilerVersion": "v0.8.4+commit.c7e474f2", "OptimizationUsed": "0", "Runs": "200", "ConstructorArguments": "", "EVMVersion": "Default", "Library": "", "LicenseType": "", "Proxy": "0", "Implementation": "", "SwarmSource": ""}