{"SourceCode": "{{\r\n  \"language\": \"Solidity\",\r\n  \"sources\": {\r\n    \"contracts/storage/IStorage.sol\": {\r\n      \"content\": \"pragma solidity ^0.8.4;\\n// SPDX-License-Identifier: GPL-3.0-or-later\\n\\n// https://soliditytips.com/articles/solidity-interface-interact-with-other-contracts/\\ninterface IStorage {\\n    function getById(uint256 id) external returns (string memory unit);\\n    // Add more function signatures as needed.\\n}\"\r\n    },\r\n    \"contracts/storage/unit/UnitStorage36.sol\": {\r\n      \"content\": \"     \\npragma solidity ^0.8.4;\\n// SPDX-License-Identifier: GPL-3.0-or-later\\nimport \\\"../IStorage.sol\\\";\\n\\ncontract UnitStorage36 is IStorage{\\n    string[] public units;\\n    \\n    // set to onlyOwner()\\n    // check if value exists - \\n    constructor(){\\n        // 674\\n       units.push(\\\"It is important to recognize the current hierarchy of the money system. The first layer is a horizontal circuit of the private or inside money system: the expansion and contraction of balance sheet leverage, the circuit that obtains between correspondent bankers, or in our case, economic agents. The second one is the fiscal circuit of the state or outside money system: the ex nihilo creation of nominal money pegged to the units of account in which disputed contracts are enforced; and, optionally, the units in which taxes are received. The design problem for ECSA is: how do we extricate ourselves from the second circuit and replicate its functions within the first circuit, in such a way that both stability and justice are endogenously produced. The secondary problem is to explain how the monetary system hooks into the real metabolic activity of the economy. Thanks to Colin Drumm for making this challenge explicit.\\\");\\n       units.push(\\\"Issuance means the creation of new money, securities (stocks, bonds, notes, debentures, bills, derivatives) or tokens. In the legacy financial system, issuance is undertaken by banks in the case of money, and other legal balance sheet entities in the case of securities (corporations, trusts, governments). The economic space protocol says that any economic agent can be an issuer, so long as the network trusts the issuance. The key question is: what underwrites the \\\\\\\\u201Cnegotiability\\\\\\\\u201D of the issued instruments in a distributed system? In the economic space protocol this question of risk and negotiability is dealt with stake. See Stake.\\\");\\n       units.push(\\\"The navigator-steerman-guide. The new meaning of governance. See Navigation. See Governance.\\\");\\n       units.push(\\\"Why do we use a language framing? We think that with it we can express the capacity of a network to define itself as an agent and to redefine itself. Language framing reveals the economic protocol as a communication agreement: a capability to create new spaces and agents through conversation. Language framing also emphasises that governance is not about structures, but about expressions, who can express and what. And the framing also reveals the symmetricity in our approach: by sharing a language, everyone can have an equal capacity of economic expression, by which they can start to define roles, make agreements about sublanguages etc. VS. the predefined roles of the server-client model.\\\");\\n       units.push(\\\"Liquidity is an intensive economic property. It is a power to demand to transact. In other words, it is about messaging capability: being liquid means being able to message, to link, to issue and receive messages and to be listened to when you want. Liquidity tells what kind of a membership capacity one has in the network. What counts as liquidity and who decides this, is one of the key questions defining capitalism as a financial system. In capitalism liquidity is governed by the state, the banking system it superintends, and the money it endorses. When only those state-approved agents can issue, then a liquidity premium (a rate of return on money) can be charged for the risks involved in holding illiquid assets. Right now, governments and central banks are spending many billions of dollars/euros a month to maintain liquidity in asset markets: Asset market liquidity is now directly dependent on state funding: liquidity has become a \\\\\\\\u2018public good\\\\\\\\u2019. Furthermore, liquidity means at the moment keeping stock prices high, banks profitable and firms profitable (this is where, and why, we see current monetary and fiscal policy directed). Liquidity doesn\\\\\\\\u2019t link to the environment, scientific research or social welfare, or to a viable art communitsies \\\\\\\\u2014 indeed, with a fiat units of account, these must be sacrificed to secure fiat liquidity. Is this sustainable? Can central banks ever sell the trillions of dollars of private assets they now hold? Will governments ever pay down the fiscal deficits they have accumulated? Are there limits to the market/public acceptance of state money printing that underlies these state fiscal and monetary positions? And what happens when that limit approaches? Postcapitalist economic space challenges this hegemony as the source of money issuance, proposing instead distributed issuance (everyone can issue) amongst agents in a network. Where all agents can issue, there need be no rent on money. This doesn\\\\\\\\u2019t make liquidity costless, but it can be backed by stake (risking-together around other values) rather than the power of issuance and the transference of risk. Stake, or risking-together around other values, becomes the \\\\\\\\u2018complement\\\\\\\\u2019 of liquidity, giving the notion of ownership a very different meaning from its application in capitalism. The capacity to create liquidity (based on a capacity to issue and accept offers) is a foundational primitive of the new economic space.\\\");\\n       units.push(\\\"Illiquidity.\\\");\\n       units.push(\\\"A fear that the market won\\\\\\\\u2019t be there. It is fundamental to understand that the market cannot be assumed. It is not a free good. The price I have to pay for using the market is the liquidity premium. That is why collateralized assets are valued always \\\\\\\\u201Cat a haircut\\\\\\\\u201D Collateralization is the process by which some asset is pledged as security for the non-performance of a debt contract. In relation to collateralization, _risk_ is the real possibility that the value of an asset may change, either up or down, in the future. _Haircut_ is the difference between an asset\\\\\\\\u2019s present asking price in the market and the price at which it is valued for the purposes of collateralization and in light of its risk; or, in other words, the difference between the price at which it can be currently liquidated and the value at which it can be borrowed against. See Dealer function.\\\");\\n       units.push(\\\"Liquidity token brings the units of exchange to life as more than a passive numeraire mediating the valuation of other tokens. It becomes a units of distributed issuance of credit and comes into being through a collateralized credit agreement. This means credit issuance effectively appears as automated. This token is redeemed on demand for any token on offer by an economic agent.\\\");\\n       units.push(\\\"The ECSA project is designed to open a spread between capitalist and post-capitalist futures. We try to use capitalism\\\\\\\\u2019s historically consolidated capacities (which actually are _our_ capacities), including the power of financial instruments and computing, to wager on postcapitalist outcomes. Contrary to capitalism, ECSA\\\\\\\\u2019s arbitrage on intelligence is to reduce the cost to the planet for collective re-imagination and re-organization, while also collectivizing the returns on the benefits of creating more convivial forms of life. By utilizing the accumulated knowledge implicit in financial instruments and computing derived from, but not beholden to, capitalism, we are creating a grammar for postcapitalist economic expression. We believe that a clear spread will open between what the old and the new economic grammar make possible - there is a clear difference in their expressive capacity, accessibility, stability, adaptability, scalability, privacy, functional equality and programmability. Now, besides politically and technically, we can frame this as a spread also financially. Investing in the creation of new economic grammar is trading the spread, taking a long position of an alternative to capitalist modes of valuing. But we also depict it as a short position: those who recognize pointers to capitalism\\\\\\\\u2019s loss of legitimacy may want to place a bet against it. Bitcoin may be a short position on capitalist money. But the ECSA token offers a short position on the capitalist economy and culture. The ECSA token holders retain the option to support the build-out of postcapitalism or cash out. We call this \\\\\\\\u201Cliving in the spread.\\\\\\\\u201D Can you afford to risk building a different economy; can you afford not to risk building one? Full financialization has made precarity and risk part of life. The ECSA token allows us to meaningfully risk together on a different future because it helps us build it.\\\");\\n       units.push(\\\"Like money, market is a \\\\\\\\u201CLayer 1\\\\\\\\u201D economic interoperability protocol. It is made of offer, matching, netting, and clearing protocols that its agents must adopt to interoperate as a coherent whole. In other words, it is an economic communication network. It is a space of communication and exchange that structures the space of possibilities for interactions and for the economic properties of the objects populating such spaces. We are market makers. We want to make markets \\\\\\\\u2013 give structure to a space of exchange and communication \\\\\\\\u2013 for performances organized around different collectively defined values. In the economic space protocol, those who participate in markets are agents who interact in a network and, through their interactions, create economic space. In these markets, prices are disconnected from the presumption of pursuit of profit and instead express unitss of collectively-defined network value. Transactions are confirmed by the transfer of tokens on a network ledger, rather than exchanges of \\\\\\\\u201Cmoney\\\\\\\\u201D.\\\");\\n       units.push(\\\"Market is a space of exchange and a space of communication. ECSA is making a market for new performances organized around different collectively defined values. It means both creating new \\\\\\\\u201Cmarkets\\\\\\\\u201D and re-engineering \\\\\\\\u201Cmarket\\\\\\\\u201D itself. It means structuring in a new way the space of possibilities for economic properties of objects populating such space: giving structure to a space of exchange (the space of possible).\\\");\\n       units.push(\\\"Marshall McLuhan (1964) famously said: The message of any new medium is the change of scale or pace or pattern it introduces to human affairs. We ask: What is the message of economic media? What change of scale or pace or pattern it introduces to human affairs?\\\");\\n       units.push(\\\"A more fundamental understanding of the communication situation than the contract model and the efficient market model. Metapragmatic grammar reveals market as a protocol and that protocol is not a market: it is the grammar that links, not the market. Metapragmatic grammar redefines what a distributed system is: a whole defined by the changing relationship of its parts, which does partitioning by indexing, and does not have to choose between consistency and a fork. The function of a metapragmatic grammar is to navigate how individual transactions/speech events translate from a different space-time. The \\\\\\\\u201Cmeta\\\\\\\\u201D of the contextual pragmatic interactions here is (meta-pragmatic means \\\\\\\\u201Cabout pragmatic\\\\\\\\u201D) that any speech event has a segmentation of its pragmatic so that it can translate parameters of that indexical speech event into a system that allows one to translate across all events. The ECSA economic grammar uses certain parameters in all events to do this (to offer, match, net, clear i.e. make them liquid). Metapragmatic rules allow pragmatic speech events to become grammatical and interpretable by everybody that speaks the language.\\\");\\n       units.push(\\\"Metapragmatics is the space-time navigational agreement for the networks of agents. In linguistics, metapragmatics is used to describe a function of language that takes its own pragmatics or contextualized indexical functions as its object. The metapragmatic functions allow language to become self-reflexive and they are built into the structure of language. They allow you to build a shared memory with no central coordinator (a global mutable shared state, a one single agent with a global view, etc.), when everything is relative to the speech event, when you need to refer to someone in the past in the future (in a different space-time), and be able to allow multiple agents declare something into existence (a performative).\\\");\\n       units.push(\\\"Not a valid form of issuance in the economic space protocol, where every agent in the network can issue and what is issued is always both an asset and a liability.\\\");\\n       units.push(\\\"Modern monetary theory thinks that governments which are the monopoly issuers of currency in which their debt is denominated, can print as much money as they need and have no need to tax or borrow to finance spending.\\\");\\n       units.push(\\\"Money is the asset with the most liquidity or the smallest spread in the economy. It means it is not a thing, but a system, a system of relations: the monetary system is in reality composed of an assemblage of different things which have been grouped together under the name \\\\\\\\u201Cmoney\\\\\\\\u201D. Historically money does not arise from exchange, but from the taxing and funding activities of states. Furthermore, not all money is the same. When Perry Mehrling says \\\\\\\\u201Call banking is just a swap of IOUs\\\\\\\\u201D, this is exactly what he means: all money is not the same, all money is somebody\\\\\\\\u2019s promise to pay, all moneys are different instruments, their value depends on who you are what you can do in the network: what is behind the IOU. All moneys are in this sense social relations, social contestations.The illusion that all money (for example all Unitsed States Dollars) is equally money is maintained by monetary authorities during the \\\\\\\\u201Cnormal\\\\\\\\u201D operation of monetary systems. It means that the nature of the monetary system as an outcome of a social struggle (who are you, what can you do in the network) is erased: money is \\\\\\\\u201Cput out of the question\\\\\\\\u201D in the sense that the configuration of the monetary system is taken off the table as an object of political negotiation and contestation. But during monetary crisis, money is \\\\\\\\u201Ccalled into question\\\\\\\\u201D in that the differences between different moneys leaps onto the table \\\\\\\\u2013 the difference between good moneys and bad moneys, the difference between the money of the rich and the money of the poor \\\\\\\\u2013 and money itself, and the constitution of the monetary system, enters again to the political imagination as an object of intervention and as a vehicle for the pursuit of justice. And that is what we want to do: we want to call it into question and reengineer its protocols. So that it cannot be put away from the table. Money is, itself, a site of political struggle. Special thank you to Colin Drumm for his work on this, for more see Colin Drumm (2022): The Difference that Money Makes.\\\");\\n       units.push(\\\"Keynes emphasized that money, as a convenient means of exchanging, is not something neutral and transitory in its effects. According to him (1933, pp.408-9), \\\\\\\\u201Can economy, which uses money but uses it merely as a neutral link between transactions in real things and real assets and does not allow it to enter into motives or decisions, might be called [...] a real exchange economy. [...] In contradistinction to this, with an economy in which money plays a part of its own and affects motives and decisions and is, in short, one of the operative factors in the situation, so that the course of events cannot be predicted, either in the long period or in the short, without a knowledge of the behaviour of money between the first state and the last state. And it is this which we ought to mean when we speak of a monetary economy.\\\\\\\\u201D\\\");\\n       units.push(\\\"Capitalism is a monocracy of value. It and its theologians can recognize only one value like one true church with one true God.\\\");\\n        //692\\n    }\\n    function set(uint256 location, string calldata _unit) external {\\n        units[location] = _unit;\\n    }\\n    function getById(uint256 location) external override returns (string memory unit) {\\n        return units[location];\\n    }\\n\\n}\"\r\n    }\r\n  },\r\n  \"settings\": {\r\n    \"optimizer\": {\r\n      \"enabled\": false,\r\n      \"runs\": 200\r\n    },\r\n    \"outputSelection\": {\r\n      \"*\": {\r\n        \"*\": [\r\n          \"evm.bytecode\",\r\n          \"evm.deployedBytecode\",\r\n          \"devdoc\",\r\n          \"userdoc\",\r\n          \"metadata\",\r\n          \"abi\"\r\n        ]\r\n      }\r\n    },\r\n    \"libraries\": {}\r\n  }\r\n}}", "ABI": "[{\"inputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"constructor\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"location\",\"type\":\"uint256\"}],\"name\":\"getById\",\"outputs\":[{\"internalType\":\"string\",\"name\":\"unit\",\"type\":\"string\"}],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"location\",\"type\":\"uint256\"},{\"internalType\":\"string\",\"name\":\"_unit\",\"type\":\"string\"}],\"name\":\"set\",\"outputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"\",\"type\":\"uint256\"}],\"name\":\"units\",\"outputs\":[{\"internalType\":\"string\",\"name\":\"\",\"type\":\"string\"}],\"stateMutability\":\"view\",\"type\":\"function\"}]", "ContractName": "UnitStorage36", "CompilerVersion": "v0.8.4+commit.c7e474f2", "OptimizationUsed": "0", "Runs": "200", "ConstructorArguments": "", "EVMVersion": "Default", "Library": "", "LicenseType": "", "Proxy": "0", "Implementation": "", "SwarmSource": ""}