{"SourceCode": "{{\r\n  \"language\": \"Solidity\",\r\n  \"sources\": {\r\n    \"contracts/storage/IStorage.sol\": {\r\n      \"content\": \"pragma solidity ^0.8.4;\\n// SPDX-License-Identifier: GPL-3.0-or-later\\n\\n// https://soliditytips.com/articles/solidity-interface-interact-with-other-contracts/\\ninterface IStorage {\\n    function getById(uint256 id) external returns (string memory unit);\\n    // Add more function signatures as needed.\\n}\"\r\n    },\r\n    \"contracts/storage/unit/UnitStorage20.sol\": {\r\n      \"content\": \"     \\npragma solidity ^0.8.4;\\n// SPDX-License-Identifier: GPL-3.0-or-later\\nimport \\\"../IStorage.sol\\\";\\ncontract UnitStorage20 is IStorage{\\n    string[] public units;\\n    \\n    // set to onlyOwner()\\n    // check if value exists - \\n    constructor(){\\n        //365\\n       units.push(\\\"However, this is not the full surplus. The definition above is the aggregate of private surpluses. We must also recognize the possibility that the network overall is more than the sum of its parts: that the whole network is a performance, and hence a potential source of surplus. The formalization of this collective dimension must await the analysis of the total network. But it is important to emphasize the muti-dimensionality of that surplus, associated with the multi-dimensionality of network value.\\\");\\n       units.push(\\\"Our framing of the network surplus, especially as the spread between the costs of performances and the outcomes of performances (including the new economic space performance) comes close to what Brian Massumi has called in his \\\\\\\\u2018_99 Theses_\\\\\\\\u2019 \\\\\\\\u2018processual surplus value\\\\\\\\u2019 or the \\\\\\\\u2018surplus-value of life.\\\\\\\\u2019 Massumi\\\\\\\\u2019s Thesis 16 states: \\\\\\\\nMarx\\\\\\\\u2019s definition of surplus-value hinges on the labor theory of value, according to which value is the quantity of labor-time that is \\\\\\\\u2018congealed\\\\\\\\u2019 in the product. Processual surplus value . . . is purely qualitative and concerns the intensity of lived potentials. It is surplus-value of life. Capitalist surplus-value and processual surplus-value are, of course, related, but they cannot be equated. The former is the systemic capture of the latter. Their difference\\\\\\\\u2014the difference between quality of activity as such and the derivation from it of a quantitative yield\\\\\\\\u2014is internalized by the system, to serve as its driving force. (2018: 16)\\\");\\n       units.push(\\\"And elsewhere, by way of summary, the \\\\\\\\u2018surplus value of life\\\\\\\\u2019 is: \\\\\\\\nan experienced value that is its own value, worth it for itself. This is a purely qualitative value. It is as incomparable as the timbre of a particularly pellucid note of music or the saturation of a breath-taking color. It is incommensurable, unexchangeable. It is such as it was, all and only that, and nothing more than how it was lived. It can be pursued on the smallest or most macro of scales, beginning from right where one is. No need to wait for the correct, final analysis (which will never come) before jumping in. No need for the end-all up front (which will never happen). Any and every moment can yield surplus-value of life, provided the moment is intensely lived. (2018: 91)\\\");\\n       units.push(\\\"The concept of surplus we are working with has some close parallel with what Massumi\\\\\\\\u2019s idea of processual surplus value is reaching for, because value is determined by the processes of the network. But for Massumi, it is critical that the surplus-value of life is unquantifiable. Thesis 5 states that: \\\\\\\\nThe first task of the revaluation of value is to uncouple value from quantification. Value must be recognized for what it is: irreducibly qualitative. (2018: 4) \\\\\\\\nQuantification, he believes, draws surplus back to the capitalist world of commodity production, at least until the concept of value can be reclaimed and freed from capitalist calculation.\\\");\\n       units.push(\\\"Our analysis agrees with one aspect of this statement, which is why we contend that the surplus has no a priori categories of measurement. However, and here we are re-stating a proposition of our analysis made elsewhere (especially Chapters 5.4 and 11), if we focus on the social relationship of staking, and the propensity of agents to stake performances in the anticipation that those performances will create social-validated outcomes which the network can value via the identification of derivative spreads, then we are identifying the measurement of attributes of the surplus-value of life, even if that surplus is defined as beyond measurement.\\\");\\n       units.push(\\\"THE COMMONS\\\");\\n       units.push(\\\"FINDING THE COMMONS\\\");\\n       units.push(\\\"In simple terms, a commons entails resources that have shared ownership and are built and curated in a distributed way. Particularly in a digital era, all sorts of performances and outputs are commons compatible. Non-divisibility of outputs and (close to) zero marginal costs of production, as found in software and other digital goods, are all conditions for a commons.[103] This suggests that commons attributes are everywhere: inside agents, between agents and across and between networks.\\\\\\\\n\\\\\\\\n[103] The Creative Commons, for example, issues licenses to enable free distribution of an author\\\\\\\\u2019s work for its further development. The license can limit the uses to which their work may be applied. See https://creativecommons.org.\\\");\\n       units.push(\\\"There is now an extensive literature on the ways in which p2p networks create the potential for a commons. We are strongly supportive of this broad agenda, and see a propensity towards participatory common ownership as integral to a postcapitalist vision.\\\");\\n       units.push(\\\"We have already engaged issues that relate to the commons, but have not yet named them. One is reciprocal staking and the culture of risking together. Reciprocal staking is the mode of entry to the commons. The other is the exchange of particular commodities that have commons\\\\\\\\u2019 properties. Some outputs will be \\\\\\\\u2018public goods,\\\\\\\\u2019 defined as outputs where one person\\\\\\\\u2019s consumption does not preclude (indeed, may enhance) the consumption of others (for example data compiled by the network, public art, a clean environment). We believe that the second dimension is already well understood, and is not specific to the new economic space, so our focus is the commons that arises from mutual staking, or what we call the \\\\\\\\u2018synthetic commons.\\\\\\\\u2019 In finance the term \\\\\\\\u2018synthetic\\\\\\\\u2019 is used to describe instruments that are engineered to simulate the performance of other assets. In the Economic Space protocol, private ownership can, in certain circumstances, simulate the interests of collective ownership. \\\\\\\\nEach of these is considered in turn.\\\");\\n       units.push(\\\"RECIPROCAL STAKING FORMS THE \\\\\\\\u2018SYNTHETIC COMMONS\\\\\\\\u2019\\\");\\n       units.push(\\\"Although a commons is conventionally defined as the antithesis of private property, reciprocal staking creates the conditions for a commons via private ownership. If all agents in the network are reciprocally staked with all other agents either directly or transitively[104] then every agent is a partial owner of every other agent\\\\\\\\u2019s performances. It may not be a large proportion of stake in the first instance, but it is significantly greater than zero. These are the conditions in which private ownership exhibits the same interests as common ownership: a synthetic commons. It is as if reciprocal staking across the network cancels out the effects (interests) of private ownership, for when each agent benefits from the success of every other agent, individual interests converge with collective interests.\\\\\\\\n\\\\\\\\n[104] Direct staking is when two parties own a stake in each other. Transitive staking is where one party holds a staking exposure to another via a third party. If A holds stake in B and B holds stake in C, then A has a transitive staking exposure to C.\\\");\\n       units.push(\\\"It is not the intention of the new economic space that common interest be purely accidental. The proposal for enacting a synthetic commons is that each agent intentionally manages their reciprocal staking portfolio so as to secure a proportional reciprocal stake across the network. We term this combination of stake the \\\\\\\\u2018_commons asset profile_.\\\\\\\\u2019 Automated stake trading can find the optimal path for each agent (and all agents) to secure their desired holding of the commons asset profile. Some agents will seek a large holding of the commons asset profile; others less. The proportion of an agent\\\\\\\\u2019s stake held in the commons asset profile determines the level of their access to the commons. So individual agents can choose whether to enter the commons and the level at which they hold membership. They can change this level by changing their reciprocal staking.\\\");\\n       units.push(\\\"DIVIDENDS AS THE COMMON PURPOSE\\\");\\n       units.push(\\\"Chapter 5.3 describes the dividends from stake ownership: \\\\\\\\nIt may be a share of output, or a share of the net revenue (outputs less the cost of inputs). It could be a financial return or a commodity output return, and those returns may accrue directly to the stakeholder or to some other agent nominated by the stakeholder, such as the commons. It could also give other rights; for example, rights to influence the future evolution of the performance, or it could give the stakeholder rights to build their own performance in connection with the performance they staked. Indeed, when outputs are framed as dividends, dividends themselves become the center of the governance and innovation dynamism that drives the network.\\\");\\n       units.push(\\\"An agent will enter the commons in order to acquire access to these dividends. Some performances for the commons will be of the same kind as performances not for the commons; it will be just the dividends that are available to the commons. Other performances will be commons-specific, in the sense that they are designed so as to be collectively accessible. For example: \\\\\\\\n- _Data._ The network will be \\\\\\\\u2018spontaneously\\\\\\\\u2019 producing a vast quantity of data that will be useful for each agent in order to monitor the health of the network and to inform their own decision-making. Yet each agent owns their own data, so that these aggregate data cannot be compiled and released without mutual agreement. The commons provides the means to co-ordinate and distribute network data. A condition of accessing collective data is that each agent must offer their own data in order to access collective data. Different levels of participation in the commons will be linked to different levels of data exchange and access. \\\\\\\\n- _Public goods._ There will be some outputs that benefit from scaled access. For some, there will be no exclusion. Agents in the network can access such outputs irrespective of whether they join the commons. But other performances have different attributes, where the possibility of scaling is large but exclusion is required (for example, a concert with a significant but limited audience capacity). These outputs may be offered to the commons. Access to these outputs (and their outcomes) could be conditional upon an agent\\\\\\\\u2019s level of commons membership. \\\\\\\\n- _Free goods._ Some outputs are not produced so as to be sold, but they nonetheless produce value because they meet a recognized need within the network. We know they produce value because agents in the network are staking the performances that generate these outputs.[105] These outputs can be attributed a synthetic price (for purposes of data collection), and may be thought of as gifts to members of the commons (see Chapter 3.5).\\\\\\\\n\\\\\\\\n[105] The owners of stake in these performances receive yield in the form of appreciating stake price, but no _private_ dividends. It could be that each individual investor is prepared to forgo yield because of a commitment to the commons. Or it could be that this commitment is shared across the network, and demand for stake in these performances sees stake price escalate to \\\\\\\\u2018compensate,\\\\\\\\u2019 as it were, for the lack of private dividends.\\\");\\n       units.push(\\\"In summary, the commons is brought into being by reciprocal staking and, once the conditions of a synthetic commons has been achieved, agents exchange dividends with the commons. There is no concept of equivalence in this exchange, for dividends are distributed directly, without the use of exchange offers. At a collective level these dividend offers to the commons constitute a social surplus: that part of network output which creates value that is not paid for.[106] The commons is a surplus distribution system! No agent has an incentive to hold back offers to the commons, and no agent\\\\\\\\u2019s drawing down on the commons will restrict the capacity of other agents in the commons to draw down.[107]\\\\\\\\n\\\\\\\\n[106] \\\\\\\\u2018Not paid for\\\\\\\\u2019 should not create the impression that it only applies to the outputs which would \\\\\\\\u2018normally\\\\\\\\u2019 be sold. Perhaps a better term is that applies to outputs that can be attributed only a synthetic price, as per Chapter 4.3.\\\\\\\\n [107] Will any agent see a disincentive to hold stake in a performance which issues dividends to the commons, because they lose access to privately-accruing dividends? This would be a narrow reading of incentives, for to hold no stake in commons-linked performances would see this agent having limited access to the assets and products of the commons. So if the network as a whole judges a performance to be value-creating for the network, and its dividends are issued to the commons, each individual agent must hold some stake in that asset, directly or transitively, to access any part of the commons.\\\");\\n       units.push(\\\"THE COMMONS AS A PROCESS OF REDISTRIBUTION\\\");\\n       units.push(\\\"The commons embeds some implicit processes of redistribution. \\\\\\\\n- _Assumed equivalence._ Because outputs for the commons are not priced, there is no formal calculation of what any agent puts into the commons and accesses from the commons: it is an assumed equivalence in a ledger sense. This assumed equivalence embeds a redistributional agenda: the _capacity_ to contribute and the _need_ to draw down.[108] \\\\\\\\n- _Underwriting lower-performing stake._ The requirement that agents will likely hold (directly or transitively) a proportional stake across the network gives temporary advantage to agents with lower-priced, lower performing stake, for all agents must hold some (small) exposure to these performances in order to hold the commons asset profile. Many of these performances will be in long-term decline, so the commons asset profile gives their stake some support to smooth the price trend. The threshold levels of reciprocal staking that constitute different levels of commons participation will need to be sensitive to this process.\\\\\\\\n\\\\\\\\n[108] Reference here is to Marx\\\\\\\\u2019s slogan from his 1875 _Critique of the Gotha Programme_ (part 1):\\\\\\\\n \\\\\\\\u2018_From each according to his ability, to each according to his needs_.\\\\\\\\u2019\\\");\\n       //383 \\n    }\\n    function set(uint256 location, string calldata _unit) external {\\n        units[location] = _unit;\\n    }\\n    function getById(uint256 location) external override returns (string memory unit) {\\n        return units[location];\\n    }\\n\\n}\"\r\n    }\r\n  },\r\n  \"settings\": {\r\n    \"optimizer\": {\r\n      \"enabled\": false,\r\n      \"runs\": 200\r\n    },\r\n    \"outputSelection\": {\r\n      \"*\": {\r\n        \"*\": [\r\n          \"evm.bytecode\",\r\n          \"evm.deployedBytecode\",\r\n          \"devdoc\",\r\n          \"userdoc\",\r\n          \"metadata\",\r\n          \"abi\"\r\n        ]\r\n      }\r\n    },\r\n    \"libraries\": {}\r\n  }\r\n}}", "ABI": "[{\"inputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"constructor\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"location\",\"type\":\"uint256\"}],\"name\":\"getById\",\"outputs\":[{\"internalType\":\"string\",\"name\":\"unit\",\"type\":\"string\"}],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"location\",\"type\":\"uint256\"},{\"internalType\":\"string\",\"name\":\"_unit\",\"type\":\"string\"}],\"name\":\"set\",\"outputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"\",\"type\":\"uint256\"}],\"name\":\"units\",\"outputs\":[{\"internalType\":\"string\",\"name\":\"\",\"type\":\"string\"}],\"stateMutability\":\"view\",\"type\":\"function\"}]", "ContractName": "UnitStorage20", "CompilerVersion": "v0.8.4+commit.c7e474f2", "OptimizationUsed": "0", "Runs": "200", "ConstructorArguments": "", "EVMVersion": "Default", "Library": "", "LicenseType": "", "Proxy": "0", "Implementation": "", "SwarmSource": ""}