{"SourceCode": "{{\r\n  \"language\": \"Solidity\",\r\n  \"sources\": {\r\n    \"contracts/storage/IStorage.sol\": {\r\n      \"content\": \"pragma solidity ^0.8.4;\\n// SPDX-License-Identifier: GPL-3.0-or-later\\n\\n// https://soliditytips.com/articles/solidity-interface-interact-with-other-contracts/\\ninterface IStorage {\\n    function getById(uint256 id) external returns (string memory unit);\\n    // Add more function signatures as needed.\\n}\"\r\n    },\r\n    \"contracts/storage/unit/UnitStorage26.sol\": {\r\n      \"content\": \"     \\npragma solidity ^0.8.4;\\n// SPDX-License-Identifier: GPL-3.0-or-later\\nimport \\\"../IStorage.sol\\\";\\n\\ncontract UnitStorage26 is IStorage{\\n    string[] public units;\\n    \\n    // set to onlyOwner()\\n    // check if value exists - \\n    constructor(){\\n        //479\\n       units.push(\\\"To frame reciprocally-issued tokens as derivatives opens up three related issues. \\\\\\\\n- _Exposure to the future._ They are both statements about the future, and the formation of possibilities. Token issuance is about their potential to be validated (backed) by a network, so they embody an exposure to the future of that network. \\\\\\\\n- _Quantified social relations_. In an economy based in issuance, redemption and settlement, the token immediately implies a quantified social relation. Tokens represent what we call \\\\\\\\u2018network derivatives.\\\\\\\\u2019 This depiction signals that token types give a partial \\\\\\\\u2018exposure\\\\\\\\u2019 to the total social relations: we are \\\\\\\\u2018decomposing the social\\\\\\\\u2019 via different token categories, in a way that cannot be done by a singular, centrally issued coin. \\\\\\\\n- _Attributes of assets._ Derivatives imply classification or bundling. Each oil option contract, for example, is distinctive in its detail (they have different prices because they are written on different prices of oil, have different expiry dates and different strike prices). But they have a recognized common (formulaic) relation to oil such that they are priced relative to each other, giving future oil a set of continuous prices. Similarly, each individually-issued token must be recognisably a \\\\\\\\u2018member\\\\\\\\u2019 of a type, so each token within a network must be recognisable as a version of the tokens issued by others.\\\");\\n       units.push(\\\"In summary, tokens are mutually recognized exposures to the output value that defines the network. This is the sense in which they are derivatives. Each token\\\\\\\\u2019s strike price is determined by the network\\\\\\\\u2019s expression of the value of a bundle of output values which is deemed to back a token.\\\");\\n       units.push(\\\"TOKENS AND LEDGERS\\\");\\n       units.push(\\\"INTRODUCTION\\\");\\n       units.push(\\\"Our analysis is now in the domain of ledgers and tokens. We need to present the relations of exchange, credit and staking as formal, ledger-expressed processes in contrast with earlier chapters, where those relations were depicted as social interactions. Connections between socio-historical and formal ledger modes of expression should be highlighted. They are not an easy fit but for protocol design they must be reconciled because it is vital to have both dimensions expressed.\\\");\\n       units.push(\\\"Ledger representations give precision and transparency to social relations and social relations give the token and ledger representation a direct connection to material social and economic underliers. This twoway expression is our claim that the Economic Space Protocol is the depiction of \\\\\\\\u2018real\\\\\\\\u2019 economic processes: it is based socially in claims to historical change and economically in claims to a foundation in \\\\\\\\u2018fundamental value.\\\\\\\\u2019[139]\\\\\\\\n\\\\\\\\n[139] On claims to \\\\\\\\u2018fundamental value,\\\\\\\\u2019 see esp. Chapter 12.3 and Appendices 5.1 and 12.2.\\\");\\n       units.push(\\\"Our focus in this chapter is the mechanics of exchange representation on ledgers. Following the order of exposition we have developed in previous chapters - starting with staking and moving to liquidity and then to dynamic (as opposed to simple) commodity exchange, we introduce the stake token, the liquidity token and the commodity token. \\\\\\\\n- _Stake tokens._ These will be issued by an agent in return for a stake in another agent\\\\\\\\u2019s performance. It gives the holder the right to participate in the revenue (receive a dividend) and is generated by the issuing agent\\\\\\\\u2019s economic activity.[140] \\\\\\\\n- _Liquidity tokens._ These are an extension of credit denominated in the unit of exchange, giving rise to units of credit. This token is redeemed on demand for any token on offer by an economic agent. \\\\\\\\n- _Commodity tokens._ These are issued by an economic agent on completion of an exchange. The token represents a right to the specific output (the \\\\\\\\u2018underlier\\\\\\\\u2019 it describes). It also generates a set of information associated with the exchange that forms the basis of data-rich economic performances that themselves generate new commodities.\\\\\\\\n\\\\\\\\n[140] Each staking contract will specify its particular version of these participation rights.\\\");\\n       units.push(\\\"Each will be considered in turn, both diagrammatically and with text. Figure 10.1 contains the visual elements that are components of all diagrams. \\\\\\\\n[Figure 10.1 Visual elements representation legend]\\\");\\n       units.push(\\\"STAKE TOKENS\\\");\\n       units.push(\\\"Stake involves asset ownership capacities of participation in performances and exposure to dividends (yields) on performances. Reciprocal staking is a two-way economic communication interface, through which credit, commodities or other stake can be distributed throughout the network. As a process, reciprocal staking binds the network in on-going common interest. Stake tokens, issued to represent the transferred ownership of stake, perform the following roles: \\\\\\\\n- _Sharing the risks._ Risks of asset ownership have both an upside and downside. A transfer of stake involves one agent\\\\\\\\u2019s acquisition of a share in the performance of another agent for purposes of both: \\\\\\\\n\\\\\\\\u00BB short stake-diversification positions. As each purchase of a stake token requires an issuance of stake by that purchaser, there is a hedging process for all agents to diversify their own risks, generating liquidity in the stake market. \\\\\\\\n\\\\\\\\u00BB long performance-focusses positions. This could be called \\\\\\\\u2018commitment staking.\\\\\\\\u2019 Agents invest stake in those agents whose performances are likely to create future value in the network.[141] \\\\\\\\n- _Providing collateral for credit_. This enables shared liquidity. Stake-as-collateral means an agent can secure access to credit (liquidity) without having to exit their stake position. \\\\\\\\n- _Offers and dividends._ Stake tokens give the right to nodes in the network to receive offers from an issuer and, most importantly, to receive dividends.\\\\\\\\n\\\\\\\\n[141] Readers who see this proposition as reminiscent of Keyne\\\\\\\\u2019s critique of stock market speculation (trades motivated by \\\\\\\\u2018other people\\\\\\\\u2019s opinions\\\\\\\\u2019) are invited to see Appendix 12.3.\\\");\\n       units.push(\\\"Stake tokens have the following attributes: \\\\\\\\n- They are issued and accepted by agents in return for the stakes of others. \\\\\\\\n- They are financial positions on the future and a means to diversify the risks of ownership. \\\\\\\\n- They are a measurement of the aggregate performance of an economic agent. \\\\\\\\n- Their price is measured in the unit of exchange, and is reflected in the matched exchange offers. That price will reflect the valuation of the asset being staked, and will change broadly in relation to that valuation. \\\\\\\\n- They give voice to agents\\\\\\\\u2019 decisions about what constitutes \\\\\\\\u2018value\\\\\\\\u2019 and where in the network it is best being created. \\\\\\\\n- They create performance data about the state of the economy.\\\");\\n       units.push(\\\"The stake issuance process is shown in Figures 10.2 to 10.4. \\\\\\\\n[Figure 10.2 Agent A publishes stake exchange offer to the network, proposing 500B for 900A] \\\\\\\\n[Figure 10.3 The network matches A\\\\\\\\u2019s stake exchange offer] \\\\\\\\n[Figure 10.4 Agent A holds 500B and the network holds 900A]\\\");\\n       units.push(\\\"LIQUIDITY TOKENS\\\");\\n       units.push(\\\"In a distributed economy the offer-as-line-of-credit is the starting point and reciprocal token issuance is its appearance.[142] In exchange, when the offer is published, it becomes a line of credit, whether it be in the form of commodity credit (an offer to deliver output in the future) or financial credit (an offer of liquidity). Hence the offer stands as an option on credit proper. The right to exercise the option \\\\\\\\u2013 to draw down on the line of credit by accepting the offer of credit \\\\\\\\u2013 is itself a form of liquidity. In summary, the offer is liquidity, and the matching of that offer brings the liquidity token into being.\\\\\\\\n\\\\\\\\n[142] Economic textbooks want to explain money via a logical evolution from barter, and the growing complexity of economic transactions enabled by money. Anthropologists are inclined to emphasize the origins of trade in credit and the gift, bringing focus to the time interval in trade.\\\");\\n       units.push(\\\"The incentive to issue liquidity tokens is the recognition that scaling transactions and complex networks will not work without intertemporal smoothing. This frames liquidity token offers as a social act of reciprocity: a contribution to keeping the wheels of commerce turning.\\\");\\n       units.push(\\\"The Economic Space Protocol implements a \\\\\\\\u2018network credit agreement\\\\\\\\u2019 (with stake as collateral). A credit agreement is an automated \\\\\\\\u2018topping up\\\\\\\\u2019 of credit: when any credit is cleared by an act of exchange of liquidity tokens, the line of credit is topped up to its agreed limit. This ensures that credit offers are a constantly-adjusting stock, enabling credit itself to manifest as a flow. Credit tokens bear no interest or yield; nor are they an effective store of value.[143]\\\\\\\\n\\\\\\\\n[143] Credit tokens are not designed to store value; indeed with no yield, their main risk is downside: the risk of default of the issuer. Default would be the event of the issuer not being able to provide/create its outputs, and not necessarily because of insolvency. For as long as an issuing agent creates value, the markets will adjust both the price of the offer and the reputation rating of the agent, indeed to the point that the agent may be no more than an issuer of credit. But as long as there is any demand for its commodity tokens, liquidity tokens will be matched until cleared.\\\");\\n       units.push(\\\"Liquidity tokens have the following attributes. They: \\\\\\\\n- Are denominated in the unit of exchange: credit clearing may only occur across entities of the same kind and denomination. In effect, liquidity tokens bring the unit of exchange to life as more than a passive numeraire mediating the valuation of other tokens: it becomes _a unit of distributed issuance of credit._ \\\\\\\\n- Come into being through a collateralized credit agreement. This means credit issuance effectively appears as automated. \\\\\\\\n- Are cleared when they serve an exchange. This is through netting by the distributed offer matching algorithm. \\\\\\\\n- Give a right to be redeemed on demand for any output on offer by the issuing economic agent, or to clear outstanding credit in the opposite direction. \\\\\\\\n- Are not held longer than necessary to settle a trade.\\\");\\n       units.push(\\\"Credit relationships will be of two general types: \\\\\\\\n- _Credit issuance._ This is token issuance between agents directly involved in exchange of commodities or stake, giving the liquidity required to initiate exchange. This credit will generally be initiated to bring an act of production into being; for example to enable a producer to acquire inputs. It is presented diagrammatically as a _credit granting exchange offer,_ represented in Figures 10.5 to 10.7. \\\\\\\\n- _Distributed clearing._ This token issuance is generated \\\\\\\\u2018automatically\\\\\\\\u2019 in the netting process, to enable an intertemporal match. It is automatically closed out once the ledger is settled. It is presented diagrammatically as a _credit clearing exchange offer_, represented in Figures 10.8 to 10.10 \\\\\\\\n[Figure 10.5 An agent makes the network an (issuing credit) offer to exchange commodity X for liquidity tokens] \\\\\\\\n[Figure 10.6 Network matches the offer, accepting liquidity tokens from agent] \\\\\\\\n[Figure 10.7 Network gives credit to the agent who now holds a liquidity token liability and a commodity token asset] \\\\\\\\n[Figure 10.8 Agent receives a (clearing) offer from the network to exchange liquidity tokens for a commodity token] \\\\\\\\n[Figure 10.9 Agent matches credit (clearing) offer] \\\\\\\\n[Figure 10.10 Agent\\\\\\\\u2019s credit liabilities are cleared through netting, so the network now holds a net asset of 30 liquidity tokens]\\\");\\n       units.push(\\\"COMMODITY TOKENS\\\");\\n       // 497\\n    }\\n    function set(uint256 location, string calldata _unit) external {\\n        units[location] = _unit;\\n    }\\n    function getById(uint256 location) external override returns (string memory unit) {\\n        return units[location];\\n    }\\n\\n}\"\r\n    }\r\n  },\r\n  \"settings\": {\r\n    \"optimizer\": {\r\n      \"enabled\": false,\r\n      \"runs\": 200\r\n    },\r\n    \"outputSelection\": {\r\n      \"*\": {\r\n        \"*\": [\r\n          \"evm.bytecode\",\r\n          \"evm.deployedBytecode\",\r\n          \"devdoc\",\r\n          \"userdoc\",\r\n          \"metadata\",\r\n          \"abi\"\r\n        ]\r\n      }\r\n    },\r\n    \"libraries\": {}\r\n  }\r\n}}", "ABI": "[{\"inputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"constructor\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"location\",\"type\":\"uint256\"}],\"name\":\"getById\",\"outputs\":[{\"internalType\":\"string\",\"name\":\"unit\",\"type\":\"string\"}],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"location\",\"type\":\"uint256\"},{\"internalType\":\"string\",\"name\":\"_unit\",\"type\":\"string\"}],\"name\":\"set\",\"outputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"\",\"type\":\"uint256\"}],\"name\":\"units\",\"outputs\":[{\"internalType\":\"string\",\"name\":\"\",\"type\":\"string\"}],\"stateMutability\":\"view\",\"type\":\"function\"}]", "ContractName": "UnitStorage26", "CompilerVersion": "v0.8.4+commit.c7e474f2", "OptimizationUsed": "0", "Runs": "200", "ConstructorArguments": "", "EVMVersion": "Default", "Library": "", "LicenseType": "", "Proxy": "0", "Implementation": "", "SwarmSource": ""}