{"SourceCode": "{{\r\n  \"language\": \"Solidity\",\r\n  \"sources\": {\r\n    \"contracts/storage/IStorage.sol\": {\r\n      \"content\": \"pragma solidity ^0.8.4;\\n// SPDX-License-Identifier: GPL-3.0-or-later\\n\\n// https://soliditytips.com/articles/solidity-interface-interact-with-other-contracts/\\ninterface IStorage {\\n    function getById(uint256 id) external returns (string memory unit);\\n    // Add more function signatures as needed.\\n}\"\r\n    },\r\n    \"contracts/storage/unit/UnitStorage35.sol\": {\r\n      \"content\": \"     \\npragma solidity ^0.8.4;\\n// SPDX-License-Identifier: GPL-3.0-or-later\\nimport \\\"../IStorage.sol\\\";\\n\\ncontract UnitStorage35 is IStorage{\\n    string[] public units;\\n    \\n    // set to onlyOwner()\\n    // check if value exists - \\n    constructor(){\\n       units.push(\\\"The capability to operate and navigate in the new economic space-time. The ability to use the postcapitalist economic grammar to express new economic-organizational compositions. The capability the economic space protocol creates to its users. We all need it. And we want everybody to have it. ECSA project is about open sourcing economic space agency.\\\");\\n       units.push(\\\"An economic heresy. A market maker and a sense maker, a navigator, for a post-capitalist future. A volatility space innovation: a collective risk generating and arbitraging practice, leveraging on our ability to act together on an opening and collectively enjoying the upside. A group of radical economists, software architects, game designers, activists, monetary theorists & content creators deeply passionate about the economy.\\\");\\n       units.push(\\\"Economic space agent has the same capacities as an economic agent, but follows a set of protocols that enable it to create relational value forms, liquidity, and risk-sharing through commodity (performance) tokens, liquidity tokens and stake tokens. Via a distributed payments and settlement protocol, they can issue and clear credit among each other by issuing liquidity tokens, denominated in a shared units of account with a parity exchange agreement. Via a distributed risk sharing protocol, agents can issue a stake in the output (performance) of an economic space agent; it serves as a collateral for liquidity tokens and determines the size of the reciprocal credit line. Together these protocols make a formal economic grammar through which the economic space agents relate to each other: a new economic language for expressing economic-organizational relations.\\\");\\n       units.push(\\\"The economic space protocol is a shared language to understand and articulate networked economic values and relationships. It enables its members to negotiate new economic relationships that describe how they may create, measure, and distribute the value generated from their interactions. Furthermore, this language allows users to articulate new network value forms (i.e., network derivatives) predicated on mutually beneficial economic relationship parameters in a unified economic network. In other words, it is a formal medium for creating postcapitalist economic organization (an economic media). It is an economic networking protocol that gives people the power to create economic networks. Economic networks, we believe, will be for Web3 what social networks were for Web2 and shared keyword networks were for Web1. The Economic Space Protocol is like an economic system creator in a box. It enables a new organization type called an Economic Space, a programmable network where participants can publish, validate, and value each other\\\\\\\\u2019s contributions. It introduces a new value primitive known as the Economic Space Performance and a new transaction type that involves exchanging stake for access to each other\\\\\\\\u2019s output and reciprocal credit lines. The protocol redefines wealth by recognizing stake as preferred stores of value and incentivizes cooperation by rewarding those who align their performances with one another. It establishes distributed leadership to decide what should be valued and forms an economic medium in which all agents have equal capacities, like issuing stake and clearing credit. We think of it like a new kind of economic intelligence.\\\");\\n       units.push(\\\"The economy is a communication network: a group of agents interacting under certain agreements, i.e. protocols, that define the relations that form the network, their state and how these may change. Starting with communication networks situates agents in a social context and gives focus to their collective endeavour as ontologically prior to their individual interactions. Revealing the economy as a communication network means that the protocol that unitses its agents does not need to be taken for granted. The economy is just a messaging protocol, just a networking protocol, just a communication network - which means that it can be redesigned. Framed this way, the economy reveals itself to be programmable: how the economy works and what are its key conventions - _under what kind of relations, interactions, agents, values, state changes the network operates_ - becomes a design space, continuously open to its participating agents. The whole programmability of the economy is a dimension of making it accessible. We think that by describing economy as a communication network and as a language that can be opened and shared and learned, we are also reclaiming its powers and what can be done with it: thinking about it as a language which can be used to express many different things, we can start adding richness, gain capacity to define your own values, create new kind of assets, new kind of risking-together, redenominate, do redeployments from your perspective out of a network you are part of. It means reclaiming, redefining, occupying the economy. We want to open up the language of economy: to give everyone the same rights and capacities to express themselves and what they value. Why? Because we want to decentralize the authorship of futures: to open source and decentralize what remained centralized and closed still in the social media: the information and protocol layers called the economy. We want to create a more expressive language to describe our economic networks, because their nature is bound by the expressivity of the language that can conceive them. See Governance.\\\");\\n       units.push(\\\"ECSA token is the financial, organizational and communicative interface of the Economic Space Agency project. Financially, it gives the holder a stake in the ECSA project, i.e., an exposure to the network performance and the ability to benefit from the token appreciation. It is a network performance derivative with multi-denominational dividends: it indexes the performance of the network and captures its network value (network premium: the value created by being networked, i.e., by forming an interconnected network). Its value is basically anchored in the spread that will emerge between the network capacities of the existing capitalist economic network and the postcapitalist economic network: a spread between their expressive power, stability, accessibility, fairness of distribution, adaptability, scalability, privacy, functional equality and programmability. Organizationally, the ECSA token gives the token holder _economic space agency_: the right to participate in the network generation, governance, agenda and value setting, and sharing in the premium of being networked. In other words, communicationally, it opens a two-way communication channel: the holder can affect the network; and the network can affect the holder by sharing \\\\\\\\u201Cdividends\\\\\\\\u201D (network outputs) to the holder. As an interface, the ECSA token is designed to both bridge and mediate. Its issuance model shields economic spaces from capital market volatility and its narrow valuation convention: the token acts as a boundary protecting the values and development inside the network. The token is also constitutional to the network: its core function is to maintain liquidity and stability during the bootstrap phase. Its purpose is, on the one hand, to concretely establish an economic network (a distributed economic alliance) among network participants using mutual stakeholding as the network primitive and, on the other hand, to bootstrap the network liquidity. Through it, holders participate also in the network\\\\\\\\u2019s governance. Finally, the ECSA token price in USD indexes its value ascribed by the capital markets. The reverse exchange rate indexes the inverse: the USD price in ECSA Unitss indexes the value of capital markets ascribed by the network. The more self-sufficient the network becomes, the less it must value the capital markets relative to itself. Our wager is that it will decrease the value of USD in the network and correspondingly increase the value of the ECSA token in the capital markets. Bitcoin may be a short position on capitalist money. But the ECSA token offers a short position on the capitalist economy and culture. See Network premium. See Living in the spread.\\\");\\n       units.push(\\\"The proposition that markets reflect all available information, so at any time market outcomes are efficient, but all new information will change the efficient outcome, so that efficient outcome will continually change.\\\");\\n       units.push(\\\"A foundational term in the ECSA economic grammar. A simultaneous and reciprocal transfer of objects of value, encoded as a transaction record on ledgers. The practical agreements we make through trade determine the transactions recorded. ECSA is an invitation to understand the economy as a re-designable communication medium and organization system, where our exchanges are not only material but also informatic. This opens exchange as a very interesting design space. See Distributed Exchange Protocol.\\\");\\n       units.push(\\\"An abstract units of exchange: a common denominator in which to express exchanges, enabling the matching algorithm to gradually fill an order. In the economic space protocol exchange offers are expressed through an abstract units of exchange, where the rates of exchange between any two commodities are translated to these unitss. Through netting, exchanges can occur without the need to hold and then use a mediating financial instrument (i.e., money). This is of importance since money in a capitalist economy is effectively the \\\\\\\\u2018right to express exchange value.\\\\\\\\u2019 The economic space protocol\\\\\\\\u2019s money equivalent is reciprocally issued credit, denominated in unitss of exchange/unitss of credit.\\\");\\n       units.push(\\\"An expression is a sequence of symbols following the economic space protocol that is meaningful only within the scope of an economic space. Economic space expressions may refer to the resources contained in the scope from which it is evaluated and clearly and unambiguously describe the actions that you or other economic space agents may perform. These actions may include the creation of a new resource, an interaction with another economic space agent, alteration to the economic space record, or the invocation of another protocol.\\\");\\n       units.push(\\\"ECSA is using finance as its medium of expression. Why? Because, economically and politically, if we want to build postcapitalism, we must recognize the power of finance as an organizational technology that can connect the future and the present. That is why there is no question in our mind that postcapitalism is a financial system: finance is a non-state way of connecting the future and the present. ECSA wants to reengineer finance, liquidity and risk flows, flows of dependencies and potentialities, to work with its materiality, with the divergent capacities lying latent but definitely built-into its matter. Financial technologies are moldable, plastic, synthetic \\\\\\\\u2013 just waiting for an artist\\\\\\\\u2019s touch to make them start producing different socialities. Finance as our material and medium, we want to attach directly to art\\\\\\\\u2019s power to create unforeseen, previously unknown and unthinkable economic, political, social, incorporeal processes. See Navigation.\\\");\\n       units.push(\\\"Political theology of the new economic space. Re: Giorgio Agamben\\\\\\\\u2019s well known book The Time That Remains on political theology. Agamben develops a strategy \\\\\\\\u2013 to question the logic of sovereign powers \\\\\\\\u2013 which does not seek to destroy the established order of social and political relations, but deactivates and moves beyond them by re-framing and re-potentializing our experience of \\\\\\\\u201Cnow\\\\\\\\u201D. Political theology works always with the change of experience, opening the field of the possible, and thus, with the creation of subjectivity. This is the business of the Economic Space Agency.\\\");\\n       units.push(\\\"Fundamental value, a.k.a. fundamentals, refers to the idea that there exists an underlying value of outputs which is discrete from price. In some versions, fundamental value approximates long-term price (i.e. ignoring short-term volatility); in other versions fundamental value is determined by forces other than supply and demand. For Marx, this determinant of output value is socially necessary labour time. In the new economic space it is performances.\\\");\\n       units.push(\\\"Marx\\\\\\\\u2019s \\\\\\\\u201CFragment on Machines\\\\\\\\u201D, which is the logical culmination of the _Economic Manuscripts 1857-1858_ or the so called _Grundrisse_, expounds on the \\\\\\\\u201Cnatural development\\\\\\\\u201D of capitalism where the labor that produces material objects and even the working class itself will be displaced from the core of the production of wealth. The evolution of capital will proceed to its \\\\\\\\u201Cfinal phase\\\\\\\\u201D because capital itself, instead of the working class, causes a change in the nature of the production of value \\\\\\\\u2013 a change that will lead to the dismantlement of the organization of production based on exchange value. According to Marx, the reason for this change is that abstract knowledge and thinking become immediate productive power. They will replace direct labor and its fragmented and monotonously repetitive tasks, or industrial labor and the society based on division of labor in the traditional sense. As a result, the \\\\\\\\u201Cgreat foundation-stone of production and of wealth\\\\\\\\u201D will no longer be the immediate labor performed by men (modification of natural resources, manufacture of goods), or even the time used for this (work time). Instead the \\\\\\\\u201Cforces of social combination\\\\\\\\u201D the \\\\\\\\u201Cdevelopment of the general powers of the human head \\\\\\\\u201D and the \\\\\\\\u201Cdevelopment of the social individual\\\\\\\\u201D as a whole will now take this role. For Marx, the foremost expression of the power of this general intellect, or general social understanding, is the increasing importance of machines and systems of machinery \\\\\\\\u2013 i.e., of fixed capital \\\\\\\\u2013 in production. For us, Marx\\\\\\\\u2019s Fragment on Machines appears both amazingly prophetic and amazingly failed. For more see Akseli Virtanen (2006): General Intellect.\\\");\\n       units.push(\\\"In gift societies, gifts are indexes of sociability that give meaning to what is happening as it happens. Or in other words, they were pre-monetary contingent claims and obligations, i.e., prototypes of a derivative. In gift societies gifts are always \\\\\\\\u201Ccommensurated\\\\\\\\u201D by the later return of \\\\\\\\u201Ccounter-gifts\\\\\\\\u201D; people and groups build up \\\\\\\\u201Cportfolios\\\\\\\\u201D of social claims and obligations, which need to be maintained and exercised before they begin to lose their value. Since these claims and obligations are often overlapping, and involve different payoffs and expirations, there is an \\\\\\\\u201Cart\\\\\\\\u201D to giving and receiving gifts that lie at the heart of \\\\\\\\u201Cprimitive economies\\\\\\\\u201D; these systems of exchange become elaborated into inter-tribal cultural economies such in the kula of the Trobriands or the potlatch of the Kwakiutal, to name two of the more famous examples. In other words, instead of the exchange of objects that were thought to be independent of their \\\\\\\\u201Cowners\\\\\\\\u201D (alienable exchange), in gift societies the objects exchanged were integral parts of relationships with others, a part of yourself or spirit that circulated among consociates and kin (or even enemies as in the case of witchcraft). In the famous Kula ring, Kula valuables were circulated for purposes of accruing status and prestige and sharply distinguished from objects that could be bartered and exchanged. Kula valuables did not serve any economic function but rather established the framework of meaning for its participating societies, which consisted of eighteen relatively isolated island communitsies held together by networks of differential status. The circulating valuables established framework of status and prestige that modulated a social system of affects and emotions that encompassed the whole Kula despite its dispersed populations\\\\\\\\u2014both the consociates who lived on the same island and those whom one might never meet\\\\\\\\u2014a precursor to the \\\\\\\\u201Cstranger mediation\\\\\\\\u201D of modern societies in which the people that make up a social collectivity may never know or have contact with one another. While Marx\\\\\\\\u2019s money dialectic gave a picture that started with simple exchange and ended with money as mediating a totality of value that it created, his comments about alienability indicate mistakenly that the precursor to money as a medium of exchange and store of value would be the \\\\\\\\u201Calienable\\\\\\\\u201D objects circulated via barter and exchange, and not Kula valuables or their inalienable counterparts in gift societies. Marx even states that the \\\\\\\\u201Cexchange of commodities begins where communitsies have their boundaries, at their points of contact with other communitsies\\\\\\\\u201D and only work inwards from the margins. Since gift givers and takers were not seen as independent of the social relationships in which they were embedded, anthropologists of India and Melanesia developed the term \\\\\\\\u201Cdividuals\\\\\\\\u201D (which Deleuze independently coined) to contrast with the autonomous \\\\\\\\u201Cindividuals\\\\\\\\u201D of capitalism. In such societies, \\\\\\\\u201Cgifts\\\\\\\\u201D would not function as medium of exchange or units of account, but rather as indices of sociability that give meaning to what is happening as it happens. In the case of the Kula, the circulating valuables keep the Kula operating by creating a shared framework of status and prestige across the island communitsies that ranks and aligns the various groups and determines the appropriate social relations between them, including those in barter. The flow of affective sentiments subsumes the economic by defining the social groups that barter and exchange. For more, see Benjamin Lee (2019): Token as a derivative and a gift.\\\");\\n       units.push(\\\"Governance is economy. Economy is governance. What does this ECSA proposition mean? It is a thesis about the current relationship between governance and economy. Historically, the limited ability to know, the information deficit, which is just another name for information overflow, has been in the center of the equation of government and economy. The analysis of grain trade in the beginning of political economy in the turn of the 18th and 19th centuries was especially designed to indicate the point where government was always too excessive government. Whether it was a question of the physiocratic table (Quesnay) whose purpose was to make visible the formation of the cycle of value and wealth, or of Smith\\\\\\\\u2019s theory of the invisible hand, which presumed the natural invisibility of the connection between profit-seeking individuals and increasing general wealth, political economy was always trying to establish the fundamental incompatibility of the optimal progress of the economic process and the maximizing of (state) government. The French and English economists severed the tie with mercantilism and cameralism. The limitedness of the possibility of government was a direct consequence of its limited ability to know the economic process in its totality. For political economy, the _economic regularities_ (discovered in the population/wealth relationship) expressed a fundamentally different rationality than the _government of everything_ characterizing the earlier cameralist economic thinking. The ECSA analysis is in the economy of knowledge and attention where the mechanisms of valorization have spread into the entire time of life and entire space of society, into the production of subjectivity, that is, beyond and outside the limits of economy in its restricted sense as a semi-autonomous sphere of reality with its own regularities. So, if economy has become the paradigm of government - as Giorgio Agamben and Michel Foucault for example claim \\\\\\\\u2013 it is not in its modern sense (as a semi-autonomous sphere of reality with its own regularities), but in the original sense of economy as _oikonomia._ Economy has again become bare government, government without any purpose or end other than itself. That is why economy is the key to the central political questions of our time. Michel Foucault located very interestingly the particularity of the functioning of power in government, understood as economy in the sense of _oikonomia_ (management of the household). For Foucault techniques of power did not emerge from politics, nor were they subordinate to economy in its modern sense, but they had their own particularity and they were to be approached as their own \\\\\\\\u201Devent\\\\\\\\u201D. The genious of Foucault was to be able to formulate a conception of a form of power, which was essential to the development of capitalism and to the society complying with it, but yet could not be conceptualized as sovereignty, ideology or repression. These new relations of power were functioning and productive and not only superstructural to relations of production. They could not be reduced only to the capitalistic mode of production, but had their own particular form, history and technologies. Power was not only economically functional, yet not only political in the sense that it would have been like a right, something that could be possessed like a commodity and thus surrendered, transferred, owned or sold. It did not belong to a particular institution or class, and could thus not be understood with means of the political-juridical theory of sovereignty. Foucault analyzed this change in the nature of government with his concept of _biopower_. He showed how the form of the exercise of power changed exactly at the moment when economy (_oikonomia_, the management of the family, its property and goods) and politics (the government of the _polis_) merged: the new order of biopower emerges at the moment that economy \\\\\\\\u2013 i.e. the right way to govern one\\\\\\\\u2019s wife, children, slaves, and wealth and making the family fortunes prosper \\\\\\\\u2013 enters politics and the minute attention of the father on the family becomes the way the \\\\\\\\u201Cgreat family\\\\\\\\u201D, the state, is governed. This is the meaning of _political economy_ in the original sense of the syntagma. So what kind of a particular form of goverment is economy? For Aristotle _oikonomia_ is not an epistemic paradigm so it could never become a science. _Oikonomia_ is not an _episteme_ but a _praxis_: its procedures and decisions can be understood only in relation to a particular situation and particular problem. In other words _oikonomia_ is not bound to truth or to permanent rules but to continuously changing circumstances and the varying and even contradictory measures required by them. Xenophon uses a metaphor of a sailing ship (the word government comes from the Greek word _kybernetes_ which means the pilot of the ship, to guide the ship) where all members of the crew are responsible for everything and they modulate their actions according to the changing circumstances: there is never an incessant truth in _oikonomia_, its ad hoc actions depend always on the situation. Absolute truth or good life (political life) are not essential to it. Pragmatic functionality and operationality is always a priority to _oikonomia_, not truth. That is why from the Greek perspective politics can never be reduced to economy. For Aristotle and Xenophon economy differs from politics just like _oikos_ differs from _polis_: _oikonomia_ is never governed by law or truth, it is indifferent to truth. That is why we can say that economy as government is fundamentally lawless, anarchic or without foundation (an-arch\\\\\\\\uE9). It is anarchic, it does not have a foundation, a beginning or an end separate from itself. When an action does not have a foundation or a purpose, its politics and ethics become very problematic. It becomes arbitrary. It is through this an-archic nature of _oikonomia_ where we find the path to the essence of the question of government, the question of its possibility and necessity. _Oikonomia_ has no foundation (in being). If a human action had a permanent reason, purpose or meaning (founded in being) which guided it, it could not be governed. There is a secret solidarity between anarchy and government. The possibility and necessity of government is in its groundless or anarchic nature. Economy exists only because the elements that constitute this government are groundless and anarchic. For more, see Akseli Virtanen (2006): Oikos, Polis, Nomos. And Franco Berardi & Akseli Virtanen (2013): From Arbitrary Power to Morphogenesis - How to Govern without Meaning?\\\");\\n       units.push(\\\"A grammar is an interoperability and interaction coordination tool that doesn\\\\\\\\u2019t require a central timeline (a global clock). A language organizes messages with no synchronization, but rather with validation by indexing, i.e., by embedding temporalities to one another by indexing. A grammar makes it possible to tell multiple stories at the same time: coordinating the time of speech events, not through one utterance to determine it all, but through unfolding of the many conversations as they are calibrated against each other. A grammar coordinates any potential conversation with another with no central time. How does this relate to the economy? The mutation, invention and creation that drives the economy cannot really be mapped to or by a global clock - it does not have the play of creativity of indexicality, creativity of each utterance being coordinated (co-referenced) with one another. Here is the reason why all \\\\\\\\u201Cblockchains\\\\\\\\u201D (data structures defined by message ordering through a global clock) are like straight jackets from the perspective of the economy. We think the economy is the real Layer 1.\\\");\\n       units.push(\\\"An index measures a certain aspect of the performance of the network. Indices, as network and knowledge derivatives, build from this information will be the primary content discovery paradigm of the Economic Web where nodes are economic space agents and tokens the links in the network - just like keyword based search was the dominant content discovery paradigm in Web 1.0 (where nodes were documents and hyperlinks the links in the network) and social based feed was it for Web 2.0. (where nodes were people, brands and likes/follows the linking mechanism).\\\");\\n       units.push(\\\"In linguistics, calendar time is contrasted to indexical time, i.e., tense in the form of past, present, and future. Temporal reference shifts with every event of speaking and is logically intensional, as is modality (necessity and possibility) and verbs of thinking, feeling, and speaking.\\\");\\n       units.push(\\\"ECSA is creating a new kind of information infrastructure which allows novel information flows - what counts as value, what counts as collateral, what counts as liquid - to enter an accounting system that articulates, accounts, moves and creates value.\\\");\\n    }\\n    function set(uint256 location, string calldata _unit) external {\\n        units[location] = _unit;\\n    }\\n    function getById(uint256 location) external override returns (string memory unit) {\\n        return units[location];\\n    }\\n\\n}\"\r\n    }\r\n  },\r\n  \"settings\": {\r\n    \"optimizer\": {\r\n      \"enabled\": false,\r\n      \"runs\": 200\r\n    },\r\n    \"outputSelection\": {\r\n      \"*\": {\r\n        \"*\": [\r\n          \"evm.bytecode\",\r\n          \"evm.deployedBytecode\",\r\n          \"devdoc\",\r\n          \"userdoc\",\r\n          \"metadata\",\r\n          \"abi\"\r\n        ]\r\n      }\r\n    },\r\n    \"libraries\": {}\r\n  }\r\n}}", "ABI": "[{\"inputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"constructor\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"location\",\"type\":\"uint256\"}],\"name\":\"getById\",\"outputs\":[{\"internalType\":\"string\",\"name\":\"unit\",\"type\":\"string\"}],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"location\",\"type\":\"uint256\"},{\"internalType\":\"string\",\"name\":\"_unit\",\"type\":\"string\"}],\"name\":\"set\",\"outputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"\",\"type\":\"uint256\"}],\"name\":\"units\",\"outputs\":[{\"internalType\":\"string\",\"name\":\"\",\"type\":\"string\"}],\"stateMutability\":\"view\",\"type\":\"function\"}]", "ContractName": "UnitStorage35", "CompilerVersion": "v0.8.4+commit.c7e474f2", "OptimizationUsed": "0", "Runs": "200", "ConstructorArguments": "", "EVMVersion": "Default", "Library": "", "LicenseType": "", "Proxy": "0", "Implementation": "", "SwarmSource": ""}