{"SourceCode": "{{\r\n  \"language\": \"Solidity\",\r\n  \"sources\": {\r\n    \"contracts/storage/IStorage.sol\": {\r\n      \"content\": \"pragma solidity ^0.8.4;\\n// SPDX-License-Identifier: GPL-3.0-or-later\\n\\n// https://soliditytips.com/articles/solidity-interface-interact-with-other-contracts/\\ninterface IStorage {\\n    function getById(uint256 id) external returns (string memory unit);\\n    // Add more function signatures as needed.\\n}\"\r\n    },\r\n    \"contracts/storage/unit/UnitStorage6.sol\": {\r\n      \"content\": \"     \\npragma solidity ^0.8.4;\\n// SPDX-License-Identifier: GPL-3.0-or-later\\nimport \\\"../IStorage.sol\\\";\\n\\ncontract UnitStorage6 is IStorage{\\n    string[] public units;\\n    \\n    // set to onlyOwner()\\n    // check if value exists - \\n    constructor(){\\n       //97\\n       units.push(\\\"_The liquidity question_. Who has the right to issue? In capitalism liquidity is about the state, the banking system it superintends and the money it endorses. When only those state-approved agents can issue, then a liquidity premium (a rate of return on money) can be charged for the risks involved in holding illiquid assets, because an exchange may not be found quickly.[22] The new economic space challenges this hegemony as the source of money issuance, proposing instead p2p reciprocal issuance amongst agents in a network. But what they issue is not \\\\\\\\u2018money\\\\\\\\u2019 as conventionally understood. Tokens in the network we propose are not private money, but claims on other agents: offers from one agent that are accepted by another and registered by the transfer of a token. Where all agents can issue in this sense, there need be no network shortage of liquidity and hence no liquidity premium.[23] The provision of liquidity can be fully collateralized by stake, and this collateral, rather than a liquidity premium, covers lending risk.[24] Because collateral derives from the process of reciprocal staking it is the network overall that carries default risk. Stake becomes the complement of liquidity.\\\\\\\\n\\\\\\\\n[22] Stripped to its basics, the liquidity premium is a cost that addresses the deepest, darkest fear of capitalism: that the market (people to sell to or buy from) will simply disappear in sufficient numbers so that the flow will stop. This point, and the necessity of the dealer function, has been emphasized to us by Colin Drumm (2021), see also Treynor (1987).\\\\\\\\n [23] For explanation see L\\\\\\\\u00F3pez, J. \\\\\\\\u2018Market credit: Distributed liquidity protocol.\\\\\\\\u2019 http://marketcredit.manifold.one\\\\\\\\n [24] This is the practice of shadow banking. Many people equate shadow banking with illegality. But investment banks like Goldman Sachs, insurance and reinsurance companies and money market funds \\\\\\\\u2013 many of which are divisions of large \\\\\\\\u2018standard\\\\\\\\u2019 banks \\\\\\\\u2013 engage in shadow banking, where the feature of being outside standard regulation is that lending is fully collateralized.\\\");\\n       units.push(\\\"_The collateral question._ Who gets to determine what \\\\\\\\u2018assets\\\\\\\\u2019 are, and how they can be utilized for leverage? In capitalism, asset prices, and hence value as collateral, are linked to their capacity to generate future profit. Workers' primary asset - their capacity to work - is only collateral in the context of slavery and student debt. In the new economic space, agents' performances that create \\\\\\\\u2018value\\\\\\\\u2019 (as defined collectively by the network) forms the basis of collateral, for stake price is linked to value creation. In capitalism it is the capacity to create profit that defines stake as collateral; in postcapitalism, it is the capacity to create collectively defined value that defines stake as collateral. And because performances will be undertaken within non-extractive work relations, all participants have a stake and hence a claim to collateral.\\\");\\n       units.push(\\\"_The surplus question._ What proportion of output is in excess of the costs of producing it, and who lays claim to the excess? The former is a measurement question; the latter the social access (class) question. Historically the determination of surplus was a process of extraction. In slavery and feudalism the surplus is that output in excess of the costs of sustaining slaves or a peasant class of producers. It is predominantly a surplus in the form of goods and services. In capitalism surplus is a financial concept because it is implied that all the components of output and hence the \\\\\\\\u2018excess\\\\\\\\u2019 can be commensurated, via units of value.[25] Surplus takes the financial form of rent, interest or profit.[26] Postcapitalism opens the question of how a surplus is to be defined (how costs and outputs are to be specified and measured: units of value and the unit of exchange) and claims of access to this surplus. In particular, where value is not defined by reference to profit, (some part of) surplus may be attributable to a commons.\\\\\\\\n\\\\\\\\n[25] A unit of value will be explained in Chapter 6.3. Suffice it here to define it as a socially/ historically specific system of measurement.\\\\\\\\n [26] There can be an argument that the concept of \\\\\\\\u2018profit\\\\\\\\u2019 is not specific to capitalism; what is specific is the way profits are calculated. We have chosen to adopt the word \\\\\\\\u2018surplus\\\\\\\\u2019 in relation to the Economic Space Protocol to avoid ambiguity. See Appendix 5.2 for elaboration.\\\");\\n       units.push(\\\"_The \\\\\\\\u2018who gets to decide?\\\\\\\\u2019 question._ \\\\\\\\u2018Who has financial power?\\\\\\\\u2019 is the financial version of \\\\\\\\u2018class.\\\\\\\\u2019 In capitalism, wealth and power are expressed critically in the capacity to decree the issuance of money and the valuation of assets.[27] In postcapitalism, all agents can issue assets to be used as collateral, other agents in the network have the capacity to accept these assets as collateral, and all collateral can serve to back liquidity. Implicit here is the idea that a postcapitalism, when framed through finance, can be depicted as an economy of abundance. This is not in the sense that too many commodities are produced, or that no-one will want for anything, but that when \\\\\\\\u2018value\\\\\\\\u2019 has diverse forms (not just profit-based) and is determined via distributed processes, we will all discover an abundance of economic activity, verified by a plethora of economic data analytics, which was hitherto performed without social recognition, and thereby no doubt under-performed.\\\\\\\\n\\\\\\\\n[27] We note the blurring of the categories of money and assets. One form of blurring is between debt (money) and equity (assets) (e.g. convertible bonds). Another is found in central bank policies of Quantitative Easing, and the expanding range of assets central banks are taking onto their books in the name of \\\\\\\\u2018monetary policy.\\\\\\\\u2019 The blurring was noted by Myron Scholes (1997) in his Nobel Prize lecture.\\\");\\n       units.push(\\\"We have mentioned the speed of change in cryptoeconomic history. Decentralized Finance (DeFi) has already introduced stablecoins as mechanisms for token exchange rate stability with respect to fiat currencies and pooling mechanisms for stabilizing token prices. More recently, it is introducing to cryptoeconomics the possibilities of distributed banking and insurance: that assets need not lie idle, but can be mobilized for borrowing and lending and with mechanisms of insurance offered on the side. The emergence of a rapidly-growing market for Non-Fungible Tokens (NFTs) is further accelerating this development, creating marketable assets whose sale creates collateral for further rounds of lending. Lending is then giving rise to the potential for leverage: borrowing in order to take positions in markets. That, in turn, is opening up issues like collateral requirements with margin calls and default risk. Predictably, we are already seeing the issuance of derivative financial products like credit default swaps (CDS) and collateralized debt obligations (CDOs) designed to on-sell default risk from those who wish to avoid it to those prepared to carry it for a fee.[28]\\\\\\\\n\\\\\\\\n[28] Toporowski (2010: 12) puts it succinctly: \\\\\\\\u2018in an era of finance, finance mostly finances finance.\\\\\\\\u2019\\\");\\n       units.push(\\\"We can note in passing that these latter developments have the hallmark of the sorts of derivative products being traded in the lead-up to the 2007 global financial crisis. Whether they are pointing to crypto\\\\\\\\u2019s \\\\\\\\u2018Minsky moment\\\\\\\\u2019[29] \\\\\\\\u2018is another matter, for the products themselves were never the source of crisis; it was their governance, expressed in pricing models and the conditions of access to leverage they were built upon. It is not surprising, therefore, that the emergence of \\\\\\\\u2019crypto-derivatives\\\\\\\\u2019 and a focus on DeFi governance are emerging concurrently. Whether they are emerging compatibly remains to be seen.\\\\\\\\n\\\\\\\\n[29] Named after economist Hyman Minsky, a \\\\\\\\u2018Minsky moment\\\\\\\\u2019 is a sudden collapse of asset values which becomes self-perpetuating. Collapses in asset values collapses the value of collateral leading to margin calls and the sudden loss of capacity to support loans.\\\");\\n       units.push(\\\"Nonetheless, we should note the enormous potential in the development of NFTs as derivatives on performances. The current focus in relation to NFTs creating a market for digital images should not obscure the potential to frame performances \\\\\\\\u2013 value creating processes \\\\\\\\u2013 as NFTs, and hence the ownership of NFTs as a financial exposure to the processes of future value creation. The relative simplicity of their issuance could open up a vastly new vision of how NFTs could be central tools of social innovation.\\\");\\n       units.push(\\\"What sorts of derivative products might be exchanged in the new economic space? The answer is that there could be any and all of the above: agents can offer for exchange whatever they decide to. Governance of the network must be cognisant of the potential for \\\\\\\\u2018Minsky moments.\\\\\\\\u2019 In general, our interest is in derivatives that embed the social. We invoke, after Randy Martin, the \\\\\\\\u2018social logic of the derivative.\\\\\\\\u2019[30] As \\\\\\\\u2018the social\\\\\\\\u2019 in the new economic space is conceived as a network, we will use the term \\\\\\\\u2018network derivatives.\\\\\\\\u2019 This means taking the logic of financial derivatives (futures, options and swaps)[31] and giving them network application as a collective value creating process. Here, the emphasis is on decomposed \\\\\\\\u2018things\\\\\\\\u2019 conventionally conceived as singular into their exposures (information, potentials and risks) so that they may be reconfigured as new creative directions. They enable the network to take positions on what counts as value, what counts as collateral and how liquidity creates social connection.\\\\\\\\n\\\\\\\\n[30] Randy Martin was a friend and mentor to many of us in ECSA. He has inspired our vision and our analytical techniques. Randy died before the real emergence of crypto technology. His brilliance would have at once embraced the social and political potential of cryptomedia choreographies. See, for example, Martin (2013, 2014a, 2014b, 2015) and Lee and Martin (2016).\\\\\\\\n [31] In finance, a derivative involves the purchase of an exposure to the \\\\\\\\u2018value\\\\\\\\u2019 of an underlying asset without (necessarily) purchasing ownership of the underlying asset itself. Derivatives therefore trade risk positions: the risk of the price of a barrel of oil going up or down, without trading the barrel of oil. Options, as critical forms of derivative, enable the coverage of risk in one direction, but not the other: they can insure against prices going up, _or_ they can insure against prices going down.\\\");\\n       units.push(\\\"In particular, our financial approach to derivatives requires designing the optimal combination of price-determination conditions (what conventional economics calls decision-making under uncertainty) and flow-of-value conditions (what Marxism calls accumulation). When we get that balance right, we can target the ways to depict positions (decision-making) on social volatility (a flow). In effect, we are defining the potential of a spread in which agents risk. Expressed as stake choices and value creation, it sees agents making _individual_ decisions to embrace a _social_ conception of what is valuable.\\\");\\n       units.push(\\\"THE IMMEDIATE PROPOSAL: LIVING IN THE SPREAD\\\");\\n       units.push(\\\"Our proposal is framed in the spread between the network capacities of the current capitalist economic system and those of the Economic Space Protocol.\\\");\\n       units.push(\\\"We have seen people active in art and design, the p2p movement and open source software engineers show close interest in our proposal, and we feel confident that the appeal of our vision will spread as its insights are understood. The proposition is not that we will simply \\\\\\\\u2018transfer\\\\\\\\u2019 to the new economy, but that we can spend part, and a growing part, of our economic lives in the new economic space.\\\");\\n       units.push(\\\"Financially, we can frame capitalism and postcapitalism as a spread. Investing in the new economic space is trading the spread, taking a long position of an alternative to capitalist modes of valuing. But we also depict it as a short position: those who recognize pointers to capitalism\\\\\\\\u2019s loss of legitimacy may want to place a bet against capitalism. Bitcoin may be a short position on capitalist money. Our proposal offers a short position on the capitalist economy and culture.\\\");\\n       units.push(\\\"Our aspiration is that people will traverse the spread by being drawn towards participation in our postcapitalist vision and, in so doing, will in some degree reduce their current engagement with capitalism. Our hope is that more and more people will spend more and more of their time engaging with and through the Economic Space Protocol. But in reality, we will be _living inside the spread._\\\");\\n       units.push(\\\"But we must conclude this introduction with a caution. All the above propositions assume the citizen capacities of liberal democracies and, within those democracies, there is the presumption that states will not regulate so as to subvert the development of proposals such as those of the new economic space. The threat of subversion-by-regulation points to a general political struggle for the right to think and organize differently, without denying the importance of the principle of the rule of law. We also understand that, in certain societies, distributed protocols, for all their internal stateless organization, are under the surveillance and control of centralized states intent on enforcing ideological compliance. In these places, there is no capacity to \\\\\\\\u2018live in the spread.\\\\\\\\u2019 These serious concerns point to a politics-beyond-choice; to forms of fascism. We emphasize our opposition to these regimes, and note that the struggle against them is a struggle for us all.\\\");\\n       units.push(\\\"DESIGN PRINCIPLES OF THE NEW ECONOMIC SPACE\\\");\\n       units.push(\\\"The socioeconomic principles of the new economic space are: \\\\\\\\n- _Postcapitalist._ Economic protocols that can enable a progressive development beyond capitalism that use the devices of markets and finance to enable interoperability between contemporary capitalism and the new economic space. \\\\\\\\n- _Open._ An internet-native economic system with internet architecture; with no central data broker, host or owner. \\\\\\\\n- _Unified._ The systemic layer of unification becomes the economic grammar (the Economic Space Protocol) that enables transparent economic communication and empowers every agent equally. The social layer of unification to be designed through financial contracts. \\\\\\\\n- _Power-symmetric._ All agents in the system have the same default capacities (they can fully express through all the capacities of a shared economic language). This is the precondition for production to be organized through reciprocal economic relations and the pursuit of collectively-agreed outcomes, devoid of embedded or encoded extractive relations. \\\\\\\\n- _Socially valuable._ The capacity to express both tangible and intangible production processes by encoding them as \\\\\\\\u2018performances,\\\\\\\\u2019 and to benchmark all performances to an agreed measure of the social good. \\\\\\\\n- _Harnessing change._ Open-ended exposure to the potential of change.\\\");\\n       units.push(\\\"This entails embracing and harvesting volatility; not designing it away. \\\\\\\\n- _Equitable._ The risks and rewards of innovation must be distributed across the network in intentional and rightful ways. \\\\\\\\n- _Risk-sharing._ We aspire to \\\\\\\\u2018risk together,\\\\\\\\u2019 but in a measured way \\\\\\\\u2013 in the sense of being both quantified and strategic. The long position may be risk taking, but the strategy itself needs to be low risk. This implies focussing on both the upside and downside of risk and the desire for individual choices within a \\\\\\\\u2018together\\\\\\\\u2019 strategy. \\\\\\\\n- _Economically interoperable._ The new economy will require a bootstrapping phase, centered on the conversion of capital market funds denominated in fiat into tokens to provide startup funds to new agents. Current economic forms can still be encoded in the new economic space, yet they can begin to actualize and experiment with the new tools.\\\");\\n       units.push(\\\"SOME KEY DISTINCTIONS BETWEEN THE ECONOMIC SPACE PROTOCOL AND OTHER PARADIGMATIC BLOCKCHAIN ARCHITECTURES\\\");\\n       units.push(\\\"SECRECY VERSUS PRIVACY[32]\\\\\\\\n\\\\\\\\n[32] See L\\\\\\\\u00F3pez, J. \\\\\\\\u2018DJS: Distributed Javascript.\\\\\\\\u2019 http://djs.manifold.one\\\");\\n        // 116\\n    }\\n    function set(uint256 location, string calldata _unit) external {\\n        units[location] = _unit;\\n    }\\n    function getById(uint256 location) external override returns (string memory unit) {\\n        return units[location];\\n    }\\n\\n}\"\r\n    }\r\n  },\r\n  \"settings\": {\r\n    \"optimizer\": {\r\n      \"enabled\": false,\r\n      \"runs\": 200\r\n    },\r\n    \"outputSelection\": {\r\n      \"*\": {\r\n        \"*\": [\r\n          \"evm.bytecode\",\r\n          \"evm.deployedBytecode\",\r\n          \"devdoc\",\r\n          \"userdoc\",\r\n          \"metadata\",\r\n          \"abi\"\r\n        ]\r\n      }\r\n    },\r\n    \"libraries\": {}\r\n  }\r\n}}", "ABI": "[{\"inputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"constructor\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"location\",\"type\":\"uint256\"}],\"name\":\"getById\",\"outputs\":[{\"internalType\":\"string\",\"name\":\"unit\",\"type\":\"string\"}],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"location\",\"type\":\"uint256\"},{\"internalType\":\"string\",\"name\":\"_unit\",\"type\":\"string\"}],\"name\":\"set\",\"outputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"\",\"type\":\"uint256\"}],\"name\":\"units\",\"outputs\":[{\"internalType\":\"string\",\"name\":\"\",\"type\":\"string\"}],\"stateMutability\":\"view\",\"type\":\"function\"}]", "ContractName": "UnitStorage6", "CompilerVersion": "v0.8.4+commit.c7e474f2", "OptimizationUsed": "0", "Runs": "200", "ConstructorArguments": "", "EVMVersion": "Default", "Library": "", "LicenseType": "", "Proxy": "0", "Implementation": "", "SwarmSource": ""}