{"SourceCode": "{{\r\n  \"language\": \"Solidity\",\r\n  \"sources\": {\r\n    \"contracts/storage/IStorage.sol\": {\r\n      \"content\": \"pragma solidity ^0.8.4;\\n// SPDX-License-Identifier: GPL-3.0-or-later\\n\\n// https://soliditytips.com/articles/solidity-interface-interact-with-other-contracts/\\ninterface IStorage {\\n    function getById(uint256 id) external returns (string memory unit);\\n    // Add more function signatures as needed.\\n}\"\r\n    },\r\n    \"contracts/storage/unit/UnitStorage27.sol\": {\r\n      \"content\": \"     \\npragma solidity ^0.8.4;\\n// SPDX-License-Identifier: GPL-3.0-or-later\\nimport \\\"../IStorage.sol\\\";\\n\\ncontract UnitStorage27 is IStorage{\\n    string[] public units;\\n    \\n    // set to onlyOwner()\\n    // check if value exists - \\n    constructor(){\\n        // 498\\n       units.push(\\\"Economic agents initiate sales and purchases of goods and services. The tokens transacted in this process we call commodity tokens where the term \\\\\\\\u2018commodity\\\\\\\\u2019 means any good or service (tangible or intangible) produced for, and validated by, the network.[144]\\\\\\\\n\\\\\\\\n[144] See footnote 71 for our clarification of the use of the term \\\\\\\\u2018commodity.\\\\\\\\u2019\\\");\\n       units.push(\\\"In effect, the commodity token is designed to represent informational events that include, but are not limited to, the delivery of actual goods and service. In a single commodity exchange, price is just one data event, with the potential statistical significance of other data events awaiting discovery within the network. In a dynamic system of exchange, commodity transactions will be tied to credit issuance. A commodity token, verifying the creation of commodity value, can be utilized to settle credit. Credit tokens and commodity tokens will therefore often be paired in clearing a ledger entry.\\\");\\n       units.push(\\\"Each agent will be an issuer of its own commodity tokens and each commodity token offer attaches to a specific commodity output. The acceptance of the offer of a commodity, declared by issuance of a token in payment, means that every commodity has a matching token. Accordingly, the total of commodity tokens issued in a time period is equal to the total commodity exchange for that period. This is true for each individual agent and for the network as a total. When we separate the data into new commodities and re-circulated commodities, commodity token issuance can be used as a one proxy measure of a \\\\\\\\u2018fundamental value\\\\\\\\u2019 in the network (see Appendix 12.2).\\\");\\n       units.push(\\\"Commodity tokens have the following attributes: \\\\\\\\n- Their quantity is determined by the offers/matches of individual agents. \\\\\\\\n- Their long-term price is determined by, and a measure of, the _real_ output of an economic agent. \\\\\\\\n- They are priced through market offers, where the bid is the commodity token, and the ask is denominated in the unit of exchange. \\\\\\\\n- The risks of commodity production are carried by the direct producer; default risk is carried by the token holder.\\\");\\n       units.push(\\\"Figures 10.11 to 10.13 depict commodity exchange.[145] \\\\\\\\n[Figure 10.11 Agent publishes a commodity exchange offer] \\\\\\\\n[Figure 10.12 Network matches commodity exchange offer] \\\\\\\\n[Figure 10.13 Agent now has commodity X and network has commodity Y assets]\\\\\\\\n\\\\\\\\n[145] Perry Mehrling\\\\\\\\u2019s lectures on the \\\\\\\\u2018Money view\\\\\\\\u2019 make use of these types of diagrams. See http://sites.bu.edu/perry/\\\");\\n       units.push(\\\"EXCHANGES BETWEEN TOKENS\\\");\\n       units.push(\\\"The Economic Space Protocol sees different tokens having different roles in the network. But there will also be exchange relations across token types and a selection warrants particular note, as shown in Figure 10.4, to illustrate the meanings of cross-token transactions.\\\\\\\\n Figure 10.14 Cross-token exchanges \\\\\\\\nTwo simple points, among many, can be drawn from Figure 10.4. First, commodity tokens can be used for the acquisition of stake or other commodities, or they can be used to clear credit. The latter is the closest to a commodity token being thought of as \\\\\\\\u2018money.\\\\\\\\u2019 The network validation of an output does not generate cash, but the clearing of credit. Second, exogenous money (fiat or cryptocoins) can enter and leave the network as commodities. This means that fiat can be used indirectly for the purchase of stake or commodities or the clearing of credit, and commodity outputs can be conveyed to fiat. The exchange rate will be determined by offers on the network, and this will regulate the incentives to move assets between fiat and the Economic Space Protocol unit of exchange.\\\");\\n       units.push(\\\"THREE TOKEN CATEGORIES TO SERVE THREE ECONOMIC FUNCTIONS\\\");\\n       units.push(\\\"Figures 10.2 to 10.13 show sequences of token exchanges across token categories (commodity for credit, for example) as well as within token categories (for example commodity for commodity). We see in these diagrams that each token type plays a different role in the flow of assets in the network. Each token type holds, encoded in its programming as a financial instrument (i.e. a smart contract), certain rights that are distinct. Each token type serves a different purpose. In summary: \\\\\\\\n- _Stake tokens are shares of an economic agent\\\\\\\\u2019s output._ They give the user the capacity to receive dividends through their application programming interface (API). It is an expression of accumulated ownership. Its ledger entry records a stock, and the attached exposure to the risks of growth and contraction in the value of that stock.[146] Furthermore, stake tokens serve as communication pipes, utilized for agents\\\\\\\\u2019 economic peering. \\\\\\\\n- _Liquidity tokens grant the right to clear_. This right can be verified through their AIP. If a clearance is successful, a liquidity token with any remainder is returned. It is an exposure to future potential states, but without carrying the risks of those states (except for default). It involves the advancement (and writing down) of credit to meet the immediate liquidity requirements of the network, both those between agents to maintain their accumulation and the matching and netting requirements of achieving settlement in exchange. \\\\\\\\n- _Commodity tokens are an exposure to an offer for an agreed output._ They are the most programmable token type, and can hold any interaction logic and carry any given rights. It comes into being only at the completion of a match, as verification of \\\\\\\\u2018what already is.\\\\\\\\u2019 This enables it to connect to measures of fundamental value as a \\\\\\\\u2018real abstraction.\\\\\\\\u2019\\\\\\\\n\\\\\\\\n[146] Flows of stake in a secondary market occur via commodity tokens, where stake is now a \\\\\\\\u2018commodity\\\\\\\\u2019 to be exchanged.\\\");\\n       units.push(\\\"It is only with these three token types (and the reciprocal flows they stand for, that the Economic Space Protocol is able to articulate a self-reproducing economic system.\\\");\\n       units.push(\\\"DYNAMICS OF A TOKENIZED NETWORK\\\");\\n       units.push(\\\"THREE CIRCUITS OF VALUE\\\");\\n       units.push(\\\"The Economic Space Protocol is styled to give precision to the roles of different tokens, but there is a need to show how these token types, and the economic processes they express, relate together in the social process of \\\\\\\\u2018value in movement.\\\\\\\\u2019[147] In this chapter we explore the economy in the style of a circular flow. This style depicts the economy as a sequence of critical inter-connections, located in space time, that combine to secure the conditions for the reproduction of the flow. A circular flow should not depict the protocol as a closed system (there can be interaction with capitalist markets at any point). Nor should the flow be presumed automatic. Any break in the flow is a possible interruption to the system, but they should be presumed and incorporated.\\\\\\\\n\\\\\\\\n[147] Marx (1885: ch.4), described capital as a social relation of value:\\\\\\\\n It is a movement, a circulatory process through different stages, which itself in turn includes three different forms of the circulatory process. Hence it can only be grasped as a movement, not as a static thing.\\\");\\n       units.push(\\\"Nonetheless, the definition of a sustainable network is that it has the capacity to generate its own conditions of reproduction. Put simply, if the network requires continuous injections of outside money in order to reproduce (after an initial bootstrapping phase as described in Appendix 1.2), it cannot have aspirations of being a protocol on which to build a postcapitalist economy. Yet that should not gainsay the expectation that outside money _will_ enter the network; but it will do so as a commodity, not as \\\\\\\\u2018money,\\\\\\\\u2019 and it will be to expand the network, not reproduce it.\\\");\\n       units.push(\\\"Framing an economy as a circular flow has a long history in economics, starting most prominently from Fran\\\\\\\\u00E7ois Quesnay\\\\\\\\u2019s _Tableau \\\\\\\\u00C9conomique_ (1758), through Marx\\\\\\\\u2019s circuits of capital in Volume II of _Capital_ (1885) (explicitly connected by Marx to Quesnay), Luxemburg\\\\\\\\u2019s _Accumulation of Capital_ (1913), Sraffa\\\\\\\\u2019s _Production of Commodities by Means of Commodities_ (1960), Leontiev\\\\\\\\u2019s input-output model (1966) and interpretations of Keynesian multiplier effects (sometimes said to have been derived from Marx). None of these depictions could be called a \\\\\\\\u2018formal model,\\\\\\\\u2019 at least not in the current sense in which that term is applied, but they are designed to be quantifiable (in a way that so much current discussion of the \\\\\\\\u2018circular economy\\\\\\\\u2019 is not). Our exposition here is conceived in that long tradition and offers a heuristic device to show patterns of inter-connectedness (and possible disconnection) in the economy.\\\");\\n       units.push(\\\"We take our mode of exposition from Marx\\\\\\\\u2019s (1885, Part I) depiction of circuits of capital. For Marx, these components of the circuit are money capital, commodity capital and industrial capital. All can be thought of as essential elements of a self-reproducing system, but they are also three ways of looking at an overall circular process that involves all of money, industry and commodities.[148]\\\\\\\\n\\\\\\\\n[148] Marx saw these circuits as describing the path of individual companies and also the economy as a whole. The latter would be seen as a set of intersecting circuits where the output of one company is the input of another; the money revenue of one industrial process is shifted to fund another, etc.. These intersections are the focus of Leontiev\\\\\\\\u2019s input-output analysis. We will not extend our analysis in this way, but it is consistent with that project.\\\");\\n       units.push(\\\"In our depiction, the stages of the circular flow are: performance (Pe), collateral (Co) and credit (Cr). All circuits require each of these components. As a circuit, there is no original starting or end point, but when we describe the circuit by starting an explanation from each different point, and look at the way in which the circuit reproduces that nominated starting point, different issues of emphasis become prominent.\\\");\\n       units.push(\\\"So we define: \\\\\\\\n- _The Performance Circuit (Pe\\\\\\\\u2013Co\\\\\\\\u2013Cr\\\\\\\\u2013Pe)_. This circuit describes the requirements for a performance to be reproduced (which must include not just the act of performing, but also the validation of those performances by the network \\\\\\\\u2013 a process we refer to, for shorthand, as \\\\\\\\u2018production and consumption\\\\\\\\u2019). \\\\\\\\n- _The Collateral Circuit (Co\\\\\\\\u2013Cr\\\\\\\\u2013Pe\\\\\\\\u2013Co)_. This circuit describes the requirements for collateral to be reproduced (which must include the reproduction of the stake portfolio that forms the basis of collateral). \\\\\\\\n- _The Credit Circuit (Cr\\\\\\\\u2013Pe\\\\\\\\u2013Co\\\\\\\\u2013Cr)_. This circuit describes the requirements for network credit to be reproduced (which must include the process of credit clearing from the previous \\\\\\\\u2018round\\\\\\\\u2019 of credit).\\\");\\n       units.push(\\\"Figure 11.1 shows a circuit in the new economic space. The outer ring is the \\\\\\\\u2018real\\\\\\\\u2019 economy of the flow between performances, collateral and credit. The inner circle shows the reciprocal token movements of commodity tokens, stake tokens and liquidity tokens. Consistent with our explanation of tokens and ledgers (Chapter 10), the \\\\\\\\u2018real\\\\\\\\u2019 processes flow in one direction (clockwise) and their reciprocal token issuance flows in the opposite direction (anticlockwise). \\\\\\\\n[Figure 11.1 Circuits in the New Economic Space]\\\");\\n       units.push(\\\"THE PERFORMANCE CIRCUIT: THE CIRCUIT OF VALUE CREATION\\\");\\n       //517\\n    }\\n    function set(uint256 location, string calldata _unit) external {\\n        units[location] = _unit;\\n    }\\n    function getById(uint256 location) external override returns (string memory unit) {\\n        return units[location];\\n    }\\n\\n}\"\r\n    }\r\n  },\r\n  \"settings\": {\r\n    \"optimizer\": {\r\n      \"enabled\": false,\r\n      \"runs\": 200\r\n    },\r\n    \"outputSelection\": {\r\n      \"*\": {\r\n        \"*\": [\r\n          \"evm.bytecode\",\r\n          \"evm.deployedBytecode\",\r\n          \"devdoc\",\r\n          \"userdoc\",\r\n          \"metadata\",\r\n          \"abi\"\r\n        ]\r\n      }\r\n    },\r\n    \"libraries\": {}\r\n  }\r\n}}", "ABI": "[{\"inputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"constructor\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"location\",\"type\":\"uint256\"}],\"name\":\"getById\",\"outputs\":[{\"internalType\":\"string\",\"name\":\"unit\",\"type\":\"string\"}],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"location\",\"type\":\"uint256\"},{\"internalType\":\"string\",\"name\":\"_unit\",\"type\":\"string\"}],\"name\":\"set\",\"outputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"\",\"type\":\"uint256\"}],\"name\":\"units\",\"outputs\":[{\"internalType\":\"string\",\"name\":\"\",\"type\":\"string\"}],\"stateMutability\":\"view\",\"type\":\"function\"}]", "ContractName": "UnitStorage27", "CompilerVersion": "v0.8.4+commit.c7e474f2", "OptimizationUsed": "0", "Runs": "200", "ConstructorArguments": "", "EVMVersion": "Default", "Library": "", "LicenseType": "", "Proxy": "0", "Implementation": "", "SwarmSource": ""}