{"SourceCode": "{{\r\n  \"language\": \"Solidity\",\r\n  \"sources\": {\r\n    \"contracts/storage/IStorage.sol\": {\r\n      \"content\": \"pragma solidity ^0.8.4;\\n// SPDX-License-Identifier: GPL-3.0-or-later\\n\\n// https://soliditytips.com/articles/solidity-interface-interact-with-other-contracts/\\ninterface IStorage {\\n    function getById(uint256 id) external returns (string memory unit);\\n    // Add more function signatures as needed.\\n}\"\r\n    },\r\n    \"contracts/storage/unit/UnitStorage17.sol\": {\r\n      \"content\": \"     \\npragma solidity ^0.8.4;\\n// SPDX-License-Identifier: GPL-3.0-or-later\\nimport \\\"../IStorage.sol\\\";\\n\\ncontract UnitStorage17 is IStorage{\\n    string[] public units;\\n    \\n    // set to onlyOwner()\\n    // check if value exists - \\n    constructor(){\\n        // 307\\n        units.push(\\\"Hence, the value of the commodity token is that it is the means by which agents party to the chain of performances can clear credit (which has been issued against stake; see below). How those shares are divided is contractually determined at each link in the chain. When an individual \\\\\\\\u2018P\\\\\\\\u2019 is many links away from \\\\\\\\u2018C,\\\\\\\\u2019 its share of the issued commodity token may be relatively small; conversely, an individual \\\\\\\\u2018P\\\\\\\\u2019 may form a link in many chains, and thus access a share of commodity tokens from many sources.\\\");\\n        units.push(\\\"Further, commodities may combine with performances to create higher-level commodities as depicted in Figure 4.4. \\\\\\\\n[Figure 4.4 Combined performances] \\\\\\\\nReading from right to left, realization of the value of C1 triggers the issuance of a commodity token and hence a counterflow of liquidity clearing revenue to the owners of P3in recognition of their contribution to commodity value. When the counterflow reaches C2, the direct benefits accrue to the owner of C2, though the network acknowledgment of the contribution to value of C2 also flows through to the P2 and P3 levels, for their indirect contribution to C1. Each \\\\\\\\u2018level\\\\\\\\u2019 of claim on the value of C1 is contractually negotiated with the level above. This emphasizes that the conversion of performances (or combinations of performances) into commodities may be seen as the end of a particular performance chain, but new chains may emerge out of commodities, creating more complex commodities. The relation between performances and commodities comes to depict a Leontief-style input-output model.\\\");\\n        units.push(\\\"STAKE: THE KEY TO VALUE\\\");\\n        units.push(\\\"INTRODUCTION\\\");\\n        units.push(\\\"Reciprocal staking involves agents investing in the performances of others by relinquishing stake in themselves. But it is more than simply each agent acquiring a portfolio of assets with diversified risk. Staking is the way in which agents and the network as a whole commit to a future, by backing proposals to create new economic value. Without a pre-specified, external notion of value (e.g. by reference to profit) staking immediately opens an economic and social imaginary of what the priorities of that future could be, both individually and collectively. It gives the network a dynamic of growth, disruption and realignment, and the collective, exploratory choice of direction.\\\");\\n        units.push(\\\"The process of agents in a network taking stake in each others\\\\\\\\u2019 performances could be subject to a range of economic and social interpretations. Is it a petit bourgeois (small business) stock exchange, with an extractive logic? So does it imply a logic of some agents devouring others and an inevitable polarization of wealth? If posed outside the Economic Space Protocol, this is a possible meaning.\\\");\\n        units.push(\\\"In the context of the Economic Space Protocol, staking points in a different direction, although partial parallels with a capitalist stock exchange should be acknowledged, and the contrasts should be drawn to make the differences stark. (Terminologically, we use the word \\\\\\\\u2018stake\\\\\\\\u2019 in the Economic Space Protocol and \\\\\\\\u2018stock\\\\\\\\u2019 in relation to the capitalist stock market.) Four key points of comparison feature prominently in this chapter.\\\");\\n        units.push(\\\"First, unlike the stock market, the market for stake involves _reciprocal_ investing. Agents enter the network not with a quantity of money with which to acquire stake in others, nor by offering themselves as wage workers (both of which would then play out an extractive logic of growing wealth inequality), but with proposals for performances or with propensity to participate in others' performances actively and/or financially. We see a shift towards what Marx called \\\\\\\\u2018free association\\\\\\\\u2019 and individual \\\\\\\\u2018self activity.\\\\\\\\u2019[90] The role of the Commons in expressing this propensity towards postcapitalism, is explored in Chapter 6.\\\\\\\\n\\\\\\\\n[90] For Marx, this stage was directly contingent on advanced technology developed in capitalism and involved the proletariat freeing itself of capitalist class relations so that this individual expressiveness and free association could flourish. This technological development and its social conditions Marx referred to the \\\\\\\\u2018force of production\\\\\\\\u2019 or \\\\\\\\u2018productive forces.\\\\\\\\u2019 In the words of Marx:\\\\\\\\n The appropriation of these forces [of production] is itself nothing more than the development of the individual capacities corresponding to the material instruments of production. The appropriation of a totality of instruments of production is, for this very reason, the development of a totality of capacities in the individuals themselves . . . .\\\\\\\\n This appropriation is further determined by the manner in which it must be effected through a union Only at this stage does self-activity coincide with material life, which corresponds with the development of individuals into complete individuals and the casting off of all natural limitations. (Marx 1854, Part 1, Section D)\\\");\\n        units.push(\\\"Second, the criteria of performance success are different for stock and for stake. In broad terms, in capitalist countries, corporate governance legislation requires making profit to be a priority objective,[91] with just a small amount of wriggle room to enable recognition of so-called social, environmental and governance input (so-called ESG accounting). In the new economic space, the goals of investors and performances are not pre-specified. We refer here not to the recognition that some investors may be altruistic, and not profit-driven, for that also happens in capitalism. Rather, the network\\\\\\\\u2019s goals are determined in distributed processes and subject to change according to the changing view of the network.\\\\\\\\n\\\\\\\\n[91] There is nonetheless ambiguity here, especially about how profit is defined and the time horizon for profit maximization.\\\");\\n        units.push(\\\"Third, stock and stake involve different risk allocations. New stake is created and issued as part of a mutual stakeholding transaction. In effect, each party to the transaction, and their respective networks, are underwriting each others\\\\\\\\u2019 issuance. As stake forms collateral for credit, the parties are also underwriting each others\\\\\\\\u2019 credit issuance. The intention, as with stock market equity, is to expand net value creation and hence the net value of stake itself. Although new stake issuance \\\\\\\\u2018dilutes\\\\\\\\u2019 the proportion of total stake held by extant stakeholders, it is associated with an expansion of the performance potential of the underlying assets. The new stake therefore opens a new risk (the expansion) but also a shared risk (the underwriting).\\\");\\n        units.push(\\\"Fourth, mutual stakeholding transactions are strategic and continual and they convey critical information to the rest of the network. Issued stake quantity, price and transaction data are essential feedback, for they signal network perceptions (current and anticipated future) of the value creation capacities of each performance. Those perceptions about network recognition can change. Agents may seek to realign their stake portfolios by acquiring more stake or they may partially or fully exit a staking relationship. This depiction may also describe the decision-making process of a hedge fund or venture capitalist, but mutual staking makes both the risks and the consequences of staking decisions markedly different.\\\");\\n        units.push(\\\"Behind staking are acts of exchange: in transacting stake, there will be offers and matches recorded on a network ledger.[92] It follows that we are starting to see the conditions for the emergence of tokens as representations of these transactions. However, the consideration of tokens in relation to staking will be delayed until the social relations of staking are explained. This analytical sequence means that, at this stage of the analysis, there is not yet an elaborated unit of exchange in the network (see Chapters 7.2 and 9), so staking, as considered in this chapter, involves the determination only of relative values (ratios or equivalences) and just a conceptual reach to how they might be made operational as absolute values.\\\\\\\\n\\\\\\\\n[92] The mechanics of this process are examined in Chapter 10.2.\\\");\\n        units.push(\\\"THE CIRCULAR LOGIC OF RECIPROCAL STAKING[93]\\\\\\\\n\\\\\\\\n[93] See L\\\\\\\\u00F3pez, J. \\\\\\\\u2018Market shares: Distributed Staking Protocol.\\\\\\\\u2019 http://marketshares.manifold.one\\\");\\n        units.push(\\\"The four points of difference between postcapitalist staking and capitalist stock purchasing point to two leading questions of the new economic space: first, how do we understand the rates at which agents will acquire stake in others and give up stake in themselves; and second, if expected profit is not the calculus that motivates staking decisions, what is?\\\");\\n        units.push(\\\"Staking ratios \\\\\\\\nWhen agents acquire stake in others by giving up stake in themselves, a critical issue is the decision of how much each invests in the other. Reciprocal staking will not simply involve Agent A acquiring one unit of stake in each of B and C and Agent B one unit of stake in A and C, etc.. It is the _ratios of allocation_ that prove critical: how much stake A must be given up in order to acquire a unit of stake in B may be different from how much A is ready to give up to acquire a unit of stake in C. What these ratios reveal is the network\\\\\\\\u2019s _relative_ view of each agent\\\\\\\\u2019s past and expected performances: those with the highest ratio (who have received the largest amount in stake offers, relative to others, and whose stake price is rising) are deemed the greatest contributors to value creation (see Chapter 7.3 for the process). The higher your ratio, the more the rest of the network values your performance relative to other performances. Reciprocal staking is the determination of these ratios. The process by which these ratios appear as absolute numbers is not considered until Chapter 8.4, for credit and liquidity are key to this development.\\\");\\n        units.push(\\\"Even though the differences in prices between the stake tokens of different agents are vital to the system\\\\\\\\u2019s functioning in the short and medium terms, as means of empowering agents proportionally to the perceived value of their performances, they may create imbalances in the long term. Therefore, depending on the nature of the performance, the economic space can introduce inequality mitigation policies. One such policy is stake decay: as the stake held by an agent increases as a determined rate or to a determined level, some part of that stake will start decaying into the network (other stakeholders or the commons), according to a function. Stake decay or other redistribution policies are a design choice for every economic space and something to be considered by agents when deciding to participate.\\\");\\n        units.push(\\\"Decisions to stake other agents\\\\\\\\u2019 performances \\\\\\\\nStaking involves investing in the inter-temporal contingencies of individual performances and how they are valued by the network. We can think of it as a sequence of three questions faced by an agent considering proposing a performance of whether to match another agent\\\\\\\\u2019s staking offer: \\\\\\\\n- what they would like to see happen in the future. \\\\\\\\n- what they think is likely to happen in the future. \\\\\\\\n- how they value what happens in the future and the past.\\\");\\n        units.push(\\\"The first of these - what would be good to happen - is an _aspirational_ perspective. It invokes an emotional response to investing. Agents seek to author performances and stake the performances of other agents to generate outputs they would like generated by the network: what they individually think creates \\\\\\\\u2018value.\\\\\\\\u2019\\\");\\n        units.push(\\\"The second \\\\\\\\u2013 what is likely to happen \\\\\\\\u2013 is a _predictive_ perspective. It invokes a calculative response to investing. It involves each agent positioning their own aspirations of performance and staking in the context of expectations of the network as a whole. It invokes a competitive response to investing. Indeed, if this is where our analysis stops, staking would be no more than simply financially positioning on the mood of the market. It would, to invoke Keynes\\\\\\\\u2019 critique of stock markets, involve placing bets on what other people think will be successful. Keynes\\\\\\\\u2019 critique is considered directly in Appendix 5.1\\\");\\n        units.push(\\\"The third \\\\\\\\u2013 interpreting the network\\\\\\\\u2019s response to performances \\\\\\\\u2013 is an _evaluative_ perspective. It invokes a social response to investing (see Chapter 4.4 and Appendix 4.1). It reveals a network perspective on which performances end up creating value in the network.\\\");\\n        //326\\n    }\\n    function set(uint256 location, string calldata _unit) external {\\n        units[location] = _unit;\\n    }\\n    function getById(uint256 location) external override returns (string memory unit) {\\n        return units[location];\\n    }\\n\\n}\"\r\n    }\r\n  },\r\n  \"settings\": {\r\n    \"optimizer\": {\r\n      \"enabled\": false,\r\n      \"runs\": 200\r\n    },\r\n    \"outputSelection\": {\r\n      \"*\": {\r\n        \"*\": [\r\n          \"evm.bytecode\",\r\n          \"evm.deployedBytecode\",\r\n          \"devdoc\",\r\n          \"userdoc\",\r\n          \"metadata\",\r\n          \"abi\"\r\n        ]\r\n      }\r\n    },\r\n    \"libraries\": {}\r\n  }\r\n}}", "ABI": "[{\"inputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"constructor\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"location\",\"type\":\"uint256\"}],\"name\":\"getById\",\"outputs\":[{\"internalType\":\"string\",\"name\":\"unit\",\"type\":\"string\"}],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"location\",\"type\":\"uint256\"},{\"internalType\":\"string\",\"name\":\"_unit\",\"type\":\"string\"}],\"name\":\"set\",\"outputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"\",\"type\":\"uint256\"}],\"name\":\"units\",\"outputs\":[{\"internalType\":\"string\",\"name\":\"\",\"type\":\"string\"}],\"stateMutability\":\"view\",\"type\":\"function\"}]", "ContractName": "UnitStorage17", "CompilerVersion": "v0.8.4+commit.c7e474f2", "OptimizationUsed": "0", "Runs": "200", "ConstructorArguments": "", "EVMVersion": "Default", "Library": "", "LicenseType": "", "Proxy": "0", "Implementation": "", "SwarmSource": ""}