// SPDX-License-Identifier: MIT

pragma solidity ^0.8.0;

/// @title: Sweet  Delusions
/// @author: manifold.xyz

import "./manifold/ERC721Creator.sol";

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//                                                                                                                                               //
//                                                                                                                                               //
//                                                                                                                                               //
//        ,𝓢𝓢𝓢~~\                                         𝓽𝓽                                                                                //
//        𝓢𝓢𝓢𝓢    𝔀𝔀𝔀    𝔀     /  𝓮𝓮𝓮~~𝓮𝓮   𝓮𝓮𝓮~~𝓮𝓮  _𝓽𝓽𝓽__                                                                 //
//        `𝓢𝓢𝓢𝓢    𝔀𝔀𝔀  𝔀𝔀𝔀 /  𝓮𝓮𝓮𝓮  𝓮𝓮𝓮 𝓮𝓮𝓮𝓮  𝓮𝓮𝓮  𝓽𝓽𝓽                                                               //
//         `𝓢𝓢𝓢𝓢,   𝔀𝔀𝔀/𝔀𝔀𝔀/   𝓮𝓮𝓮𝓮__𝓮𝓮𝓮 𝓮𝓮𝓮𝓮__𝓮𝓮𝓮  𝓽𝓽𝓽                                                               //
//           𝓢𝓢𝓢𝓢    𝔀𝔀/  𝔀𝔀/    𝓮𝓮𝓮𝓮    , 𝓮𝓮𝓮𝓮    ,  𝓽𝓽𝓽                                                                     //
//        \__𝓢𝓢𝓢'     𝔀     𝔀      "𝓮𝓮___/   "𝓮𝓮___/   "𝓽𝓽_/                                                                          //
//                                                                                                                                               //
//        𝓓𝓓~-_             𝓁𝓁𝓁                 ,𝒾,                                                                                        //
//        𝓓𝓓   \   𝓮𝓮𝓮~~𝓮𝓮  𝓁𝓁𝓁 𝓾𝓾  𝓾𝓾  𝓢𝓢𝓢~\  "   𝓸𝓸𝓸~-_  𝓃𝓃-~𝓃𝓃  𝓢𝓢𝓢~\                                              //
//        𝓓𝓓    | 𝓮𝓮𝓮𝓮  𝓮𝓮𝓮 𝓁𝓁𝓁 𝓾𝓾  𝓾𝓾 𝓢𝓢𝓢𝓢   𝒾𝒾𝒾 𝓸𝓸𝓸𝓸   𝓸 𝓃𝓃  𝓃𝓃 𝓢𝓢𝓢𝓢                                       //
//        𝓓𝓓    | 𝓮𝓮𝓮𝓮__𝓮𝓮𝓮 𝓁𝓁𝓁 𝓾𝓾  𝓾𝓾  𝓢𝓢𝓢𝓢  𝒾𝒾𝒾 𝓸𝓸𝓸𝓸   | 𝓃𝓃  𝓃𝓃  𝓢𝓢𝓢𝓢                                       //
//        𝓓𝓓   /  𝓮𝓮𝓮𝓮    , 𝓁𝓁𝓁 𝓾𝓾  𝓾𝓾   𝓢𝓢𝓢𝓢 𝒾𝒾𝒾 𝓸𝓸𝓸𝓸   ' 𝓃𝓃  𝓃𝓃   𝓢𝓢𝓢𝓢                                         //
//        𝓓𝓓_-~    "𝓮𝓮___/  𝓁𝓁𝓁  "𝓾_-𝓾   \_𝓢𝓢𝓢 𝒾𝒾𝒾  "𝓸𝓸_-~  𝓃𝓃  𝓃𝓃 \_𝓢𝓢𝓢                                                 //
//                                                                                                                                               //
//                                                                                                                                               //
//                                                                                                                                               //
//                                                                                                                                               //
//                                                                                                                                               //
//                                                                                                                                               //
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


contract SD is ERC721Creator {
    constructor() ERC721Creator("Sweet  Delusions", "SD") {}
}