{"SourceCode": "{{\r\n  \"language\": \"Solidity\",\r\n  \"sources\": {\r\n    \"contracts/storage/IStorage.sol\": {\r\n      \"content\": \"pragma solidity ^0.8.4;\\n// SPDX-License-Identifier: GPL-3.0-or-later\\n\\n// https://soliditytips.com/articles/solidity-interface-interact-with-other-contracts/\\ninterface IStorage {\\n    function getById(uint256 id) external returns (string memory unit);\\n    // Add more function signatures as needed.\\n}\"\r\n    },\r\n    \"contracts/storage/unit/UnitStorage38.sol\": {\r\n      \"content\": \"     \\npragma solidity ^0.8.4;\\n// SPDX-License-Identifier: GPL-3.0-or-later\\nimport \\\"../IStorage.sol\\\";\\ncontract UnitStorage38 is IStorage{\\n    string[] public units;\\n    \\n    // set to onlyOwner()\\n    // check if value exists - \\n    constructor(){\\n        //714\\n       units.push(\\\"Protocol is a shared communication agreement: a named sequence of expressions, describing actions across real and virtual spaces to be performed to a completion. It is always about the organization of a potentiality space, about creating and organizing a space of potential action and thought. We think politics has moved on the level of protocols. It is the only way to organize and govern in the condition of the arbitrary sign (semiotic inflation; post-truth). For more see, Franco Berardi & Akseli Virtanen (2013): How to govern without meaning?\\\");\\n       units.push(\\\"Reciprocal stakeholding means an exchange of stake for stake. The economic networking primitive in the economic space protocol. You can create a network where each economic space connects with each other by exchanging stakes. Establishing a mutual stakeholding relationship, agents gain access to each other\\\\\\\\u2019s output and reciprocal credit lines, simultaneously creating a new networked monetary, production, investment, and risk-taking system. When liquidity is endogenous to the system \\\\\\\\u2013 stake offers an automatic credit line as its collateral \\\\\\\\u2013 you don\\\\\\\\u2019t want to sell your stake for money, because it offers no collateral. Rather you always seek to exchange your stake with those who directly benefit and thus value your production, because in this way you will benefit from their success, and also of your own indirectly. Reciprocal stakeholding (and not the sale price of your stake) is the way you capture the value of your own innovation: its value is what others give to it. Reciprocal stakeholding changes the playing field: the key relationships will be built not with those agents who have capital (money to invest), but with those in whose performances/innovations you can play a part. In the creation of reciprocal stakeholding relationships you are assessed as a subject of risk, and you assess others as subjects of risk. It opens the way for risking-together. It allows you to express what you value, what you want to make happen, with or by whom. It is our key econautic navigation, signaling and network primitive.\\\");\\n       units.push(\\\"A right gives an agent access to a resource available in a space or from another agent. It is a relative term i.e. does not exist in isolation. A right is always social and relational. It does not exit until it is transferred.\\\");\\n       units.push(\\\"Capitalism involves firms, and increasingly households, pricing risks and deciding which to hold and which to trade. As these risks are imposed increasingly on households - via precarious work and decreasing state provision of services - risking together involves a conscious choice to calculate and manage risks socially rather than individually. See Social derivate.\\\");\\n       units.push(\\\"A role is a bundle of responsibilities expressed as role functions that may be assigned to one or more economic space agents.\\\");\\n       units.push(\\\"We don\\\\\\\\u2019t approach security in the sense of hiding (anonymity, cryptographic security), but in the sense of a substrate that can have privacy and can be audited, in the sense of a source that can be relied upon and has integrity, social accountability and injects itself into social structures. This is possible because the only state that is shared globally is the protocol.\\\");\\n       units.push(\\\"Investing in crypto is both a short position and a long position. The short position is a bet that currently-known assets are entering a period of uncertain prices and potentially general decline. The case in the making: In a crisis almost all conventional assets are correlated. Where do you find non-correlated assets that are not just \\\\\\\\u2018gambling\\\\\\\\u2019? There is something new happening: asset market liquidity is now directly dependent on state funding and fiscal spending: liquidity is now a \\\\\\\\u2018public good\\\\\\\\u2019. Is it sustainable? Can central banks ever sell the trillions of dollars of private assets they now hold? Will governments ever pay down the fiscal deficits they have accumulated? Are there limits to the market/public acceptance of state money printing that underlies these state fiscal and monetary positions? And what happens when that limit approaches? As a short position crypto offers: (1) non-correlated assets that can have \\\\\\\\u2018real\\\\\\\\u2019 economic underliers and (2) an alternative economic domain not contingent on being denominated in state currencies and not reliant on state underwriting of liquidity. Investing in crypto is a bet against riding the volatility of a capitalist economy. It may still appear volatile, but a different volatility. The short position trades the spread of volatilities. In addition, the long position sees crypto not just as an alternative asset class, but as a different notion of an asset itself. This isn\\\\\\\\u2019t true of all cryptotokens, but only those with real underliers: tokens that link to processes of creation of something useful/valuable, be it block space, anchoring role in measurement, access, co-ordination or some other notions of \\\\\\\\u2018value\\\\\\\\u2019. Going long is a bet that these assets will grow in value not just because standard capital markets will see their value directly, but because participants in the cryptoeconomy will see value in their terms. The long position is about going outside what will in the old economic space standardly be recognised as value-creating, and see there are new notions of what is meant by value.NFTs opened the game precisely to this direction: people are excited about their newly discovered capacity to express what they consider valuable. If a critical mass of investors embraces these new notions, a unique process of accumulation has started. It is about re-evaluating value itself. The long position trades the spread of ways of evaluating value. So what do the short and long positions mean in terms of stability? In other words: Is volatility a problem? All markets need some volatility or they stagnate, but what is \\\\\\\\u2018reasonable\\\\\\\\u2019 or even \\\\\\\\u2018welcome\\\\\\\\u2019 volatility? It depends on how you measure. The short position is intentionally volatile with respect to the mainstream capital market \\\\\\\\u2013 that\\\\\\\\u2019s part of being an \\\\\\\\u2018alternative\\\\\\\\u2019 asset. In the long position some assets are designed to be innately stable, when defined by mainstream capital market norms. Stablecoins are designed to deliver such outcome: they embed incentives to buy when the price falls, and to sell when the price rises, so they can be made stable with respect to any nominated asset - the dollar, the euro, the S&P500, etc.). They don\\\\\\\\u2019t do anything in themselves, but they are a valuable bridge between two worlds. But different notions of \\\\\\\\u2018value creation\\\\\\\\u2019 can offer their own stability _with respect to their specified underliers_. Stability here is that cryptotoken\\\\\\\\u2019s prices hold a direct and predictable relation to the underliers of value creation. The key: measuring in a crypto units of account: a units that \\\\\\\\u2018describes\\\\\\\\u2019 and counts the cryptoeconomy. Token stability, when measured in terms of its own units, verifies the direct connection to the underlying value-creating performance. Current state currency links directly to a system based on profit \\\\\\\\u2013 so system liquidity means keeping stock prices high, banks profitable and firms profitable. This is where, and why, we see monetary and fiscal policy directed. Liquidity doesn\\\\\\\\u2019t link to the environment, scientific research or social welfare, or to a viable art communitsy \\\\\\\\u2013 indeed, with a fiat units of account, these must be sacrificed, at least in the short term, to secure fiat liquidity. But what if you design a money linked to other values? Where liquidity would be defined by the creation of different values, let\\\\\\\\u2019s say environmental value, and not \\\\\\\\u2018profit\\\\\\\\u2019 value? The design issue in these cryptoeconomies is how to secure buy-in on a different units of account, or mode of measurement, a different mode of accounting. We are born into a money system that values profit, but we must _make_ a money system that values social and environmental goals. We think crypto is not just an alternative asset class that cycles differently from the stock market, but an alternative notion of what an asset can be. It is not a bet on whether cryptoassets can look like mainstream assets, but that the spread between the two is not just a price spread denominated in fiat, but a mode-of-calculation spread as well. The long position is a bet that this mode-of-calculation spread will grow. And that more and more people will value the latter when they realize it is actually possible. When that happens, on which side of the spread do you want to be?\\\");\\n       units.push(\\\"Social derivatives are the new basic economic cells of post-capitalist society: a new social and relational form \\\\\\\\u2013 a form of risking and opening new opportunitsies together, and sharing its risks and upsides \\\\\\\\u2013 that characterizes the information age and which the existing economic grammar cannot express or understand (it only talks \\\\\\\\u201Ccommodity\\\\\\\\u201D, \\\\\\\\u201Ccompany\\\\\\\\u201D, \\\\\\\\u201Cemployee\\\\\\\\u201D and \\\\\\\\u201Cownership\\\\\\\\u201D). We are after a protocol designed for expressing such novel social-economic forms._ It is the way we express, by creating social derivatives._ They are our strategies for surfing the volatility of our precarious life and the joy in working together. Derivatives are much more than mere self-executing contracts that reduce the counterparty risk. They have a social logic that takes us beyond mere profit taking exchange and ownership as the form of sociality. The derivative is a logic that allows us to understand how heterogenous parts move together, how to value and sense the ways we are linked together, how value is made in motion and of change, and what it means to risk-together. ECSA (like all economic spaces) is a social derivative, a risk generating practice which arbitrages, speculates and leverages about being able to act together, on a certain opening. It makes our flows of stakes and risks intertwined in a way that articulates and expands the \\\\\\\\u201Cindebtness\\\\\\\\u201D that we are in this together.\\\");\\n       units.push(\\\"(1) Space is a programmable environment enabled by the Space programmable network grammar. It expands similar semantics to SmallTalk or Self by adding the agent and the offer as first class citizens of the language to become able to describe logical networks. This makes Space a powerful, capability oriented, multi-agent network programming environment. In other words, it is an organizational calculus to reason about and describe networks as relationships and interactions between agents within a space. Within Space\\\\\\\\u2019s semantics, \\\\\\\\u201Ca space\\\\\\\\u201D is a stateful container that binds resources and agents together, creating a relationship where their expressions and interactions gain a context. \\\\\\\\n(2) Space is a language to describe and define networks, multiagent interactions (or \\\\\\\\u201CDApps\\\\\\\\u201D), in a formal and mathematically modeled way (an organizational calculus). It makes networks, their tokens and agents and their logics - both economic and governmental - programmable. With Space language we can define who are the members of the network, what are the protocols the network follows, what are its records, names of things, how its state transitions take place. Space programs these relations statically in space, but also in time, meaning their progression, how they compute: the network (\\\\\\\\u201CDApp\\\\\\\\u201D) is a living creature, it acts, orients towards the world, it changes, it transforms, it evolves. \\\\\\\\n(3) A space, as a stateful place of interaction, that can be private or public. A space is a container that helps you organize and delineate your actions, and the resources necessary to perform them, as an ordered and coherent whole. The function, structure, and contents of your space is determined by your intent. To keep a space focused and effective, a space must contain only the resources required to perform its intent. A space contains Agents, Protocols and other Resources and defines authority boundary. A Space can be private or public. A private space is a space of interaction that is shared only across specific parties. A public space is a space of interaction that is shared with anyone who wants to participate in it / enter it. Agents have private space and are able to issue and hold rights, accept and receive offers, they maintain their own \\\\\\\\u201Cblockchain\\\\\\\\u201D. Protocol is the basis to create rights, it is the rules of interaction, a sequence of expressions that describes a state transition. Reference points to a resource, it is authority over the referenced resource and utilized in expressions. Offer is an expression of intent among agents, it creates a relationship, a space for the relationship, and composes into networks of relations. Accepting an offer creates a shared space. Space transfer enables moving from shared space to distributed space, from verifiable state to a verifiable protocol. We can understand space as a place of interaction among two or more agents, whom are able to change it only according to the rules of the protocols (the physics of the space). Spaces are stateful and always shared whether by the programmer and the runtime, the user and the application, two or more users, etc. \\\\\\\\n(4) Space is a grammar whose actions and words are: space, agent, offer, function, task, object, protocol, reference, record, channel, message \\\\\\\\n(5) Space is a protocol: a set of expressions following the Space language (that follows Space Protocol grammar), that clearly and unambiguously describe the reliable performance of actions among multiple space agents and affecting or requiring resources. It enables you to reliably collaborate with other space agents, organizing without necessarily favoring centralized and/or hierarchical structures. Although the protocol allows the expression and operation of legacy organizations if such is your desire. The Space protocol is designed to be substrate independent. It is our desire to see a wide array of implementations: As sophisticated as a programming language or as simple as a board game.\\\");\\n       units.push(\\\"Spread is a financial term for a gap \\\\\\\\u2013 usually between the bid (buy) and ask (sell) price where a profit can be made by trading the difference. In a social framing a spread is a gap between two positions that provides an opportunitsy to maneuver to make a gain, which can be also political, environmental, cultural, aesthetic. Our wager is that a clear spread will open between what the old and the new economic space make possible \\\\\\\\u2013 there is a clear difference in their expressive capacity, accessibility, stability, adaptability, scalability, privacy, functional equality and programmability. ECSA is a question: On which side of the spread do you want to be when more and more people start to realize how much more expressive the postcapitalist economic network is? The ECSA capital market facing token is a performance derivative designed to capture a share of the spread: it is a mechanism that rewards early participation and through which contributors can participate in the generation of the network. In other words, it offers tokenized exposure to the economic performance of the postcapitalist economic network, not ownership of the network infrastructure which is open and free to use. See Big put. See Living in the spread. See ECSA token.\\\");\\n       units.push(\\\"Where do you go when you want to dissent from state issued fiat currency, when you want to take a stand against the hierarchical social relations and destruction to the environment the fiat currency represents? Where do you go when you want to bet against it (short it), when you think it is a cultural-financial asset in decline, and you want to find new stability from a different set of economic and social relations? When fiat currencies face their next future crisis, we want to be talking already about what _new stabilities_ - new social relations, processes and goals that we believe should be constant; new metrics of stability - we are advocating. We think this is the real social potential of cryptoeconomy.\\\");\\n       units.push(\\\"Stake is an ownership of a financial exposure to the contingencies of a performance. It frames contingency as economic potentiality: it is a financial position on a performance. It creates a social relationship, through a set of rights, different to equity, but definitely invoking the skin in the game aspect. In a sense, it generalizes \\\\\\\\u201Cequity\\\\\\\\u201D into an economic connectivity pipeline through which information (e.g. dividends) can flow. Stakes are offered to the market, with no knowledge of which agent (prepared to accept the offer) will end up the owner, and can circulate in a secondary market. Buying stake in a performance is a way to signal the network what you want to make happen. Furthermore, the economic space protocol incentivizes participants to hold on to the network\\\\\\\\u2019s stake as a store of value. The network protocol financially recognizes stake as the preferred store of value in defining it as collateral for credit. In the process, credit takes a secondary monetary role; clearing it as soon as possible supersedes the agenda of storing it. Through stake, participant\\\\\\\\u2019s not only collaboratively build wealth through mutually staking and validating their performances but also get to define what counts as wealth. It is our key econautic navigation, signaling and network primitive. See Reciprocal stakeholding.\\\");\\n       units.push(\\\"Stakeholding is to postcapitalism, what equity is to capitalism. It is a relationship, like equity is in capitalism, but the focus is on commitment to support creativity and invention, not just seek yield on a financial position. Stakeholding focuses on the collective, joint commitments of investing and making certain things happen and recognizing them as valuable, rather than the private profit interest. See Reciprocal stakeholding.\\\");\\n       units.push(\\\"Stake tokens are issued by an agent in return for a stake in another agent\\\\\\\\u2019s performance. It gives the holder the right to participate in the revenue (receive a dividend) and is generated by the issuing agent\\\\\\\\u2019s economic activity. Reciprocal staking is a two-way economic communication interface, through which credit, commodities or other stake can be distributed throughout the network. As a process, reciprocal staking binds the network in on-going common interest. Stake tokens, issued to represent the transferred ownership of stake, are used for sharing the risks, providing collateral for credit, and establishing a communication channel for receiving offers and dividends.\\\");\\n       units.push(\\\"The weakness of the current economic reality is in the production of subjectivity. Subjectivity, the production of (i.e. political theology), is the real business of ECSA. In finance value is produced by the non-predictable, surprising new information that can affect your vision, your belief, that can make you feel something else is possible. Economic space agency is that message that changes belief that something new is possible.\\\");\\n       units.push(\\\"An economic network (economic space) accounts for its surplus as stake appreciation, not as money accumulation. In other words, the protocol does not define surplus as a positive balance of credits like with \\\\\\\\u201Cprofit\\\\\\\\u201D but as a positive change in stake price. The stake valuation includes the balance of other tokens, including other participants\\\\\\\\u2019 stakes, commodities, and credit. An economic space can hold a surplus in the treasury or distribute it as dividends that do not need to be transformed into credit, but can remain in the same underlying token. An economic space\\\\\\\\u2019s stake represents access to its underlying performance, resulting outputs, and network assets.\\\");\\n       units.push(\\\"While futures and options address the risks of future price changes, swaps engage the risks of future flows of wealth. The difference is not complete, for expected yields can be priced, but the emphasis is critically different. Yields invoke both the contingencies of on-going ownership of assets and their performances, and therein lies a richness of the \\\\\\\\u2018social\\\\\\\\u2019 not captured in relations of one-off exchange. Moreover, the focus on flows, rather than rational decision-making under uncertainty, opens an approach to a network that values time, historical data and volatility. It can track the way agents decide and how they relate, not just what trading decisions they register on the network.\\\");\\n       units.push(\\\"Token in the economic space protocol is a network asset (network derivative). It is a recognition of a networked performance as something exchangeable. It is an entry always into two ledger records at the same time, as an asset in one, and as a liability in another. Thus a token always expresses a relationship (it has an underlying, and is in this sense a protocol equivalent of a financial asset that has an underlying). Linguistically, token is a reference that is framed economically: its meaning is derived from an economic context \\\\\\\\u2013 the meaning space where the reference is used is loaded with notions of value \\\\\\\\u2013 which makes its value legible and possibly part of the economic dialogue. It is an economic medium, a medium of expression. From this perspective tokens are like words which you need to express (in our language that specializes in economic relationships). Token is like the units out of which expressions can be composed \\\\\\\\u2013 but a special kind of a units because it can be used to create a whole space you can enter. The token becomes a point of reference in relation to which other expressions gain their meaning. And you can enter these relations (they are spaces). The language framing of the token, understanding it is an expressive medium, reveals its programmable performative capacities and space creation capacities that a language has. See Network asset. See Coin.\\\");\\n       units.push(\\\"If accounting facilitated trade is a protocol where accounting serves the function of storage, retrieval, and verification of the integrity of information \\\\\\\\u2013 then trade is the user interface through which we agree to interconnect and create that information. By the transactions created through this interface, we determine how we progressively update our network state.\\\");\\n       units.push(\\\"A trading agent is an agent in the distributed exchange protocol. It can publish an offer and match an offer.\\\");\\n       units.push(\\\"Units of account is the numeraire by which all other aggregates might be measured and put at par. (compared). Unitss of account a.k.a. exchange unitss are utilized by the distributed exchange protocol to provide a units of account that serves as a shared value reference frame that does not favor any one specific token type; and to increase the possibility for matching an offer. It has no one issuer, or every one can issue it.\\\");\\n    }\\n    function set(uint256 location, string calldata _unit) external {\\n        units[location] = _unit;\\n    }\\n    function getById(uint256 location) external override returns (string memory unit) {\\n        return units[location];\\n    }\\n\\n}\"\r\n    }\r\n  },\r\n  \"settings\": {\r\n    \"optimizer\": {\r\n      \"enabled\": false,\r\n      \"runs\": 200\r\n    },\r\n    \"outputSelection\": {\r\n      \"*\": {\r\n        \"*\": [\r\n          \"evm.bytecode\",\r\n          \"evm.deployedBytecode\",\r\n          \"devdoc\",\r\n          \"userdoc\",\r\n          \"metadata\",\r\n          \"abi\"\r\n        ]\r\n      }\r\n    },\r\n    \"libraries\": {}\r\n  }\r\n}}", "ABI": "[{\"inputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"constructor\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"location\",\"type\":\"uint256\"}],\"name\":\"getById\",\"outputs\":[{\"internalType\":\"string\",\"name\":\"unit\",\"type\":\"string\"}],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"location\",\"type\":\"uint256\"},{\"internalType\":\"string\",\"name\":\"_unit\",\"type\":\"string\"}],\"name\":\"set\",\"outputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"\",\"type\":\"uint256\"}],\"name\":\"units\",\"outputs\":[{\"internalType\":\"string\",\"name\":\"\",\"type\":\"string\"}],\"stateMutability\":\"view\",\"type\":\"function\"}]", "ContractName": "UnitStorage38", "CompilerVersion": "v0.8.4+commit.c7e474f2", "OptimizationUsed": "0", "Runs": "200", "ConstructorArguments": "", "EVMVersion": "Default", "Library": "", "LicenseType": "", "Proxy": "0", "Implementation": "", "SwarmSource": ""}