{"SourceCode": "{{\r\n  \"language\": \"Solidity\",\r\n  \"sources\": {\r\n    \"contracts/storage/IStorage.sol\": {\r\n      \"content\": \"pragma solidity ^0.8.4;\\n// SPDX-License-Identifier: GPL-3.0-or-later\\n\\n// https://soliditytips.com/articles/solidity-interface-interact-with-other-contracts/\\ninterface IStorage {\\n    function getById(uint256 id) external returns (string memory unit);\\n    // Add more function signatures as needed.\\n}\"\r\n    },\r\n    \"contracts/storage/unit/UnitStorage8.sol\": {\r\n      \"content\": \"     \\npragma solidity ^0.8.4;\\n// SPDX-License-Identifier: GPL-3.0-or-later\\nimport \\\"../IStorage.sol\\\";\\n\\ncontract UnitStorage8 is IStorage{\\n    string[] public units;\\n    \\n    // set to onlyOwner()\\n    // check if value exists - \\n    constructor(){\\n        // 136\\n       units.push(\\\"On the one hand, the fall of the Soviet Union and the \\\\\\\\u2018marketisation\\\\\\\\u2019 of China had reputational implications for Marxisms of all varieties, including those that despised the Soviet Union as much as they despised capitalism. On the other hand, the rise in the west of \\\\\\\\u2018neo-liberalism\\\\\\\\u2019 saw the state operating as the obstacle to \\\\\\\\u2018progressive\\\\\\\\u2019 reform, not as its agent. Simply advocating what a \\\\\\\\u2018good\\\\\\\\u2019 state _should_ do lacked any real politics.\\\");\\n       units.push(\\\"THE HAYEKIAN TURN: KNOWLEDGE, PRICE AND SPONTANEOUS ORDER\\\");\\n       units.push(\\\"But there was an emerging undercurrent of political economy, now coming from the \\\\\\\\u2018right\\\\\\\\u2019 of politics, that came to the fore in these contexts. It is most readily associated with the name Friedrich von Hayek \\\\\\\\u2013 a rather marginal libertarian economist living in the shadow of Keynes and the (broadly) Marxists, but who came to public prominence in the 1970s as the theoretical guru of UK Prime Minister Margaret Thatcher: the person many attribute as the instigator of \\\\\\\\u2018neoliberalism.\\\\\\\\u2019\\\");\\n       units.push(\\\"We start with Hayek not because we see ourselves as being in the tradition of Hayek \\\\\\\\u2013 quite the contrary \\\\\\\\u2013 but because Hayek is so popular within the cryptoeconomic community. We will later have reason to draw on other economic traditions, especially Marx, Sraffa and Keynes. But in all cases the agenda is _not_ to give a \\\\\\\\u2018Hayekian,\\\\\\\\u2019 \\\\\\\\u2018Marxian\\\\\\\\u2019 or \\\\\\\\u2018Keynesian\\\\\\\\u2019 take on cryptoeconomics: indeed we believe that the technologies of the internet, cryptography and a blockchain would have been challenging for all past thinkers and would have caused them to re-think some of their core analysis.[37] But what we can do is look at their methods (rather than their conclusions) and ask how these might be applied in the current era, to see what insights we can glean. Indeed, we conjecture that this framing will lead to conclusions often quite different from those that appear in the emerging cryptoeconomic literature.\\\\\\\\n\\\\\\\\n[37] Not least because these technologies exist in abundance, with marginal costs effectively zero.\\\");\\n       units.push(\\\"Hayek was vehemently anti-socialist, but he had major conflicts with the neoclassical economists too. He embraced individual self interest as the premise of social order but thought the neo-classicals adopted two positions he opposed.\\\");\\n       units.push(\\\"First, he opposed their conception of \\\\\\\\u2018equilibrium\\\\\\\\u2019 as an optimal state. His preferred notion was \\\\\\\\u2018spontaneous order.\\\\\\\\u2019 That term might seem a close approximation of equilibrium, but the difference is critical. For Hayek, the quality of markets he affirmed was that they process complex information into simple information (prices). That is an intrinsic virtue, distinct from any claims that markets would somehow gravitate to balance or optimisation. It is the process that Hayek valued; not the outcome. Information processing is clearly critical to programming an economy; it is an issue to which we will return.\\\");\\n       units.push(\\\"Second, Hayek opposed the conventional endorsement of the state in economic management. The state, he contended, is innately authoritarian, imposing its will on society: sometimes well-intentioned but flawed; other times clearly enhancing the power of the state itself.[38] The market, claimed Hayek, is the natural site of freedom of expression and a means to generate spontaneous social order.\\\\\\\\n\\\\\\\\n[38] Milton Friedman later called it the tyranny of the majority: that an elected government could claim legitimacy in trampling on people\\\\\\\\u2019s natural rights. For some, quadratic voting offers an alternative.\\\");\\n       units.push(\\\"Of course the popular critique is that markets, if left to themselves, create massive inequality, environmental destruction, etc.. Not so, said Hayek. It is the inadequate specification of property rights and the rules of markets (that we reveal as a distributed protocol) that are the problem, and when states tinker with outcomes (levies and bounties) they generally mess up. Most critically, they mess up the provision of a state-sanctioned money system (fiat money).\\\");\\n       units.push(\\\"Not surprisingly, Hayek has had great appeal in cryptoeconomics. On the surface, they are a near perfect fit. A cryptoeconomic order conceived in a rejection of the state as economic manager, including as provider of the sole monetary system, and instead focussing on data analytics and optimizing individuals in contractual transactions, seems to resonate deeply with Hayek. So too does the idea, expressed in his _The Fatal Conceit_ (1988), of the need to break up conventional, secure but distorting practices.\\\");\\n       units.push(\\\"We can readily source essays on cryptoeconomics that celebrate the self-directed individual and claim foundations in Hayek.[39] It should be noted that, knowingly or not, the idealization of individualism, profit and the market as foundational social relations come as integral to the Hayek package and those foundations are being transmitted, perhaps not always intentionally, into cryptoeconomic culture. This adoption leaves unquestioned the issues of what we count and how we measure: both of which embody the potentially transformative politics of cryptoeconomics.\\\\\\\\n\\\\\\\\n[39] Albeit that they tend to ignore the later Hayek\\\\\\\\u2019s more nuanced view of markets, and the recognition that the state always plays critical roles of market facilitation.\\\");\\n       units.push(\\\"In creating new economic space, we are opening the opportunity for a different economic calculus. Our proposition is that knowledge, prices and their relation to markets need to be re-thought. What Hayek and conventional economics, and their digital disciples, take as foundational in relation to markets, we think are protocols. As protocols, they are designable in different ways. But Hayek and his followers seem to think not. They analyze \\\\\\\\u2018the market\\\\\\\\u2019 as a platform: culturally foundational and economically \\\\\\\\u2018natural.\\\\\\\\u2019 For them, the market is depicted as a neutral technology into which individuals bring their strategic interests and which, if allowed to operate as it \\\\\\\\u2018should,\\\\\\\\u2019 will create \\\\\\\\u2018equilibrium\\\\\\\\u2019 (neoclassical economics) and \\\\\\\\u2018spontaneous order\\\\\\\\u2019 (Hayek). The social \\\\\\\\u2018good\\\\\\\\u2019/\\\\\\\\u2018harm,\\\\\\\\u2019 the commons, the environment, that sit outside these individual interests can only be framed as \\\\\\\\u2018externalities,\\\\\\\\u2019 and hence second order considerations.[40]\\\\\\\\n\\\\\\\\n[40] There are current critiques of capitalism that feature the proposition that capitalist markets ignore \\\\\\\\u2018externalities\\\\\\\\u2019 (costs and revenues that are not allocated within existing property relations). The classic case is pollution, which imposes social costs that are not borne by the polluter. We concur that this failure is significant, but contend that if we focus on this \\\\\\\\u2018flaw,\\\\\\\\u2019 then we are implicitly conceding that, in the absence of externalities, capitalist markets warrant our affirmation. Our critique is that they privilege profitability and individualism over other values and collective benefit, whether or not there are externalities.\\\");\\n       units.push(\\\"What stands as contestable, and where we will focus our analysis, is the question of what we mean by \\\\\\\\u2018markets,\\\\\\\\u2019 \\\\\\\\u2018price mechanisms\\\\\\\\u2019 and their relations with \\\\\\\\u2018society.\\\\\\\\u2019 Markets are socially constructed, not \\\\\\\\u2018natural,\\\\\\\\u2019 and they embed particular social protocols. Markets transmit a range of information; not just price. Moreover \\\\\\\\u2018price\\\\\\\\u2019 itself transmits information, but it is always encoded in a particular way of measuring. So markets, as spaces of exchange, need not relate to profit, but can be designed to generate the sorts of information a network needs. As they currently are utilized, they are fundamentally directed to serving the pursuit of profit-making. In summary, market processes are not innately capitalist and their logic is not innately extractive (expressing social dominance).\\\");\\n       units.push(\\\"If we can isolate the process of market interactions from a social context of wealth, power and inequality, and redesign them at the center of a distributed postcapitalist economy, they can be seen as means of voting for economic outcomes, articulating individual views about what constitutes value. Issues of social benefit and harm, the environment, etc. in capitalism must be either contrived into profit calculus or treated as \\\\\\\\u2018externalities,\\\\\\\\u2019 and essentially outside of market calculus. We want to bring them inside market calculus by adapting market processes to value the things that we know to be socially important, but which are left out of capitalist markets. We shouldn\\\\\\\\u2019t conflate markets-under-capitalism with markets-as-information-transmission processes.\\\");\\n       units.push(\\\"In the new economic space, markets are explicitly defined by distributed network protocols. They are spaces of exchange and valuation: they structure the space of possibilities for interactions and for the economic properties of the objects populating such spaces. A market is a network and is defined by offer, matching, netting and clearing protocols that its agents must adopt in order to interoperate as a coherent whole.\\\");\\n       units.push(\\\"HAYEK\\\\\\\\u2019S DEAD END\\\");\\n       units.push(\\\"To get to the logic of the new economic space we don\\\\\\\\u2019t simply go via a simple refutation of Hayek, for his emphasis on markets as mechanisms of information collection and transfer is important. It is worth teasing out Hayek\\\\\\\\u2019s view so as to subsequently clarify what is distinctive about the new economic space.\\\");\\n       units.push(\\\"In the mid 20th century, Hayek and his Austrian School colleagues opened a debate with advocates of (broadly) Soviet-style planning. It became known as the Socialist Calculation Debate. Here is not the place to review that debate, although it warrants noting that there is a recent literature riffing off it to address the emergent computational capacities for efficient large-scale central planning.[41]\\\\\\\\n\\\\\\\\n[41] See Bernes (2020), for an impressive recent contribution. Some have argued that global corporations are applying all the techniques that would be required for state-run central planning. See, for example, Phillips and Rozworski (2019).\\\");\\n       units.push(\\\"Hayek\\\\\\\\u2019s proposition, which is hard to refute in historical context, is that Soviet central planning was always authoritarian and operating with inaccurate and outdated data when making resource allocation decisions. It was, at the time, an easy critique given the level of Soviet information technology and a war-ravaged economy, although the debate drew some creative interventions about how central planning might be integrated with market processes in a combination known as \\\\\\\\u2018market socialism.\\\\\\\\u2019[42] Some of these interventions, applying neo-classical economic criteria of efficiency, were more challenging for Hayek to refute, but his argument always came back to the point that markets provide superior information and enable the pursuit of individual freedom (read self-interest).\\\\\\\\n\\\\\\\\n[42] Market Socialism sought to integrate private enterprise or capitalist modes of calculation within socialist planning, generally by the operation of markets at the \\\\\\\\u2018local\\\\\\\\u2019 level, with market information guiding central planners in the \\\\\\\\u2018big\\\\\\\\u2019 allocation decisions. This intervention in the Socialist Calculation Debate is associated especially with Ota \\\\\\\\u0160ik, economist and deputy Prime Minister of Czechoslovakia, who was central to the liberalization of the Czech economy and the \\\\\\\\u2018Prague Spring\\\\\\\\u2019 that triggered the Soviet invasion in 1968. Capitalist modes of calculus, via the use of changes in stocks rather than prices to determine output decisions, is associated with post-war Polish economist Oskar Lange.\\\\\\\\n Our concern is not balance between planning and markets, for we believe it to be a false juxtaposition, but with the protocols under which markets are conceived. But it should be noted that this literature precipitated Hayek\\\\\\\\u2019s break with neo-classicals: both their conception of \\\\\\\\u2018competition\\\\\\\\u2019 and their belief in \\\\\\\\u2018equilibrium.\\\\\\\\u2019\\\");\\n       units.push(\\\"In the context of the Socialist Calculation Debate, Hayek made statements about markets and information that have clearly resonated in cryptoeconomics. It is worth quoting Hayek at some length: \\\\\\\\nIt is in this connection that what I have called the \\\\\\\\u2018economic calculus\\\\\\\\u2019 proper helps us, at least by analogy, to see how this problem can be solved, and in fact is being solved, by the price system. Even the single controlling mind [the central planner], in possession of all the data for some small, self-contained economic system, would not\\\\\\\\u2014every time some small adjustment in the allocation of resources had to be made\\\\\\\\u2014go explicitly through all the relations between ends and means which might possibly be affected. It is indeed the great contribution of the pure logic of choice that it has demonstrated conclusively that even such a single mind could solve this kind of problem only by constructing and constantly using rates of equivalence (or \\\\\\\\u2018values,\\\\\\\\u2019 or \\\\\\\\u2018marginal rates of substitution\\\\\\\\u2019), i.e., by attaching to each kind of scarce resource a numerical index which cannot be derived from any property possessed by that particular thing, but which reflects, or in which is condensed, its significance in view of the whole means-end structure. In any small change he will have to consider only these quantitative indices (or \\\\\\\\u2018values\\\\\\\\u2019) in which all the relevant information is concentrated; and, by adjusting the quantities one by one, he can appropriately rearrange his dispositions without having to solve the whole puzzle _ab initio_ or without needing at any stage to survey it at once in all its ramifications. \\\\\\\\nFundamentally, in a system in which the knowledge of the relevant facts is dispersed among many people, prices can act to co\\\\\\\\u00F6rdinate the separate actions of different people in the same way as subjective values help the individual to co\\\\\\\\u00F6rdinate the parts of his plan. (Hayek 1945: 225-26)\\\");\\n        // 154\\n    }\\n    function set(uint256 location, string calldata _unit) external {\\n        units[location] = _unit;\\n    }\\n    function getById(uint256 location) external override returns (string memory unit) {\\n        return units[location];\\n    }\\n\\n}\"\r\n    }\r\n  },\r\n  \"settings\": {\r\n    \"optimizer\": {\r\n      \"enabled\": false,\r\n      \"runs\": 200\r\n    },\r\n    \"outputSelection\": {\r\n      \"*\": {\r\n        \"*\": [\r\n          \"evm.bytecode\",\r\n          \"evm.deployedBytecode\",\r\n          \"devdoc\",\r\n          \"userdoc\",\r\n          \"metadata\",\r\n          \"abi\"\r\n        ]\r\n      }\r\n    },\r\n    \"libraries\": {}\r\n  }\r\n}}", "ABI": "[{\"inputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"constructor\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"location\",\"type\":\"uint256\"}],\"name\":\"getById\",\"outputs\":[{\"internalType\":\"string\",\"name\":\"unit\",\"type\":\"string\"}],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"location\",\"type\":\"uint256\"},{\"internalType\":\"string\",\"name\":\"_unit\",\"type\":\"string\"}],\"name\":\"set\",\"outputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"\",\"type\":\"uint256\"}],\"name\":\"units\",\"outputs\":[{\"internalType\":\"string\",\"name\":\"\",\"type\":\"string\"}],\"stateMutability\":\"view\",\"type\":\"function\"}]", "ContractName": "UnitStorage8", "CompilerVersion": "v0.8.4+commit.c7e474f2", "OptimizationUsed": "0", "Runs": "200", "ConstructorArguments": "", "EVMVersion": "Default", "Library": "", "LicenseType": "", "Proxy": "0", "Implementation": "", "SwarmSource": ""}