// SPDX-License-Identifier: MIT

pragma solidity ^0.8.0;

/// @title: yeahn
/// @author: manifold.xyz

import "./manifold/ERC1155Creator.sol";

///////////////////////////////////////////////////////////////////////
//                                                                   //
//                                                                   //
//                                                                   //
//                                                                   //
//                                                                   //
//                                                                   //
//                                                                   //
//                                                                   //
//                                                                   //
//                                                                   //
//                                                                   //
//                                                                   //
//                                                                   //
//                                                                   //
//                                              φ▒░                  //
//                                              φ▒░                  //
//                                              φ▒░                  //
//                                              φ▒░                  //
//                                              φ▒░                  //
//                                   ..........]φ▒░░,........        //
//                                »φφφφφφφφφφφφ▒╠▒▒▒▒φφφφφφφφφφ░~    //
//                                             "╚▒░"'                //
//                                              φ▒░                  //
//                                              φ▒░                  //
//                                              φ▒░                  //
//                                              φ▒░                  //
//                                              ░▒░                  //
//                                              '"                   //
//                                                                   //
//                                                                   //
//                                                                   //
//                                                                   //
//                                                                   //
//                                                                   //
//                                                                   //
//                                                                   //
//                                                                   //
//                                                                   //
//                                                                   //
//    ---                                                            //
//    asciiart.club                                                  //
//                                                                   //
//                                                                   //
//                                                                   //
///////////////////////////////////////////////////////////////////////


contract asdc is ERC1155Creator {
    constructor() ERC1155Creator("yeahn", "asdc") {}
}