// SPDX-License-Identifier: MIT

pragma solidity ^0.8.0;

/// @title: Cheeks
/// @author: manifold.xyz

import "./manifold/ERC1155Creator.sol";

////////////////////////////
//                        //
//                        //
//    🍑🍑🍑🍑🍑🍑🍑🍑    //
//    🍑🍑🍑🍑🍑🍑🍑🍑    //
//    🍑🍑🍑🍑🍑🍑🍑🍑    //
//    🍑🍑🍑🍑🍑🍑🍑🍑    //
//    🍑🍑🍑🍑🍑🍑🍑🍑    //
//    🍑🍑🍑🍑🍑🍑🍑🍑    //
//    🍑🍑🍑🍑🍑🍑🍑🍑    //
//    🍑🍑🍑🍑🍑🍑🍑🍑    //
//    🍑🍑🍑🍑🍑🍑🍑🍑    //
//    🍑🍑🍑🍑🍑🍑🍑🍑    //
//                        //
//                        //
////////////////////////////


contract thicc is ERC1155Creator {
    constructor() ERC1155Creator("Cheeks", "thicc") {}
}