{"SourceCode": "{{\r\n  \"language\": \"Solidity\",\r\n  \"sources\": {\r\n    \"contracts/storage/IStorage.sol\": {\r\n      \"content\": \"pragma solidity ^0.8.4;\\n// SPDX-License-Identifier: GPL-3.0-or-later\\n\\n// https://soliditytips.com/articles/solidity-interface-interact-with-other-contracts/\\ninterface IStorage {\\n    function getById(uint256 id) external returns (string memory unit);\\n    // Add more function signatures as needed.\\n}\"\r\n    },\r\n    \"contracts/storage/unit/UnitStorage16.sol\": {\r\n      \"content\": \"     \\npragma solidity ^0.8.4;\\n// SPDX-License-Identifier: GPL-3.0-or-later\\nimport \\\"../IStorage.sol\\\";\\n\\ncontract UnitStorage16 is IStorage{\\n    string[] public units;\\n    \\n    // set to onlyOwner()\\n    // check if value exists - \\n    constructor(){\\n       //288\\n       units.push(\\\"The critical innovation of social impact bonds is that they design a bond for a private investor to purchase, where the funds raised from the bond sale are spent on an experimental public policy intervention (i.e. where the outcome is unknown). The intervention must be undertaken by an \\\\\\\\u2018independent\\\\\\\\u2019 third party, not a party to the contract, to ensure the results are verifiable. The bet for the investor is whether the intervention will achieve a pre-specified level of success (if, for example, a group of prisoners that receives the intervention has 20% lower rate of recidivism than a control group). If the intervention is successful in achieving its 20% target, the investors get a payout; if not, they lose their money.[87]\\\\\\\\n\\\\\\\\n[87] In practice, the investors do not lose all their money. Governments\\\\\\\\u2019 desires to promote the policy have tended to set generous terms for investors.\\\");\\n       units.push(\\\"This innovation had two relevant features for our purpose. First, the design of social impact bonds embeds the criteria by which success (an investor payout) would be verified. This is not a policy of \\\\\\\\u2018intervene first and evaluate after\\\\\\\\u2019: the conditions of evaluation (the 20% improvement condition, for example) is known to the investor before they invest. In the depiction of performances presented in this chapter, this is an important feature: the performance offer must declare its claims to independently verifiable outcomes, and the probability of these targeted levels being achieved enters into investor calculation about staking the performance. In a social impact bond, independent verifiability is undertaken by a separate institution: neither the state nor the investor, but the third party commissioned to undertake the intervention. In the new economic space, it is believed that network-generated data will be the primary source of independent verification. However, an agent could offer the performance of verification services to the network.\\\");\\n       units.push(\\\"Second, the design of social impact bonds enables the quantification of social phenomena generally thought unmeasurable. It measures not an absolute outcome (what number (to appear on a ledger) could be given to a successful recidivism reduction program, and what is the measure of \\\\\\\\u2018success\\\\\\\\u2019?) but the spread between the intervention group and the control group (was there a 20 percent difference?). This spread is the objective of calculation. If the intervention achieves a 20 percent spread, the intervention is deemed successful and the investor gets an agreed bond payout; if not, the investors lose their money.[88] This closes the intervention: the investor has received payment (or not) and the state has discovered whether the intervention is worth permanent funding (or not).\\\\\\\\n\\\\\\\\n[88] Social impact bonds involve the government funding an experimental intervention to determine whether it should receive on-going state funding. They were never designed to be on-going modes of service provision, for a repeat of the same intervention involves no calculation of investor risk, and hence no rationale for investor return.\\\");\\n       units.push(\\\"The lesson for the new economic space is that measurement of performance outcomes, as the condition for declaring value, will be found in the design and pricing of spreads. This is a framing in the logic of financial derivatives: pricing the spread on the performance of an asset rather than pricing the value of the underlying asset itself. The financial derivative framing is developed in Appendix 5.2; the mode of measurement itself in addressed in Chapter 7.3\\\");\\n       units.push(\\\"POLICY EVALUATION FRAMEWORK\\\");\\n       units.push(\\\"The second critical policy development of HM Treasury is the _Magenta Book: Central Government Guidance on Evaluation_ (2020), first published in 2011, now extended and elaborated. Its framework has been adopted and adapted by many states\\\\\\\\u2019 treasuries as the foundation for their policy evaluation frameworks. In our terms, it addresses directly the question of how value gets attributed to the outcomes of a performance, including when these outputs that generate the outcomes are not sold.\\\");\\n       units.push(\\\"_The Magenta Book_ adopts some of the analytical insights of social impact bonds, but gives them a more general context. It is designed, as the subtitle suggests, to give guidelines for policy evaluation generally: an agenda that implicitly includes means to commensurate the value created by different policies.\\\");\\n       units.push(\\\"It is not the purpose of this appendix to summarize that extensive document, but to highlight two important features that are germane to the new economy space and the Economic Space Protocol. First, as with social impact bonds, the _Magenta Book_ proposes knowing the method of evaluation before the policy commences; indeed designing the policy _so as to be_ measurable. Second, it advocates drawing a difference between outputs and outcomes. Outputs are generally easy to quantify: number of reports or recommendations, surveys conducted, dollars spent, tonnes of this; hours of that, etc.. But outputs are not ends in themselves. It is on outcomes that policy aspires to exert an impact, and outcomes have to be measured differently from outputs,[89] often via the \\\\\\\\u2018spread method\\\\\\\\u2019 developed in social impact bonds.\\\\\\\\n\\\\\\\\n[89] The questions of how, when and how often to measure outcomes have become big questions in public sector use of the evaluation framework, as they will be in a new economic space.\\\");\\n       units.push(\\\"The relevance to the Economic Space Protocol is that performances create _outputs_ (goods, services, etc.) and performance indices can measure the technical, data attributes of these outputs, giving them a technical point of comparison like transaction speed and volumes. But these are not the point of access to a determination of an individual value and the commensuration of different values. What the _Magenta Book_ emphasizes in a policy context is that the critical task is to measure the _outcomes_ of outputs. In the new economic space, the measure of outcomes is the equivalent to the process by which the network attributes value to the outputs of a performance. It is asking the question of whether a performance output led to the creation of something of value. Outcomes are the way in which the network will recognize (in the sense defined in Chapter 4.3) a performance\\\\\\\\u2019s value. This reinforces the emphasis, in both social impact bonds and public policy design, that outcome measures are embedded in the design of performance offers.\\\");\\n       units.push(\\\"PERFORMANCES (P) AND THEIR OUTPUTS (C)\\\");\\n       units.push(\\\"Production can be depicted diagrammatically as the relation between performances (P) and commodity outputs (C). By the term \\\\\\\\u2018commodity\\\\\\\\u2019 to reiterate, we do not mean something produced by wage labor to be sold for a profit (as Marx uses the term) but any good or service that is offered to the network. This appendix includes reference to token types which will not be explained until Chapter 10. Their inclusion here, even at this stage of the analysis, will give the reader some idea of the role tokens play in the network.\\\");\\n       units.push(\\\"SIMPLE COMMODITY PRODUCTION\\\");\\n       units.push(\\\"We start with simple commodity production as a baseline (Figure 4.1) and add complexity. \\\\\\\\n[Figure 4.1 Simple commodity production] \\\\\\\\nThis is where a single act of \\\\\\\\u2018performance\\\\\\\\u2019 is directly sold as a commodity. A performance, in this context, equates to an act of production of an output to be offered for sale. This is distinct from an exchange of C \\\\\\\\u2013 C, where there is a circulation of existing commodities.\\\");\\n       units.push(\\\"CUMULATIVE COMMODITY PRODUCTION\\\");\\n       units.push(\\\"Here, performances combine to produce commodities. This may be simply two performances in combination creating a higher level performance (a 2 link chain), which is then realized as a commodity. This 2 link chain is shown in Figure 4.2. \\\\\\\\n[Figure 4.2 Cumulative commodity production]\\\");\\n       units.push(\\\"Or it could be more complex chains of performances combining, with different numbers of links (performances) in the chain, such as shown in Figure 4.3. \\\\\\\\n[Figure 4.3 Chains of performance]\\\");\\n       units.push(\\\"In each above case, a single commodity event occurs (i.e. the performances combine to produce one network unit of value). The production of output is defined by the various performance chains that link to produce a commodity.\\\");\\n       units.push(\\\"The effect of being realized as a commodity valued by the network then triggers claims on that commodity valuation, and a flow of \\\\\\\\u2018revenue\\\\\\\\u2019 claims in the opposite direction. This occurs by the automated issuance of a commodity token for each recording of a commodity value event in the network. The commodity token is then distributed (into partial shares) back down the performance chain, so that each performance that feeds into a commodity claims a share of Value.\\\");\\n       units.push(\\\"When an agent attributes values to a performance, it does so by \\\\\\\\u2018clearing\\\\\\\\u2019 or crediting the \\\\\\\\u2018performing agent.\\\\\\\\u2019 The effect is to validate an exchange of value by issuing a commodity token. For the owner of the performance, this crediting effectively enables them to settle credit, and as credit is held against stake, the net balance of stake increases. Critically, where \\\\\\\\u2018Value\\\\\\\\u2019 is being recognized in the network not as monetary return (sale for a price) but asset of performances validated by the network, then the \\\\\\\\u2018benefits\\\\\\\\u2019 of successful performances are revealed not as monetary revenue, but as a reduction in outstanding liquidity: a wealth effect, not an income effect.\\\");\\n       // 306\\n    }\\n    function set(uint256 location, string calldata _unit) external {\\n        units[location] = _unit;\\n    }\\n    function getById(uint256 location) external override returns (string memory unit) {\\n        return units[location];\\n    }\\n\\n}\"\r\n    }\r\n  },\r\n  \"settings\": {\r\n    \"optimizer\": {\r\n      \"enabled\": false,\r\n      \"runs\": 200\r\n    },\r\n    \"outputSelection\": {\r\n      \"*\": {\r\n        \"*\": [\r\n          \"evm.bytecode\",\r\n          \"evm.deployedBytecode\",\r\n          \"devdoc\",\r\n          \"userdoc\",\r\n          \"metadata\",\r\n          \"abi\"\r\n        ]\r\n      }\r\n    },\r\n    \"libraries\": {}\r\n  }\r\n}}", "ABI": "[{\"inputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"constructor\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"location\",\"type\":\"uint256\"}],\"name\":\"getById\",\"outputs\":[{\"internalType\":\"string\",\"name\":\"unit\",\"type\":\"string\"}],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"location\",\"type\":\"uint256\"},{\"internalType\":\"string\",\"name\":\"_unit\",\"type\":\"string\"}],\"name\":\"set\",\"outputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"\",\"type\":\"uint256\"}],\"name\":\"units\",\"outputs\":[{\"internalType\":\"string\",\"name\":\"\",\"type\":\"string\"}],\"stateMutability\":\"view\",\"type\":\"function\"}]", "ContractName": "UnitStorage16", "CompilerVersion": "v0.8.4+commit.c7e474f2", "OptimizationUsed": "0", "Runs": "200", "ConstructorArguments": "", "EVMVersion": "Default", "Library": "", "LicenseType": "", "Proxy": "0", "Implementation": "", "SwarmSource": ""}