{"SourceCode": "{{\r\n  \"language\": \"Solidity\",\r\n  \"sources\": {\r\n    \"contracts/storage/IStorage.sol\": {\r\n      \"content\": \"pragma solidity ^0.8.4;\\n// SPDX-License-Identifier: GPL-3.0-or-later\\n\\n// https://soliditytips.com/articles/solidity-interface-interact-with-other-contracts/\\ninterface IStorage {\\n    function getById(uint256 id) external returns (string memory unit);\\n    // Add more function signatures as needed.\\n}\"\r\n    },\r\n    \"contracts/storage/unit/UnitStorage28.sol\": {\r\n      \"content\": \"     \\npragma solidity ^0.8.4;\\n// SPDX-License-Identifier: GPL-3.0-or-later\\nimport \\\"../IStorage.sol\\\";\\n\\ncontract UnitStorage28 is IStorage{\\n    string[] public units;\\n    \\n    // set to onlyOwner()\\n    // check if value exists - \\n    constructor(){\\n        //518\\n       units.push(\\\"The start and end point of this circuit focuses on production and consumption as a pairing, for combined they depict the performance of value creation in the network.\\\");\\n       units.push(\\\"A performance starts with an offer by an agent to the network to produce outputs it believes will be valued by the network. The offer is also seeking staking from other agents who may directly participate or take some financial interest in realizing the performance. Through staking, performances become (underlying) assets which is the key to their standing as collateral (Pe\\\\\\\\u2013Co).\\\");\\n       units.push(\\\"The act of staking highlights that the offer of a performance is a risk position on the future: an estimation of whether the performance being staked will receive future social recognition (replication, adoption or some other form of socially recognized approval). This risk position is played out over time: whether a performance does, indeed, create the value its implementers intended and its stakers aspired to. The direct expression of the playing out of risk is the changing price of stake, as the network monitors the enactment of a performance.\\\");\\n       units.push(\\\"When stake is used as collateral for credit issuance (Co\\\\\\\\u2013Cr), a change in the value of a performance, and hence of stake, means that the value of collateral will change over time. In particular, there is a risk that a performance whose staked value falls will see a fall in the value of collateral, and hence shift the risks of default to the issuer of credit. There will be clear incentives for collateral to be based on a pooling of staked performances. This is the momentum of \\\\\\\\u2018risking together.\\\\\\\\u2019\\\");\\n       units.push(\\\"Hence, when credit is used to fund the acquisition of inputs for the agent\\\\\\\\u2019s next performance (be it repeating the same performance or innovating a new one) (Cr\\\\\\\\u2013Pe), it is apparent that the playing out of risks of the previous circuit impacts on the capacity of this agent to mobilize future credit. The signal of that risk evaluation is stake price. Stake framed as collateral now becomes the backing for the offer of a line of credit (Co\\\\\\\\u2013Cr), so the change in the value of a performance impacts the future provision of credit to fund the construction of future performances (Cr\\\\\\\\u2013Pe).\\\");\\n       units.push(\\\"When framed as the circuit of an individual performance, we see emphasis on risks and changing network valuation of performances. When framed as the circuit of the total of network performances, we see how the growth of network-created value leads to the funding of new performances. Hence we depict Pe\\\\\\\\u2013Pe as the circuit of value creation.[149]\\\\\\\\n\\\\\\\\n[149] In the Marxian circuit, the return to the \\\\\\\\u2018starting point\\\\\\\\u2019 designates expanded value, acquired by the extraction of surplus value from labor. In our terms it would be a Pe\\\\\\\\u2013Pe circuit. But in the circuit of the new economic space, there is no process of surplus extraction from producers, so the circuit\\\\\\\\u2019s growth is via replication, not extraction.\\\");\\n       units.push(\\\"THE COLLATERAL CIRCUIT: THE CIRCUIT OF GROWTH\\\");\\n       units.push(\\\"The start and end point of this circuit focuses on the propensity of the network to expand wealth. Wealth in the network is expressed in stake price growth, for staking, and hence stake price, responds to where new value is being created. But our analysis of a circuit - a flow - should not be centered on the stock dimension. This is why we focus on stake-as-collateral rather than stake-as-wealth.\\\");\\n       units.push(\\\"Collateral is stake, qualified by risk, and measured by the unit of exchange. Stake exists as a (diversified) portfolio of unique, differentiated assets. When looked at as collateral, the focus shifts from the diversity of performance-backed stakes to the singularity of an abstracted unit of measure, expressed in the unit of exchange/unit of credit. Portfolio valuation is a critical analytical shift, for it opens up the calculative basis for decisions \\\\\\\\u2018rebalancing\\\\\\\\u2019 portfolio holdings as risks change. The intentional shift of agents\\\\\\\\u2019 stake holdings is the key to shifting the growth and direction of the network.[150]\\\\\\\\n\\\\\\\\n[150] \\\\\\\\u2018Modern portfolio theory\\\\\\\\u2019 tells us that the value of the whole is not simply found in adding up component prices: the composite risk profile impacts valuation.\\\");\\n       units.push(\\\"In summary, collateral is the conversion of a diverse range of stakeholdings into a single index of valuation, and from here it can be expressed in the same terms as credit (Co\\\\\\\\u2013Cr): from the perspective of the portfolio it is the unit of exchange; from the perspective of credit, it is the unit of credit. But it is the same unit.\\\");\\n       units.push(\\\"Credit backed by collateral then appears as a trusted (risk-rated) source of liquidity, which will be advanced to individual agents to fund specific performances (Cr-Pe). In the previous link (Co-Cr), what was a process of converting diversity to sameness now becomes the opportunity for creating diversity out of sameness (Cr\\\\\\\\u2013Pe). This pulse from diversity to singularity to diversity drives the growth of the network. The question the circuit resolves is whether the performances that backed collateral at the \\\\\\\\u2018start\\\\\\\\u2019 of the circuit will be the same as the performances that get funded by the credit raised from the staking of those performances.\\\");\\n       units.push(\\\"In this role, collateral is the means to make risk commensurable across the network so that different performances and their risk/return calculations can be expressed in a common unit of measure. The movement from Pe\\\\\\\\u2013Co, which completes the circuit, has expressed a view about which performances will thrive and which will not.\\\");\\n       units.push(\\\"The Co\\\\\\\\u2013Co circuit expresses the risk-adjusted measure of _growth of accumulation_ by the network (compared with the Pe\\\\\\\\u2013Pe circuit which expresses the _growth of output value_ of the network).\\\");\\n       units.push(\\\"THE CREDIT CIRCUIT: THE CIRCUIT OF STABILITY\\\");\\n       units.push(\\\"The start and end point of this circuit focuses on the provision of liquidity and the propensity of the network to be stable (whilst it grows). Its starting point is individual offers of liquidity to enable the network\\\\\\\\u2019s new value creation (production and consumption). An agent draws on credit to fund the design, build and stake a future performance (Cr\\\\\\\\u2013Pe). The provision of credit avoids illiquidity which would otherwise impede the creation of (stakeable) performances. From the perspective of the credit circuit, the movement Cr\\\\\\\\u2013Pe expresses the decision about _which_ performances will be staked: which performances are most likely to succeed, and hence repay the credit from the value of their outputs.\\\");\\n       units.push(\\\"The movement Pe\\\\\\\\u2013Co reveals that the risks of the creditor and staker are different. The staker\\\\\\\\u2019s risk is reflected in their dividend deriving from the value of the performance. It is the _growth_ position. The creditor\\\\\\\\u2019s risk is simply that the performance generates enough return on stake to give the issuer of stake tokens sufficient revenue to repay credit. This is both a lower level of risk so credit will more likely be directed towards \\\\\\\\u2018safer\\\\\\\\u2019 investments: riskier investments will likely rely more on stake than on credit. This is the sense in which the credit circuit emphasizes the capacity of the system for stability.\\\");\\n       units.push(\\\"When the circuit is completed by collateral as the backing for credit (Co-Cr), it is now apparent that the more successful stakes are the ones that \\\\\\\\u2018survive\\\\\\\\u2019 to form future collateral, and especially collateral that will not decline in value over the life of the circuit. This selection process establishes a stable basis on which further performances can be chosen and funded.\\\");\\n       units.push(\\\"When framed as the circuit of an individual line of credit, the circuit shows the processes by which the conditions for its repayment are created (and the risks that are \\\\\\\\u2019passed through the circuit). When framed as the circuit of total credit we see how credit is being directed to those performances most likely to meet risk/return calculus. The credit circuit, therefore signals not just the stability of the circuit, but the stability of the connection over time between performances and value.\\\");\\n       units.push(\\\"SIGNIFICANCE\\\");\\n        //536\\n    }\\n    function set(uint256 location, string calldata _unit) external {\\n        units[location] = _unit;\\n    }\\n    function getById(uint256 location) external override returns (string memory unit) {\\n        return units[location];\\n    }\\n\\n}\"\r\n    }\r\n  },\r\n  \"settings\": {\r\n    \"optimizer\": {\r\n      \"enabled\": false,\r\n      \"runs\": 200\r\n    },\r\n    \"outputSelection\": {\r\n      \"*\": {\r\n        \"*\": [\r\n          \"evm.bytecode\",\r\n          \"evm.deployedBytecode\",\r\n          \"devdoc\",\r\n          \"userdoc\",\r\n          \"metadata\",\r\n          \"abi\"\r\n        ]\r\n      }\r\n    },\r\n    \"libraries\": {}\r\n  }\r\n}}", "ABI": "[{\"inputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"constructor\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"location\",\"type\":\"uint256\"}],\"name\":\"getById\",\"outputs\":[{\"internalType\":\"string\",\"name\":\"unit\",\"type\":\"string\"}],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"location\",\"type\":\"uint256\"},{\"internalType\":\"string\",\"name\":\"_unit\",\"type\":\"string\"}],\"name\":\"set\",\"outputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"\",\"type\":\"uint256\"}],\"name\":\"units\",\"outputs\":[{\"internalType\":\"string\",\"name\":\"\",\"type\":\"string\"}],\"stateMutability\":\"view\",\"type\":\"function\"}]", "ContractName": "UnitStorage28", "CompilerVersion": "v0.8.4+commit.c7e474f2", "OptimizationUsed": "0", "Runs": "200", "ConstructorArguments": "", "EVMVersion": "Default", "Library": "", "LicenseType": "", "Proxy": "0", "Implementation": "", "SwarmSource": ""}