{"SourceCode": "{{\r\n  \"language\": \"Solidity\",\r\n  \"sources\": {\r\n    \"contracts/storage/IStorage.sol\": {\r\n      \"content\": \"pragma solidity ^0.8.4;\\n// SPDX-License-Identifier: GPL-3.0-or-later\\n\\n// https://soliditytips.com/articles/solidity-interface-interact-with-other-contracts/\\ninterface IStorage {\\n    function getById(uint256 id) external returns (string memory unit);\\n    // Add more function signatures as needed.\\n}\"\r\n    },\r\n    \"contracts/storage/unit/UnitStorage18.sol\": {\r\n      \"content\": \"     \\npragma solidity ^0.8.4;\\n// SPDX-License-Identifier: GPL-3.0-or-later\\nimport \\\"../IStorage.sol\\\";\\n\\ncontract UnitStorage18 is IStorage{\\n    string[] public units;\\n    \\n    // set to onlyOwner()\\n    // check if value exists - \\n    constructor(){\\n       //327\\n       units.push(\\\"This is not a sequence of decisions: each is being made and remade simultaneously, as depicted in Figure 5.1. In capitalism, aspirations may be no different from the new economy, but prediction is about popular opinion about profit and evaluation is dictated by the profit outcomes. In the new economic space, evaluation is not by a predetermined criterion; it is determined by the network. If evaluation is endogenous, then prediction has no singular goal, and hence aspirations can be more expressive. Similarly, if evaluation is a social process, it feeds into emotion, into individual decisions about what to offer to the network and hence also into predictions. \\\\\\\\n[Figure 5.1 Aspirations, Predictions and Evaluations]\\\");\\n       units.push(\\\"Endogenous evaluation means that what a network does value can be a mediated expression of what the network aspires to value, so long as there is diversity in predictions. There will be diversity in predictions because agents are not only predicting which individual performances will be successful; they are simultaneously determining the criteria of success.\\\");\\n       units.push(\\\"Most agents, including those pursuing their own explicit maximization strategies, will diversify their predictions because they cannot know in advance the criteria by which their predictions will be evaluated. This process will see agents mining network data seeking investment trends and network opinions. Data analysis will not converge on a single outcome, but it may well see convergence to a range of aspirations, a range of modes of verification (performance indices) and a range of criteria of value. How broad or narrow these ranges are will be played out by the network itself.\\\");\\n       units.push(\\\"Combined \\\\\\\\nOur consideration of staking ratios involved depicting staking as a voting process in the network: which agents are perceived to be popular to stake and which unpopular. The consideration of the feedback processes in agents\\\\\\\\u2019 staking decisions shows that staking is more than voting. To invoke the terms of Benjamin Graham (sometimes called the \\\\\\\\u2018Dean of Wall Street\\\\\\\\u2019 and the father figure of \\\\\\\\u2018value investing\\\\\\\\u2019) in discussing the stock market, in the short run this market is a voting machine \\\\\\\\u2013 determining the network\\\\\\\\u2019s popular views about how each agent\\\\\\\\u2019s proposal to produce value compares with other agents\\\\\\\\u2019 proposals \\\\\\\\u2013 but in the long run it is a weighing machine, evaluating the relative substance of each agent\\\\\\\\u2019s performances.[94] The weighing mechanism is about collectively determining how much each performance contributes to the network\\\\\\\\u2019s creation of new value, and hence determining exactly what is meant by a quantity of value (for this particular network).\\\\\\\\n\\\\\\\\n[94] Something approximating this statement appears in Graham and David Dodd\\\\\\\\u2019s 1934 book _Security Analysis_: the original text on investing according to a company\\\\\\\\u2019s \\\\\\\\u2018fundamentals.\\\\\\\\u2019 The specific statement, however, is not in the book. It is often simply attributed to Graham, most notably by one of his students, Warren Buffett. See also Appendix 5.1 for elaboration.\\\");\\n       units.push(\\\"How can a network measure the value of things even though there may be no single, \\\\\\\\u2018objective\\\\\\\\u2019 measure of value and, indeed, some output may never be sold for a price? The answer is that the willingness of agents to stake a performance shifts the focus away from how to get an exact, agreed definition of \\\\\\\\u2018care,\\\\\\\\u2019 or \\\\\\\\u2018environmental benefit,\\\\\\\\u2019 \\\\\\\\u2018artistic/ technological contribution\\\\\\\\u2019 etc., and towards the willingness of agents to stake a particular definition. The risk of staking is the likelihood of certain defined events of \\\\\\\\u2018care\\\\\\\\u2019 etc. occurring.[95] This shift is critical, for instead of claiming the capacity directly to value outputs-with-no-price we analytically \\\\\\\\u2018sidestep\\\\\\\\u2019 that problem, or approach it indirectly by valuing the performances that generate those outputs-with-no-price. Adopting a cost plus average return pricing model we can then determine an implied, approximate \\\\\\\\u2018price\\\\\\\\u2019 value for those outputs, but the critical goal is not to have a full set of output prices, but a full set of staking prices.\\\\\\\\n\\\\\\\\n[95] The focus here is on outputs (for they are what is recorded in the ledger) although reference is to outputs whose outcomes have been validated by the network.\\\");\\n       units.push(\\\"There is one more analytical link before that explanation is complete: why would someone stake a performance that produces outputs that have value but no market price and hence generates no revenue? The answer is clear, although we have to connect to issues addressed in Chapter 8 to explain it. It is that when the network attributes a token to that value creation, the token can be used to clear credit in the network. It means that creditors, and creditors of creditors, are recognising the creation of value. The capacity to clear credit becomes the ultimate network-wide recognition of value creation.\\\");\\n       units.push(\\\"RETURNS TO STAKEHOLDING\\\");\\n       units.push(\\\"Agents will stake other agents\\\\\\\\u2019 performances not merely to express views about what constitutes value, but in search of a yield. This includes a yield on outputs that are consumed in the commons.\\\");\\n       units.push(\\\"The returns to staking will be in whatever form the staking contract nominates, but generally they are in two forms. First, there are changes in stake price. The full meaning of this awaits the introduction of tokens, and especially the credit token. It also awaits a consideration of the relation between internal and external financial units (e.g. fiat).\\\");\\n       units.push(\\\"Second, stake will generate \\\\\\\\u2018a dividend\\\\\\\\u2019 (value-remuneration sharing). It may be a share of output, or a share of net revenue (outputs less the cost of inputs). It could be a financial return or a commodity output return, and those returns may accrue directly to the stakeholder or to some other agent nominated by the stakeholder, such as the commons (see Chapter 6). It could also give other rights; for example, rights to influence the future evolution of the performance, or it could give the stakeholder rights to build their own performance in connection with the performance they staked. Indeed, when outputs are framed as dividends, dividends themselves become the center of the governance and innovation dynamism that drives the network. This depiction is central to the way \\\\\\\\u2018surplus\\\\\\\\u2019 is defined in the network.[96]\\\\\\\\n\\\\\\\\n[96] See Appendix 5.2 for elaboration.\\\");\\n       units.push(\\\"Notice, therefore, the investor intent that now becomes apparent in the act of staking when we focus on returns to staking. Agents stake a performance that they would \\\\\\\\u2018like to see happen,\\\\\\\\u2019 because it complies with their emotional and aesthetic perspective, because they believe the performance is important in the overall profile of the network, or because there is a distinctive dividend they would like to acquire, be it a physical package, access to something or simply an acknowledgment that the performance they staked generated a benefit for others. This reveals that ethical, emotional and aesthetic dimensions are embedded in the depiction of value, and the dividends on performances will therefore also embed those ethical foundations.\\\");\\n       units.push(\\\"STAKING AND THE NETWORK: A SUMMARY AND A PROJECTION\\\");\\n       units.push(\\\"Stake plays six critical roles in a network, some of which have just been described, others of which await the depiction of tokens, and especially the role of credit. We nominate the latter at this time, to give signals to readers who are looking to comprehend the network-as-a-whole, and especially its liquidity. \\\\\\\\n- _Resourcing performing_. Staking is a means by which agents enter the performance of another agent: staking opens \\\\\\\\u2018relations of performing\\\\\\\\u2019 which are not premised on wage labor or other extractive production relations. \\\\\\\\n- _Diversifying risk_. Staking enables the initiator/undertaker of performances to share the risks of their innovation, and mutual staking sees them diversify their own risks. \\\\\\\\n- _Collateral._ Stake stands as collateral for credit. The price of stake (reflecting future projections of its holders) therefore backs the credit that will fund other future performances. \\\\\\\\n- _Social Pooling_. Stake not only enables the diversification of risks (which is indeed one form of pooling); it also expresses the way in which individual agents who stake a performance combine to form a new agent defined by their common purpose (a new economic space), and in turn the way in which performances combine to form aggregated networks. \\\\\\\\n- _Commensuration of performances._ Stake price makes all different performances commensurable, and hence creates the idea of an economy of collective innovation and interoperability among economic agents. But it does so, critically, without reducing the measurement of performances to a single index: it intentionally preserves the importance of diverse ways of measuring the value-creation of each performance. \\\\\\\\n- _Revealing network Value priorities._ When each performance is presented to the network in terms of the values it extols, staking choices are a voting process on values.\\\");\\n       units.push(\\\"FUNDAMENTAL VALUE AND SPECULATION: KEYNES\\\\\\\\u2019 BEAUTY CONTEST\\\");\\n       units.push(\\\"Keynes was critical of stock market speculation. He was writing in the context of the 1920s stock market boom and the 1929 crash which directly connected to the Great Depression of the 1930s. In his _General Theory of Employment, Interest and Money_ (1936) he wrote of \\\\\\\\u2018the euthanasia of the rentier,\\\\\\\\u2019 referring not to a literal policy proposal but to the prediction that the lower interest rates he believed his policies would generate would mean that people could not live off the income stream of their assets. They would have to invest in \\\\\\\\u2018productive\\\\\\\\u2019 activities.\\\");\\n       units.push(\\\"Keynes\\\\\\\\u2019 critique of stock markets was that investors simply buy the stocks they think other people will buy, for the more people who want to buy a stock, the more its price will rise. Popular investing, he contended, has nothing to do with the underlying business proposition and assets of companies (often called the \\\\\\\\u2018fundamentals\\\\\\\\u2019) and everything to do with what investors think other people will do; indeed, what investors think other people think other people will do. It is apparent that, more than 90 years on, there is widespread adherence to Keynes\\\\\\\\u2019 interpretation of the stock market, and especially its application to investors in volatile cryptoasset markets, where many tokens are made up of narratives that lack underlying assets (\\\\\\\\u2018fundamentals\\\\\\\\u2019).\\\");\\n       units.push(\\\"We have differentiated staking in the new economic space from stock market investing in a capitalist economy, albeit accepting certain parallels, and from other forms of staking in cryptoeconomics.[97] Nonetheless, does Keynes\\\\\\\\u2019 caution about stock speculation apply to our proposals for reciprocal staking, especially in the light of a 2022 major downturn in crypto markets? We need to be clear about how our proposal is distinct from Keynes\\\\\\\\u2019 dramatic critique.\\\\\\\\n\\\\\\\\n[97] See Chapter 1.4 for this differentiation.\\\");\\n       units.push(\\\"Here is Keynes\\\\\\\\u2019 critique. (Readers are asked to overlook the almost 100-year-old social presumptions of both the object being described and the language used to describe it.)\\\");\\n       units.push(\\\"To identify the workings of investing in the stock market, Keynes used an analogy with a style of 1930s newspaper beauty contests in which readers were asked to choose the 6 prettiest faces from a page of 100 photographs. The prize, reported Keynes (1936: 156), was: \\\\\\\\nawarded to the competitor whose choice most nearly corresponds to the average preferences of the competitors as a whole; so that each competitor has to pick, not those faces which he himself finds prettiest, but those which he thinks likeliest to catch the fancy of the other competitors.\\\");\\n       //345\\n    }\\n    function set(uint256 location, string calldata _unit) external {\\n        units[location] = _unit;\\n    }\\n    function getById(uint256 location) external override returns (string memory unit) {\\n        return units[location];\\n    }\\n}\"\r\n    }\r\n  },\r\n  \"settings\": {\r\n    \"optimizer\": {\r\n      \"enabled\": false,\r\n      \"runs\": 200\r\n    },\r\n    \"outputSelection\": {\r\n      \"*\": {\r\n        \"*\": [\r\n          \"evm.bytecode\",\r\n          \"evm.deployedBytecode\",\r\n          \"devdoc\",\r\n          \"userdoc\",\r\n          \"metadata\",\r\n          \"abi\"\r\n        ]\r\n      }\r\n    },\r\n    \"libraries\": {}\r\n  }\r\n}}", "ABI": "[{\"inputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"constructor\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"location\",\"type\":\"uint256\"}],\"name\":\"getById\",\"outputs\":[{\"internalType\":\"string\",\"name\":\"unit\",\"type\":\"string\"}],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"location\",\"type\":\"uint256\"},{\"internalType\":\"string\",\"name\":\"_unit\",\"type\":\"string\"}],\"name\":\"set\",\"outputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"\",\"type\":\"uint256\"}],\"name\":\"units\",\"outputs\":[{\"internalType\":\"string\",\"name\":\"\",\"type\":\"string\"}],\"stateMutability\":\"view\",\"type\":\"function\"}]", "ContractName": "UnitStorage18", "CompilerVersion": "v0.8.4+commit.c7e474f2", "OptimizationUsed": "0", "Runs": "200", "ConstructorArguments": "", "EVMVersion": "Default", "Library": "", "LicenseType": "", "Proxy": "0", "Implementation": "", "SwarmSource": ""}