{"SourceCode": "{{\r\n  \"language\": \"Solidity\",\r\n  \"sources\": {\r\n    \"contracts/storage/IStorage.sol\": {\r\n      \"content\": \"pragma solidity ^0.8.4;\\n// SPDX-License-Identifier: GPL-3.0-or-later\\n\\n// https://soliditytips.com/articles/solidity-interface-interact-with-other-contracts/\\ninterface IStorage {\\n    function getById(uint256 id) external returns (string memory unit);\\n    // Add more function signatures as needed.\\n}\"\r\n    },\r\n    \"contracts/storage/unit/UnitStorage30.sol\": {\r\n      \"content\": \"     \\npragma solidity ^0.8.4;\\n// SPDX-License-Identifier: GPL-3.0-or-later\\nimport \\\"../IStorage.sol\\\";\\n\\ncontract UnitStorage30 is IStorage {\\n    string[] public units;\\n    \\n    // set to onlyOwner()\\n    // check if value exists - \\n    constructor(){\\n       //556\\n       units.push(\\\"These stability-generating loops offer no guarantees of the network being long-run stable in its outcomes on the terms we have nominated. We should not overstate the capacity for creating stable outcomes. History shows that guarantees of stable systems only come with authoritarian control, and then only for as long as resistance can be suppressed.\\\");\\n       units.push(\\\"Currently, nation states, for all their regulatory and legal enforcement capacities, are struggling to secure even modest economic stability. For those states, policies for stabilization must be reconciled with a politics of whose interests have been served by the instability, whose interests must be protected in any stabilization process, and hence who is going to absorb the costs of stabilization policies. Moreover, this playing out of deep conflicts has to all be wrapped in a policy discourse of economic necessity and common interest, while in fact being neither of those.\\\");\\n       units.push(\\\"We are not engaging in this same process. Although we describe the network as a commitment to a collective future, especially through reciprocal staking and the mechanisms of distributed credit, there is no suggestion that this is the playing out of a single, agreed vision. Protocols are about processes, not realizing a pre-given agenda. Our goal is that in creating the conditions for a collective future, divided aspirations have transparent expression and network conflicts have mechanisms to be played out in an orderly way; not hidden behind the idea that a centralized authority knows and implements the common good.\\\");\\n       units.push(\\\"TOKENIZED VALUE: SIMPLE AND EXPANDED\\\");\\n       units.push(\\\"Marx drew the distinction between the simple form of value (the exchange of commodities) and the general form of value (growth, or the accumulation of capital). Keynes drew a roughly similar distinction between a \\\\\\\\u2018real exchange economy\\\\\\\\u2019 (monetized barter) and a \\\\\\\\u2018monetary economy\\\\\\\\u2019 (which includes time, credit, liquidity and therefore risk) (see Appendix 8.1). How do we describe tokens in the expanded accumulation of a \\\\\\\\u2018monetary economy\\\\\\\\u2019?\\\");\\n       units.push(\\\"Each performance is itself (in combination with other performances) eventually revealed in the creation of commodities.[153] It could be a \\\\\\\\u2018conventional\\\\\\\\u2019 commodity (good or service) but performances have been framed in the Economic Space Protocol to engage also data commodities, or what we have called economic media. This focus represents what is distinctive about commodities in the 21st century compared with the eras of both Marx and Keynes: the rise to prominence of intangible outputs whose value-as-commodity is so difficult to specify (see Appendix 5.1).\\\\\\\\n\\\\\\\\n[153] Despite reference here to Marx, our use of the term \\\\\\\\u2018commodity,\\\\\\\\u2019 explained in footnote 71.\\\");\\n       units.push(\\\"In order to gain analytical access to data commodities, we have brought stake (and its projections of a contingent future of the performance) to the center of the analysis. The proposition is that the outputs of performances themselves may be difficult to define and measure, but that every proposed output should be measured by its intended outcomes, and that these can be expressed in measurable ways. But the stark, consequential expression of output evaluation is the preparedness to stake the process of their creation, and this can be clearly measured in a market process. Perhaps, it might be said, shifting from commodities being exchanged (Marx, Keynes) to performances being staked, and referring to this as the \\\\\\\\u2018simple\\\\\\\\u2019 form of value, is stretching the word \\\\\\\\u2018simple.\\\\\\\\u2019 But, we believe, this is necessary as a way of recognising the prominence of information in commodity-money relations.\\\");\\n       units.push(\\\"The expanded form of value in our analysis is qualitatively different from what we depict as the simple form, and the critical difference remains centered on the role of information. In this expanded version, information is not just the means by which individual agents make decisions about the future (what to stake). It is also the means by which the collective of agents (the network) reaches its determination of what constitutes value. For both Marx and Keynes, the rule of profit is central to delineating what parts of the economy grow via a cycle of profit and investment, and what parts shrink. For them, what constitutes \\\\\\\\u2018value\\\\\\\\u2019 is a resolved parameter, defined by the protocols that constitute capitalist accumulation. But in the new economic space, without a predetermined measure of \\\\\\\\u2018value,\\\\\\\\u2019 expansion becomes a more fluid process, for when agents stake performances, they not only project its creative success on a two dimensional scale (how profitable it will be) but now also on a third dimension (what will be judged socially to be valuable). In this framing, reading trends (information) is the universal key to explaining the dynamics of value.\\\");\\n       units.push(\\\"MV=PQ: AN APPLICATION TO THE ECONOMIC SPACE PROTOCOL TOKEN LOGIC\\\");\\n       units.push(\\\"The claim that the new economic space is grounded in fundamental value has been made on multiple occasions. It is perhaps a contentious one, predominantly because the concept itself is contentious.\\\");\\n       units.push(\\\"Many economists balk at the concept of \\\\\\\\u2018fundamental value.\\\\\\\\u2019 Some do so because they believe that current price in the market is a sufficient measure of \\\\\\\\u2018value\\\\\\\\u2019 and any idea that value is something \\\\\\\\u2018deeper\\\\\\\\u2019 than price, as the classical economists believe, is simply metaphysics. Hayek and the neo-classical economists are disposed to this view. Others, in the tradition of Keynes, (also) reject fundamental value specifically as it relates to asset prices. Asset prices, they say, incorporate guesses about the future expressed in the present and, as no-one can know the future, asset prices now are just expressions of popular opinion about the future (see Appendix 5.1).\\\");\\n       units.push(\\\"The Economic Space Protocol generates a direct connection between tokens and their material foundations in the \\\\\\\\u2018real\\\\\\\\u2019 economy. This foundation is what we mean by fundamental value: it implies a mode of valuing that looks to \\\\\\\\u2018deeper\\\\\\\\u2019 determinants (underliers) and discounts for speculation and short-term price movements. A clear connection between tokens and their underliers is itself a claim to a critical form of stability within the network.\\\");\\n       units.push(\\\"In cryptoeconomics, there emerged significant engagement with the concept of fundamental value, including via options pricing theory and the efficient markets hypothesis. We have made contributions to this debate in the past (e.g. Bryan 2018). Much analysis involves application of the old (originally 18th century; attributed to philosopher David Hume) \\\\\\\\u2018equation of exchange,\\\\\\\\u2019 often expressed as the \\\\\\\\u2018quantity theory of money.\\\\\\\\u2019 The Economic Space Protocol can give a version of a quantity theory as a way of verifying the direct connection of tokens to underliers at both the level of individual transactions and the level of the network overall.\\\");\\n       units.push(\\\"The formula of the old Quantity Theory of Money states: MV=PQ. Where: \\\\\\\\nM = the quantity of money in circulation, \\\\\\\\nV = its velocity of circulation of money, \\\\\\\\nP = the general price level in the economy and \\\\\\\\nQ = the quantity of goods and services sold in the economy.\\\");\\n       units.push(\\\"The cryptoeconomics discussion of this issue has been innovative and creative, albeit that interest in it appears to have fallen away in the past few years, despite the growing popularity of terms like \\\\\\\\u2018creator economy\\\\\\\\u2019 and \\\\\\\\u2018ownership economy\\\\\\\\u2019 which suggest the generation of measurable value.\\\");\\n       units.push(\\\"Taking MV=PQ into a crypto setting has required each of the variables be significantly adapted. Tokens are not simply \\\\\\\\u2018M,\\\\\\\\u2019 and hence V must change meaning (velocity of what?). In the Economic Space Protocol, \\\\\\\\u2018P\\\\\\\\u2019 is not a mono-measure of the terms of exchange and hence Q cannot be adequately expressed in relation to P.\\\");\\n       units.push(\\\"A token only comes into existence when an offer is matched (and expressed through the creation of a debit and a credit record on corresponding ledgers). As an aggregate, we can compile a list of offers. Thus an offer expresses the potential creation (supply) of a token. An exchange offer between a good or service (Q), and a token instrument (M), where Q units are in the bid and M units are in the ask, denotes the exchange ratio relationship between Q and M, that can be interpreted as the price (P) of a Q unit, in terms of M. V is the speed at which M is issued and cleared; an issue of liquidity considered Chapter 9.\\\");\\n       units.push(\\\"M represents the number of token units required to fulfill that exchange (Potential M). Since M is revolving, meaning it flows in both directions (as it is both \\\\\\\\u2018earned\\\\\\\\u2019 and \\\\\\\\u2018spent\\\\\\\\u2019) we can say that V is the average speed at which M flows in both directions in a given period of time. V then constitutes a multiplier where a net revolving amount of M, is required to fulfill all offers of Q at price P. Thus M x V = \\\\\\\\u2211(PM \\\\\\\\u00D7 Q) (per period of time used to calculate V).\\\");\\n       units.push(\\\"Where Q1P1 can be matched with Q2P2, netting represents an instant exchange, or it could be said that the M component can be netted away. The distributed market processes of offers and matching, closed by a netting process, gives a literal interpretation/verification of MV=PQ. Because every token offer (potential M) must be matched by a \\\\\\\\u2018commodity\\\\\\\\u2019 (PQ) in order to become \\\\\\\\u2018actual\\\\\\\\u2019 M, then M and PQ are \\\\\\\\u20182 sides of the same token offer.\\\\\\\\u2019 And in this context, with every match the M that is specific to it expires. New M comes into being with a new offer validated by its matching. In effect, the velocity of a token is infinite, so M tends towards 0: that is, the settlement of an exchange is at once the expiry of M. There is money flow, but no money _supply_ required: M can be deemed to have been simultaneously issued and redeemed. So MV=PQ is definitionaly true, albeit not quite as an identity (as it is in the quantity theory of money), but as a protocol design.\\\");\\n       //574\\n    }\\n    function set(uint256 location, string calldata _unit) external {\\n        units[location] = _unit;\\n    }\\n    function getById(uint256 location) external override returns (string memory unit) {\\n        return units[location];\\n    }\\n\\n}\"\r\n    }\r\n  },\r\n  \"settings\": {\r\n    \"optimizer\": {\r\n      \"enabled\": false,\r\n      \"runs\": 200\r\n    },\r\n    \"outputSelection\": {\r\n      \"*\": {\r\n        \"*\": [\r\n          \"evm.bytecode\",\r\n          \"evm.deployedBytecode\",\r\n          \"devdoc\",\r\n          \"userdoc\",\r\n          \"metadata\",\r\n          \"abi\"\r\n        ]\r\n      }\r\n    },\r\n    \"libraries\": {}\r\n  }\r\n}}", "ABI": "[{\"inputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"constructor\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"location\",\"type\":\"uint256\"}],\"name\":\"getById\",\"outputs\":[{\"internalType\":\"string\",\"name\":\"unit\",\"type\":\"string\"}],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"location\",\"type\":\"uint256\"},{\"internalType\":\"string\",\"name\":\"_unit\",\"type\":\"string\"}],\"name\":\"set\",\"outputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"\",\"type\":\"uint256\"}],\"name\":\"units\",\"outputs\":[{\"internalType\":\"string\",\"name\":\"\",\"type\":\"string\"}],\"stateMutability\":\"view\",\"type\":\"function\"}]", "ContractName": "UnitStorage30", "CompilerVersion": "v0.8.4+commit.c7e474f2", "OptimizationUsed": "0", "Runs": "200", "ConstructorArguments": "", "EVMVersion": "Default", "Library": "", "LicenseType": "", "Proxy": "0", "Implementation": "", "SwarmSource": ""}