// SPDX-License-Identifier: MIT

pragma solidity ^0.8.0;

/// @title: Many Faces OE
/// @author: manifold.xyz

import "./manifold/ERC1155Creator.sol";

////////////////////////////////////////////////////////////////////////////////////
//                                                                                //
//                                                                                //
//    (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ)     //
//    (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ)     //
//    (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ)     //
//    (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ)     //
//    (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ)     //
//    (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ)     //
//    (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ)     //
//    (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ)     //
//    (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ)     //
//    (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ)     //
//    (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ)     //
//    (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ)     //
//    (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ)     //
//    (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ)     //
//    (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ)     //
//    (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ)     //
//    (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ)     //
//    (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ)     //
//    (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ)     //
//    (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ)     //
//    (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ)     //
//    (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ)     //
//    (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ)     //
//    (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ)     //
//    (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ)     //
//    (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ)     //
//    (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ)     //
//    (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ)     //
//    (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ)     //
//    (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ)     //
//    (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ) (ㆆ _ ㆆ)     //
//                                                                                //
//                                                                                //
////////////////////////////////////////////////////////////////////////////////////


contract MF is ERC1155Creator {
    constructor() ERC1155Creator("Many Faces OE", "MF") {}
}