// SPDX-License-Identifier: MIT

pragma solidity ^0.8.0;

/// @title: Angela Mantilla
/// @author: manifold.xyz

import "./manifold/ERC721Creator.sol";

////////////////////////////////////////////////////////
//                                                    //
//                                                    //
//       _____                                        //
//      (, /  |                  /)                   //
//        /---|  __     _    _  //   _                //
//     ) /    |_ / (_  (_/__(/_(/_  (_(_              //
//    (_/             .-/                             //
//                   (_/                              //
//       __     __)                                   //
//      (, /|  /|                 ,   /)   /)         //
//        / | / |    _  __  _/_      //   //   _      //
//     ) /  |/  |_  (_(_/ (_(__ _(_ (/_  (/_  (_(_    //
//    (_/   '                                         //
//                                                    //
//                                                    //
//                                                    //
//    𝕨𝕨𝕨.𝕒𝕟𝕘𝕖𝕝𝕒𝕞𝕒𝕟𝕥𝕚𝕝𝕝𝕒.𝕔𝕠𝕞      //
//                                                    //
//                                                    //
////////////////////////////////////////////////////////


contract AM is ERC721Creator {
    constructor() ERC721Creator("Angela Mantilla", "AM") {}
}