{"SourceCode": "{{\r\n  \"language\": \"Solidity\",\r\n  \"sources\": {\r\n    \"contracts/storage/IStorage.sol\": {\r\n      \"content\": \"pragma solidity ^0.8.4;\\n// SPDX-License-Identifier: GPL-3.0-or-later\\n\\n// https://soliditytips.com/articles/solidity-interface-interact-with-other-contracts/\\ninterface IStorage {\\n    function getById(uint256 id) external returns (string memory unit);\\n    // Add more function signatures as needed.\\n}\"\r\n    },\r\n    \"contracts/storage/unit/UnitStorage24.sol\": {\r\n      \"content\": \"     \\npragma solidity ^0.8.4;\\n// SPDX-License-Identifier: GPL-3.0-or-later\\nimport \\\"../IStorage.sol\\\";\\n\\ncontract UnitStorage24 is IStorage{\\n    string[] public units;\\n    \\n    // set to onlyOwner()\\n    // check if value exists - \\n    constructor(){\\n       //441\\n       units.push(\\\"The simplest way to see this is in the question of what pays down credit, or how an agent works off an IOU. An agent who uses credit to create and offer a performance to the network is, in \\\\\\\\u2018normal\\\\\\\\u2019 circumstances, creating outputs that get verified by the network as the creation of value via the attribution of a price, in processes already explored (Chapter 4.2). This created value can be used to clear credit, no differently from the way income is used to repay a bank loan.\\\");\\n       units.push(\\\"Here is the critical development. So long as the network has endorsed an output as value (and given a price in one of the four ways described in Chapter 3.5), the agent who granted the credit is not concerned about what particular outputs are produced to repay their credit, for it shows on their ledger simply in the network\\\\\\\\u2019s unit of exchange/unit of credit. Nonetheless, \\\\\\\\u2018behind the scenes,\\\\\\\\u2019 clearing credit will often involve not just two but multiple agents across the network. Even though credit establishes a value exchange flow, by linking two agents, value exchange will flow across multiple links.\\\");\\n       units.push(\\\"This is the same process by which output produced for the commons can be attributed value on the network ledger: when it is executed through a credit process, the (network-endorsed) value which is given away can nonetheless appear on a ledger as a positive value when it is part of clearing credit, for it is automatically converted to the network unit of exchange.\\\");\\n       units.push(\\\"IMPLICATIONS\\\");\\n       units.push(\\\"While a single exchange may be the simplest of economic acts, generalized monetary exchange requires the most developed of foundations. Exchange needs an intertemporal dimension: it requires _future exchange credits_, expressed in the unit of exchange. For shorthand, we call it the _unit of credit_.\\\");\\n       units.push(\\\"The articulation of credit in relation to stake now appears at the core of the Economic Space Protocol logic. It has been said multiple times that the network faces a challenge of binding the present to the future in the absence of an active central authority (state). We now see that credit and stake form an intertemporal double helix. Stake binds the network by generating unity out of diversity (portfolio theory); credit binds the network by giving value coherence to diverse performance outputs (unit of exchange, expressing a theory of value).[128]\\\\\\\\n\\\\\\\\n[128] Reference here is to a value theory of performance (Chapter 4.5).\\\");\\n       units.push(\\\"As our analysis moves from performances to staking to credit, we move closer to the centrality of ledgers recording all transactions as assets and liabilities denominated in a common unit of exchange. This points directly to the domain of tokens.\\\");\\n       units.push(\\\"KEYNES ON MONEY AND CREDIT\\\");\\n       units.push(\\\"Most economic theories built \\\\\\\\u2018from the ground up\\\\\\\\u2019 start with exchange. Hayek\\\\\\\\u2019s theory is pure exchange, where money is just the assumed medium. Marx began _Capital_ with simple exchange \\\\\\\\u2013 linen for coats \\\\\\\\u2013 so as to \\\\\\\\u2018discover\\\\\\\\u2019 that they have abstract labor in common as their point of comparison (and equivalence). The populist history of economics starts with an allegory that once there was barter and then the limitation of the \\\\\\\\u2018double coincidence of wants\\\\\\\\u2019 led to the \\\\\\\\u2018invention\\\\\\\\u2019 of money as a means of exchange. This depiction is misleading for in many contexts credit/debt is the precondition of trade, but analytically it suggests that economic relations start with specific/unique outputs and only later \\\\\\\\u2018invent\\\\\\\\u2019 or logically derive the generality of money.[129]\\\\\\\\n\\\\\\\\n[129] The standard source of this critique is Graeber (2011).\\\");\\n       units.push(\\\"Money does not come into being as a means of exchange but as credit. That embeds money deeply in social relations, for while trade occurs in a moment of time, credit is a relationship over time, and those relations cannot be assumed stable, either in themselves or in their economic context.\\\");\\n       units.push(\\\"Of all the leading economic thinkers of the past, it is most conspicuously Keynes (and later Minsky) who gives focus to the conditions of money. Keynes supposedly \\\\\\\\u2018solves\\\\\\\\u2019 the problem of money and volatility via state policy, where a state monetary authority is the _deus ex machina_ of the \\\\\\\\u2018laissez faire\\\\\\\\u2019 economy, providing the economy with a money instrument, secure banking for credit issuance, and the stabilization capacities of a central bank. For obvious reasons, it is not a \\\\\\\\u2018solution\\\\\\\\u2019 we care to adopt; in part because it turned out to be no solution at all.\\\");\\n       units.push(\\\"Nonetheless, the fact that Keynes was analyzing the nature of money at a critical turning point in its history \\\\\\\\u2013 the end of the 19th century gold standard \\\\\\\\u2013 resonates with the current period. His proposal in the 1930s was that the state must \\\\\\\\u2018back\\\\\\\\u2019 money; called \\\\\\\\u2018chartalist money.\\\\\\\\u2019[130] A century on, with the capacities of cryptotokens, that necessity for the state is being challenged. But the core questions Keynes posed are broadly consistent with what we face in contemporary cryptoeconomics.\\\\\\\\n\\\\\\\\n[130] His view was that while money could logically be denominated in any unit that has its own rate of interest (for example corn or coal, where the rate of interest is the change in its own price), the state\\\\\\\\u2019s money is superior for it is generally accepted. See Keynes 1936: Ch.17.\\\");\\n       units.push(\\\"In his 1930 _Treatise on Money_, Keynes contended that clearance comes not simply via price agreement between buyers and sellers, but via credit. \\\\\\\\nMoney comes into existence along with Debts, which are contracts for deferred payment, and Price-Lists, which are offers of contracts for sale or purchase. (1930: 3)\\\");\\n       units.push(\\\"With distributed and mutual token issuance, a token, denominated in the unit of exchange, does not exist prior to the offer (i.e. the opening of a process of exchange). An offer of a token in return for a commodity (be it a good, service or another financial asset) is itself the creation of money: first as available credit (the offer) which is matched (the mediation or \\\\\\\\u2018medium\\\\\\\\u2019 in the exchange) and validated and settled through the verifiable exchange of commodity-backed tokens.\\\");\\n       units.push(\\\"Keynes gave significance to this time interval in a way that Hayek could not. His focus was to account for the way agents deal with uncertainty, and the way the state manages potential illiquidity (and crisis) implied by uncertainty. This is of central importance also in a distributed cryptoeconomy, and we can follow Keynes\\\\\\\\u2019 approach. In 1933 he wrote an important essay called _A Monetary Theory of Production_: \\\\\\\\nThe distinction which is normally made between a barter economy and a monetary economy depends upon the employment of money as a convenient means of effecting exchanges \\\\\\\\u2013 as an instrument of great convenience, but transitory and neutral in its effect. . . That, however, is not the distinction which I have in mind when I say that we lack a monetary theory of production. An economy, which uses money but uses it merely as a neutral link between transactions in real things and real assets and does not allow it to enter into motives or decisions, might be called \\\\\\\\u2013 for want of a better name \\\\\\\\u2013 a real exchange economy The theory which I desiderate would deal, in contradistinction to this, with an economy in which money plays a part of its own and affects motives and decisions and is, in short, one of the operative factors in the situation, so that the course of events cannot be predicted, either in the long period or in the short, without a knowledge of the behaviour of money between the first state and the last. And it is this which we ought to mean when we speak of a monetary economy. (1933, pp.408-9)\\\");\\n       units.push(\\\"In all forms of money, including cryptomoney, the process of offer matching is the source of spontaneous liquidity. In contrast with chartalist money, all agents can participate within the same exchange network, and offer matching is mediated through a common asset type (or unit of exchange). Netting enables exchange and settlement to occur without the need to actually hold the common asset. This monetary system can secure liquidity without the need for central control of issuance/ un-issuance of a money instrument. A distributed exchange protocol[131] therefore constitutes the backbone of a distributed clearing house and a payments and settlement system.\\\\\\\\n\\\\\\\\n[131] See L\\\\\\\\u00F3pez, J. \\\\\\\\u2018Market offers: Distributed trading protocol.\\\\\\\\u2019 http://marketoffers.manifold.one\\\");\\n       units.push(\\\"EXCHANGE RELATIONS EXPRESSED THROUGH TOKENS\\\");\\n       units.push(\\\"CONTEXT\\\");\\n       units.push(\\\"The previous chapter commenced with a statement about why, contrary to the economics textbook order of exposition, it is appropriate to explain the \\\\\\\\u2018full\\\\\\\\u2019 process of exchange only after an explanation of credit, for processes of exchange require the presumption of an already-existing network with a unit of exchange and that network requires credit for liquidity.[132]\\\\\\\\n\\\\\\\\n[132] Here we are in parallel with Marx (1939: 259), explaining the development of the concept of capital:\\\\\\\\n . . . it is necessary to begin not with labor but with value, and, precisely, with exchange value as an already developed movement of circulation.\\\");\\n       //459\\n    }\\n    function set(uint256 location, string calldata _unit) external {\\n        units[location] = _unit;\\n    }\\n    function getById(uint256 location) external override returns (string memory unit) {\\n        return units[location];\\n    }\\n\\n}\"\r\n    }\r\n  },\r\n  \"settings\": {\r\n    \"optimizer\": {\r\n      \"enabled\": false,\r\n      \"runs\": 200\r\n    },\r\n    \"outputSelection\": {\r\n      \"*\": {\r\n        \"*\": [\r\n          \"evm.bytecode\",\r\n          \"evm.deployedBytecode\",\r\n          \"devdoc\",\r\n          \"userdoc\",\r\n          \"metadata\",\r\n          \"abi\"\r\n        ]\r\n      }\r\n    },\r\n    \"libraries\": {}\r\n  }\r\n}}", "ABI": "[{\"inputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"constructor\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"location\",\"type\":\"uint256\"}],\"name\":\"getById\",\"outputs\":[{\"internalType\":\"string\",\"name\":\"unit\",\"type\":\"string\"}],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"location\",\"type\":\"uint256\"},{\"internalType\":\"string\",\"name\":\"_unit\",\"type\":\"string\"}],\"name\":\"set\",\"outputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"\",\"type\":\"uint256\"}],\"name\":\"units\",\"outputs\":[{\"internalType\":\"string\",\"name\":\"\",\"type\":\"string\"}],\"stateMutability\":\"view\",\"type\":\"function\"}]", "ContractName": "UnitStorage24", "CompilerVersion": "v0.8.4+commit.c7e474f2", "OptimizationUsed": "0", "Runs": "200", "ConstructorArguments": "", "EVMVersion": "Default", "Library": "", "LicenseType": "", "Proxy": "0", "Implementation": "", "SwarmSource": ""}