// SPDX-License-Identifier: MIT

pragma solidity ^0.8.0;

/// @title: How Do Ya Pronounce Your Pronouns?
/// @author: manifold.xyz

import "./manifold/ERC721Creator.sol";

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//                                                                                                                                                                                                                                                                                                                                                                                                                                        //
//                                                                                                                                                                                                                                                                                                                                                                                                                                        //
//    Ḩ̵̭̖͈̣̝͂̏͒ȍ̶̩̩́̅̈͊͗̈̚̕w̵̡̝̹͍͚̉̅͊͛͂̿̀̚ ̷͓̱̫̒d̶̢͉̪͍̻́͜ȏ̶͓̫͉̗̥̟̱͌̋͑ ̶̠͓̔͗y̶̨̛̥̟̺̘̰̞̺̓̉̋̈́͗̏͠a̵͍̹͍̙̲̩͉̪̒̓̚̚͘ ̸̢̧̪̘̼̯̑̽̆̋̕͘͘͠͠p̸̍͌͜͝r̸̡̛̪̖͎̅̽̊̇͝o̸̖̟͕̩̿̄̚n̵̞͙̫̺͔͍̍̂̇̈́̾̿̚͝ȍ̴̹͍̜u̶̮͉̪̪̠̿̊n̴̡̧̙͍̱̭̘̙̫̗̏̄̂̏́̋̈́c̸̹͍̣̫̗̜̹͙̖̄̔͜ĕ̵̬͉̩̃͒̅́̕ ̸̢̥̮̞̠̼̼̥̮̤͋̓y̷̧̲̮͙̩̞̰͌͋͋͌͋̎͝͝o̸̰͊̈́̓͗̂͋̀̑͐͝ͅͅu̶̮͔̹̜̮̬̰̾̾r̴̛̖͚̉̈́̽͐ ̵̞̌́̈̾̈́͑͘p̵̹̫͙͚̫͋͒̅͋͝r̶̡̤͖̦̬͇̰̖̎̔̌̉̈́̎́̾̾̕͜ǫ̷̙͖͖͓̤̞̱͊̽n̶̝̲̠͐̑̂̀̐͜o̸̤̥͔̮͓̞̞̝̿̒͊͌̎̊͜ǘ̴͔̼̼͕̩͗̀̑̈́̓̏͑̚̚n̸̡̡̠̲̲͔͒s̸̝̗̘͓̈́̊͌?̴̠̐̉̚̕    //
//                                                                                                                                                                                                                                                                                                                                                                                                                                        //
//                                                                                                                                                                                                                                                                                                                                                                                                                                        //
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


contract HDY is ERC721Creator {
    constructor() ERC721Creator("How Do Ya Pronounce Your Pronouns?", "HDY") {}
}