// SPDX-License-Identifier: MIT

pragma solidity ^0.8.0;

/// @title: (･∀･ )( ･∀･)
/// @author: manifold.xyz

import "./manifold/ERC721Creator.sol";

//////////////////////////////////////////////
//                                          //
//                                          //
//    ガ━━（ﾟДﾟ;)━━ン！ｶﾞ━━ΣΣ(ﾟДﾟ;)━━ﾝ!!        //
//                                          //
//    ﾏﾀﾞｧ-? （･∀･ ）っ/凵⌒☆ﾁﾝﾁﾝ                //
//    ﾏﾀﾞｧ-? （･∀･ ）っ/凵⌒☆ﾁﾝﾁﾝ                //
//    ﾏﾀﾞｧ-? （･∀･ ）っ/凵⌒☆ﾁﾝﾁﾝ                //
//    ﾏﾀﾞｧ-? （･∀･ ）っ/凵⌒☆ﾁﾝﾁﾝ                //
//    ﾏﾀﾞｧ-? （･∀･ ）っ/凵⌒☆ﾁﾝﾁﾝ                //
//    ﾏﾀﾞｧ-? （･∀･ ）っ/凵⌒☆ﾁﾝﾁﾝ                //
//    ﾏﾀﾞｧ-? （･∀･ ）っ/凵⌒☆ﾁﾝﾁﾝ                //
//    ﾏﾀﾞｧ-? （･∀･ ）っ/凵⌒☆ﾁﾝﾁﾝ                //
//    ﾏﾀﾞｧ-? （･∀･ ）っ/凵⌒☆ﾁﾝﾁﾝ                //
//    ﾏﾀﾞｧ-? （･∀･ ）っ/凵⌒☆ﾁﾝﾁﾝ                //
//    ﾏﾀﾞｧ-? （･∀･ ）っ/凵⌒☆ﾁﾝﾁﾝ                //
//    ﾏﾀﾞｧ-? （･∀･ ）っ/凵⌒☆ﾁﾝﾁﾝ                //
//                                          //
//    ｶﾞ━━(ﾟДﾟ;)━━━ﾝ!!!!!ド━━━(゜ロ゜；)━━ン!!    //
//                                          //
//                                          //
//////////////////////////////////////////////


contract BTC is ERC721Creator {
    constructor() ERC721Creator(unicode"(･∀･ )( ･∀･)", "BTC") {}
}