// SPDX-License-Identifier: MIT

pragma solidity ^0.8.0;

/// @title: progress
/// @author: manifold.xyz

import "./ERC721Creator.sol";

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//                                                                                                                                                   //
//                                                                                                                                                   //
//    𝒐𝒏𝒄𝒆 𝒂𝒈𝒂𝒊𝒏 𝒚𝒐𝒖 𝒉𝒂𝒗𝒆 𝒄𝒐𝒎𝒆 𝒉𝒆𝒓𝒆 𝒆𝒙𝒑𝒆𝒄𝒕𝒊𝒏𝒈 𝒔𝒐𝒎𝒆 𝒔𝒐𝒓𝒕 𝒐𝒇 𝒇𝒂𝒏𝒄𝒚 𝒂𝒔𝒄𝒊𝒊 𝒂𝒓𝒕𝒘𝒐𝒓𝒌           //
//    𝒉𝒊𝒅𝒅𝒆𝒏 𝒅𝒆𝒆𝒑 𝒘𝒊𝒕𝒉𝒊𝒏 𝒕𝒉𝒆 𝒆𝒕𝒉𝒆𝒓𝒔𝒄𝒂𝒏 𝒇𝒐𝒓 𝒎𝒚 𝒄𝒐𝒏𝒕𝒓𝒂𝒄𝒕. 𝒊 𝒉𝒐𝒑𝒆 𝒏𝒐𝒕 𝒕𝒐 𝒅𝒊𝒔𝒂𝒑𝒑𝒐𝒊𝒏𝒕        //
//    𝒚𝒐𝒖, 𝒃𝒖𝒕 𝒕𝒉𝒆 𝒂𝒓𝒕𝒘𝒐𝒓𝒌 𝒄𝒂𝒏 𝒃𝒆 𝒇𝒐𝒖𝒏𝒅 𝒅𝒆𝒑𝒍𝒐𝒚𝒆𝒅 𝒘𝒊𝒕𝒉𝒊𝒏 𝒕𝒉𝒆 𝒄𝒐𝒏𝒕𝒓𝒂𝒄𝒕 𝒊𝒏𝒔𝒕𝒆𝒂𝒅,              //
//    𝒊𝒕'𝒔 𝒓𝒆𝒂𝒍𝒍𝒚 𝒏𝒐𝒕 𝒔𝒖𝒑𝒑𝒐𝒔𝒆𝒅 𝒕𝒐 𝒈𝒐 𝒉𝒆𝒓𝒆.                                                                               //
//                                                                                                                                                   //
//    𝒔𝒕𝒊𝒍𝒍 𝒉𝒆𝒓𝒆?                                                                                                                           //
//                                                                                                                                                   //
//    𝒐𝒌, 𝒘𝒆𝒍𝒍 𝒎𝒊𝒈𝒉𝒕 𝒂𝒔 𝒘𝒆𝒍𝒍 𝒕𝒆𝒍𝒍 𝒚𝒐𝒖 𝒂𝒃𝒐𝒖𝒕 𝒕𝒉𝒆 𝒑𝒓𝒐𝒋𝒆𝒄𝒕. 𝒕𝒉𝒊𝒔 𝒊𝒔 𝒑𝒓𝒐𝒈𝒓𝒆𝒔𝒔, 𝒂                   //
//    𝒄𝒐𝒏𝒕𝒊𝒏𝒖𝒐𝒖𝒔𝒍𝒚 𝒆𝒗𝒐𝒍𝒗𝒊𝒏𝒈 𝒔𝒆𝒕 𝒐𝒇 𝒂𝒓𝒕𝒘𝒐𝒓𝒌𝒔 𝒕𝒉𝒂𝒕 𝒅𝒆𝒎𝒐𝒏𝒔𝒕𝒓𝒂𝒕𝒆 𝒎𝒚 𝒑𝒓𝒐𝒈𝒓𝒆𝒔𝒔 𝒕𝒐𝒘𝒂𝒓𝒅𝒔    //
//    𝒍𝒐𝒏𝒈𝒆𝒓 𝒇𝒐𝒓𝒎 𝒈𝒆𝒏𝒆𝒓𝒂𝒕𝒊𝒗𝒆 𝒂𝒓𝒕𝒘𝒐𝒓𝒌. 𝒆𝒂𝒄𝒉 𝒑𝒊𝒆𝒄𝒆 𝒊𝒔 𝒐𝒏𝒍𝒚 𝒂𝒗𝒂𝒊𝒍𝒂𝒃𝒍𝒆 𝒖𝒏𝒕𝒊𝒍 𝒊𝒕'𝒔 𝒏𝒐𝒕,     //
//    𝒔𝒐 𝒚𝒐𝒖 𝒃𝒆𝒕𝒕𝒆𝒓 𝒈𝒐 𝒃𝒊𝒅 𝒐𝒏 𝒊𝒕 𝒏𝒐𝒘!                                                                                         //
//                                                                                                                                                   //
//                                                                                                                                                   //
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


contract next is ERC721Creator {
    constructor() ERC721Creator("progress", "next") {}
}