{"SourceCode": "{{\r\n  \"language\": \"Solidity\",\r\n  \"sources\": {\r\n    \"contracts/storage/IStorage.sol\": {\r\n      \"content\": \"pragma solidity ^0.8.4;\\n// SPDX-License-Identifier: GPL-3.0-or-later\\n\\n// https://soliditytips.com/articles/solidity-interface-interact-with-other-contracts/\\ninterface IStorage {\\n    function getById(uint256 id) external returns (string memory unit);\\n    // Add more function signatures as needed.\\n}\"\r\n    },\r\n    \"contracts/storage/unit/UnitStorage2.sol\": {\r\n      \"content\": \"     \\npragma solidity ^0.8.4;\\n// SPDX-License-Identifier: GPL-3.0-or-later\\nimport \\\"../IStorage.sol\\\";\\n\\ncontract UnitStorage2 is IStorage{\\n    string[] public units;\\n    \\n    // set to onlyOwner()\\n    // check if value exists - \\n    constructor(){\\n        // 21\\n       units.push(\\\"Why do the cybernetics of sociality matter? For our futurity and indeed for our survival, we require an alternative to monological systems of value as expressed in national monies. We require, in short, a _multi-dimensional_ modality of valuation not bound by the econometrics and informatic collapse inherent in capital. Multidimensional valuation implies the creation of eco-social relations that can dialogically express and preserve discourse-based values on an economic substrate, while being programmable in real time by any and all participants. (Before anyone up and leaves at the sudden thought of having to wake up and program, think first of an interface like _Instagram_ with a tunable economic logic built in. Think also of how these already-familiar technologies of social mediation change our experiences and actualities of relation and \\\\\\\\u2018reality.\\\\\\\\u2019) We require the power to qualify value and to allow such qualification to both persist in an economic system and be computable. Ultimately, we will require that this system itself be collectively owned; that it be a commons.\\\");\\n       units.push(\\\"Robust economic media, capable of heteroglossic and dialogical forms of account, are required to create a multiperspectival values-system. These media demand far more than merely a non-national variant of monetary media expressive of the capitalist value form. While the non-national dimension of cryptocurrencies introduced a significant rupture with conventional monetary substrates, platformed as they are as national currencies on nation states, their legally recognized institutions and their military police, this ultimately simple replatforming of singular denominations on distributed computing by existing cryptocurrencies is not enough. Bitcoin did in fact break the nationally managed monopolies on 21st century monetary issuance by introducing a scalable currency(/asset/option) platformed on distributed computing, but it has done, and can do, little or nothing to challenge the monologic denomination of value as a one-dimensional, that is as a unitary, currency format. Bitcoin may contest the nation, but it, and its fetishism, is all about it being an option on the value-form as historically worked up under, and as, capitalism. The question \\\\\\\\u2018Bitcoin or USD\\\\\\\\u2019 scarcely touches the relations of production. We must see clearly that the \\\\\\\\u2018disintermediation\\\\\\\\u2019 of \\\\\\\\u2018trusted third parties\\\\\\\\u2019 and of existing states, even if it were to be accomplished, is only one part of the picture of a liberated monetary medium, which is also to say, a liberated socius. We require the possibility for _anyone_ to offer denominations of value that can be taken up by those who share such values as specified and indeed offered in the proffered denomination. Only then will we have a genuinely multiperspectival system.\\\");\\n       units.push(\\\"To foreground this possibility of reprogramming a global operating system, one that is at once computational and financial, stakes a claim for a different order of significance for cryptomedia. Even Ethereum, and other \\\\\\\\u2018Layer 1\\\\\\\\u2019 projects that utilize smart contracts and allow for further token issuance, lack a robust grammar for composable asset creation and peer-to-peer issuance; a grammar that would allow for the on-chain preservation of qualities and the spontaneous creation of denominations. Outlining the emergence of a far more robust economic medium than what is currently wet dreamt by the \\\\\\\\u2018when Lambo?\\\\\\\\u2019 crypto bros going on about libertarian forms of self-sovereignty, _Protocols_ posits a transformation not just of economy but of sociality, of subjectivity, of national politics and of ecopolitics by means of the composition and recomposition of relations of production. For those actively working in the ECSA project, what unites us as current contributors, even among our many differences, is that the radical development of economic media means that the intelligence of sociality, including that which has not been subsumed, can work for the socius, rather than be captured, farmed, privatized and put back on the market in an arbitrage on knowledge, where proprietary innovation captures the returns.\\\");\\n       units.push(\\\"As _Protocols_ explains, robust economic media mean that, through the equitable nomination of new asset classes and the collective denomination of values (practices which will require networked recognition, participation and validation), innovation can be collectively shared rather than capitalized. The text argues that through the sharing of stake, wealth, whose actual origins are inexorably social, can be socialized. We might add that _Protocols_ intimates that society might ultimately be decolonized because it would, after a time, no longer be organized from the imperial standpoint of Value. The deep plurality of being, though suppressed in commodity reification and egoism alike, but in fact constituting each and all, might at last be felt and actualized. It means, in short, that the other person might at last become not a limit to your freedom, but the realization of it.\\\");\\n       units.push(\\\"Note that no other major crypto project addresses the world in these terms. Nor do they think very deeply, if at all, about the adjoined problem of sovereignty _and_ subjectivity, or the cybernetics thereof. It has become clearer to the participants in the ECSA project that the form many recognize as the sovereign individual is but an iteration of the value form, an avatar of capital.[2] But given these economic and formal overdeterminations of agency and the reign of this type of sovereignty, we see that history, or at least collective survival, demands better chances. We have had enough of egomania and nationalism. The significance of things on the ground must be registered and economically expressed. To those ends, _Protocols for Postcapitalist Expression_ is in pursuit of something of a different order; something that must _risk_ the increasing granularization and resolution of computing and of the economy that computing has always expressed. _Protocols_ must risk this granularization and resolution _because that is what is already happening._ But collective survival necessitates something that also simultaneously enables a _detournement_ of extant economic logics and practices. ECSA\\\\\\\\u2019s analysis recognizes that the concentration of agency, whether in the form of the propertied individual or of the propertied immortal individuals called corporations and states, requires the collapse of the concerns of others, of their perspectives and of their information. It is precisely the refusal of that collapse that motivates the work presented in _Protocols_.\\\\\\\\n\\\\\\\\n[2] Whatever its specific embodiment, the sovereign subject that dominates Western philosophy is the subject of property. \\\\\\\\u2018He\\\\\\\\u2019 is semiotically, psychologically ideologically, and materially constituted through \\\\\\\\u2018his\\\\\\\\u2019 whiteness and cis-masculinity, the outputs of the representational and material systems that are among his dividends from colonization and slavery.\\\");\\n       units.push(\\\"The book reveals another economic path than to have your interests collapsed as bank interest. The world is / we are ready for an economic and computational grammar that is answerable in new ways. That also means programmable in new ways, where programming by the many becomes both the way to answer economic precarity and the means to posit and preserve a plurality of qualitative values. We will answer economy with economy! The leveraged monologue of national monies, the leveraged computing architectures of privately-owned platforms, the near monopoly on who can issue what kinds of monies and types of financial instruments, including derivatives, must, if the people and ecosystems of Earth are to thrive, be delimited and, in their current forms, swept away. All of these media, we now perceive, are not only financial forms, but also informatic forms: programs in every sense of the word. They are integrated, interoperating systems, and are systems of account beholden, ultimately, to little other than profit in nationally-denominated monies; monies, we can remind ourselves, that are optimized by states and supported by their historical, institutionalized forms of organizational inequality, prisons and warlike foreign policy.\\\");\\n       units.push(\\\"ECSA understands these systems of account, whether conceived of as interfaces, databases, financial instruments and ledgers, or as forms of money or money as capital, to be _semantic forms_; forms that have meaning and thus compatibility and commensurability with one another, but also, and as importantly, forms that put exorbitant pressure on life and _its_ meanings. Today\\\\\\\\u2019s socio-economic systems threaten insolvency, war and extinction. They threaten all forms of meaning-making that are close to the flesh and close to the earth: desire, the imagination, consciousness, speech, writing, landscape, oceans, the body, the self. They pressure meaning, living and life, and can do so because money is composed of a set of contracts; contracts that, in effect, have subsumed, and then become, the social contract. That subsumption of the social contract by the protocols of the media of racial capitalism is the ultimate meaning of \\\\\\\\u2018the dissolution of traditional societies.\\\\\\\\u2019 The ECSA project, to create non-extractive, disalienating, just economy and sociality, is given new impetus with this volume and the promise it holds. A recasting of the current social contract has long been dreamt. At last, perhaps, we have an option on postcapitalism; one that, by reimagining the who and the how in the creation of contracts, will allow us to open and live in the spread between two basic futures: collectivism or extinction.\\\");\\n       units.push(\\\"The \\\\\\\\u2018one last dangerous game\\\\\\\\u2019 proposed here feels correct and indeed compelling. It contends that, against disaster, our species has some chance of survival where the odds increase if we can use collective intelligence to wager livable futures. Whether in the form of decolonial resurgence, platform cooperatives, or hospice, I cannot say, but to offer the care the planet requires seems to involve an even deeper entry of the species and the bios into informatics and economics. It will not be lost on anyone that the digital operations of these very things have already done so much harm.\\\");\\n       units.push(\\\"The book in your hands or on your screen would be a new beginning. It represents not a settling of accounts but a new mode of accounting and of being accountable to one another. A revaluation of values becomes possible by means of what is here called an \\\\\\\\u2018economic grammar,\\\\\\\\u2019 a grammar for the assemblage of new relations of production and thus new modes of production, and new forms of (collective) relation and self-governance. The core idea is to express values differently, such that the qualitative concerns of any and potentially all members of society may be expressed at once semantically and economically on a persistent and programmable substrate. These values may be assembled by many parties and then used to coordinate performances in accord with socially agreed upon and thus collectively mandated metrics. \\\\\\\\u2018Agreement\\\\\\\\u2019 here is a semantic and an economic term that, though formally accurate, is not quite adequate to affectively express the character and indeed the _feel_ of social co-creation ECSA sees as becoming possible with a new grammar for the multitudes.\\\");\\n       units.push(\\\"As a starting point among starting points, this text comes out of years of research at ECSA and offers the most comprehensive treatment and latest refinements of a set of protocols based on an analysis of finance, monetary networks, and the extractive processes of postmodern value production. A critique of this latter, namely the capture of semiotic and other forms of social performances by ambient computing, has enabled ECSA to endeavor to liberate social performances from such capture. \\\\\\\\u2018Performance\\\\\\\\u2019 in this text has emerged, dialectically as it were, as the most general act of production; what is extracted on the job, at work, on social media, in maker-spaces and in the arts. Always dialogical, performance can be taken as a category of social interaction and world-creation that names the emergent superset for other productive capacities designated by terms including labor, attention, attention economy, cognition, cognitive capitalism and virtuosity.\\\");\\n       units.push(\\\"Counter-intuitively perhaps, the strategy includes the generalization of the power to issue - to issue financial instruments that not only fund co-creation, but create possibilities for speculation and arbitrage. A capacity to express, issue, and wager on shared futures shifts the economic ground, particularly for the smallest players who currently have no access to scripting economic protocols with which a shared future might be wagered. Can we create with and for one another\\\\\\\\u2019s todays and tomorrows in ways that cause less suffering and are more convivial than they could be were we to attempt to do it in the capitalist markets? Can we use our powers of co-creation to siphon value out of the capitalist system in order to build a collectivist postcapitalism? To be dramatic, part of the political answer to the obscene leverage of class power and national power on the masses, is to generalize, which is to say democratize, the power to write (co-author) derivative contracts (co-author since in these protocols, all issuance is bilateral). It is time that the masses leveraged our claims, by creating our own economic networks with a new grammar and co-created, optional rules of play. This power, made possible by platforming protocols for cooperation around values creation, allows for an extended practice of community as well as the elaboration of what Randy Martin (2013a, 2015; Lee and Martin 2016) called \\\\\\\\u2018social derivatives.\\\\\\\\u2019 The social derivative is a cultural instrument that is wagered in social spaces already shot through with financial volatility. It allows marginalized groups, in Martin\\\\\\\\u2019s words, to \\\\\\\\u2018risk together to get more of what we want.\\\\\\\\u2019 It is in this way that the logic contained in _Protocols_, that allows for the mass authorship of social derivatives, may well succeed in democratization where the internet failed.\\\");\\n       units.push(\\\"While this power for anyone to write a derivative may sound esoteric (or even impossible and/or undesirable) \\\\\\\\u2013 and part of the book that follows this foreword _is_ somewhat esoteric \\\\\\\\u2013 a breaking down the barriers to the publishing of derivative instruments means that, in a world already rendered precarious by the history of racial capitalism, everyone (not just elites) may be better able to manage their undeniable risk by organizing their economy, cooperatively and collectively, and in terms of what is valuable to them. If neoliberalism taught us anything, it is that the way out of the problems of capitalism cannot, and will never, be through the creation of more capitalism. That is why we have reimagined the cryptotoken as a set of programmable capabilities (agreements) that may be enabled only when recognized and thereby validated by peers. Their semantic content represents a wager that the relationship, or agreement, they formalize expresses something of value (anything whatever) to both parties. Because each party or agent is enabled in the network through composing themselves \\\\\\\\u2013 by entering into a portfolio of such tokenized arrangements that are in principle limitless \\\\\\\\u2013 the wealth of each agent then becomes a composite of the qualified interests of others.\\\");\\n       units.push(\\\"THE REVALUATION OF VALUE\\\");\\n       units.push(\\\"A social derivative is a wager in the cultural sphere that responds to volatility in order that a local group can \\\\\\\\u2018risk together.\\\\\\\\u2019 _Protocols_ has tried to formalize a way to express those socio-economic wagers, such that others can validate or join them non-extractively by means of their own staking and/or performance. It becomes possible, at first in principle but later practically, to nominate and denominate values and then to collectively organize socio-economic outcomes of any type that preserve, foster and realize said values: differentiable, negotiable and socially agreed upon qualitative values. This is economic expressivity. When many actors are offering such semio-economic proposals and performances on a collectively-owned economic media platform, socio-economic actors such as ourselves may engage in a multidimensional system of valuation and production attuned to anything whatever: clean beaches, dance cultures, reforestation, spoken word, prison abolition, decolonial resurgence, blood free computing, and much more. When we have a way of sharing risk, both by sharing stake (staking a performance) and/or offering performance, in a variety of qualitative outcomes by means of a scalable peer-to-peer network, we get forms of distributed risk and reward that can create a distributed form of awareness \\\\\\\\u2013 a consciousness attuned to the specific interests of many others. This awareness results from, and constitutes, a new form of economic space and new form of economic agency: economic space agency. It will also transform subjectivity/objectivity and the membrane between self and other.\\\");\\n       units.push(\\\"Though this new economic language may sound like it requires a learning curve too steep for the \\\\\\\\u2018average\\\\\\\\u2019 person, the literacy and innovation will come, just as it did and does on paradigm shifting platforms such as Facebook, Instagram and TikTok. Here, the emerging paradigm comes with the social programmability inherent in expressivity directly linked to the programmability of economy. The postcapitalist economy will be about creating new forms of social relations; new relations of production that are qualitative and non-extractive. Collectively, we will script parameters that express our semantically based, qualitative values, and collectively we will manifest these values. We may hope, and perhaps expect, that within a few years or decades, folks will not be programming their fractal celebrity; they will be programming together the nuanced worlds they actually want to live in and creating the relationships they want to have there.\\\");\\n       units.push(\\\"There is much to learn, and much to be skeptical of. To answer the global challenges set forth by history will require the input and discernment of millions if not billions of people \\\\\\\\u2013 it is not a technocratic endeavor. Already there are millions among us who feel the need for alternative economic forms and for a type of radical economy and/or finance that answers onthe-ground problems of access to liquidity. The movement towards basic income is just one expression of this desire. In _Protocols_ what becomes possible is _basic equity_ founded upon ones\\\\\\\\u2019 social relations. Our requirement for emancipation is not further dispossession of others or ourselves but expanded access to the social product, particularly for those who do not have it. We agree with the growing mass need for our desires and our capacities to count and be counted in ways that remand the benefits to those who sustain the world and remake it everyday.\\\");\\n       units.push(\\\"It is not lost on us that, in the current economic calculus, a tree, an individual and even a people can be worth more dead than alive, more incarcerated or encamped then free \\\\\\\\u2013 and we hardly need to mention deforestation, police killings, settler colonialism and genocide to make the point here. But this book, though still incomplete in significant ways and offering more of a possible way forward than any as yet definitive answer, offers what approaches a concrete plan; one that may move readers from increased eco-social literacy to active participation in building an alternative economy. It would organize social participation that will create greater literacy and expressivity even as it endeavors to collectively create and thus instantiate, a new economic medium\\\\\\\\u2013an economic medium for the expression and collective management of a postcapitalist economy; a medium that is socially and ecologically responsive, which is to say, increasingly non-extractive because its interfaces are made to be just. The entire project stands or falls on this wager. However, that said, the book is but a seed, one that only collective uptake, and with it collective revision, can nurture and grow.\\\");\\n       units.push(\\\"Lastly, the desire for non-, ante-, anti- and/or post-capitalism is in no way an invention of this text; what feels new here is the method. I would say that it proposes a new way to mobilize what Harney and Moten (2013) call the general antagonism, and with it, a new form of revolution. What would it be? A _detournement_ of financial processes and tools, a slow takeover of the economic operating system occupying planet earth by those whose interests have been collapsed into bank interest. Indeed, it is the _incapacity_ to do just this granular and collective reformatting of the economy that has marked the failure of previous revolutions. Thus far, beyond the initial desperation, beauty and romanticism of revolutionary movements, we have mostly had various efforts at a seizing of the state that result in the reintroduction and replication of the gendered, racial and hierarchical logics of capitalism. From the Soviets, to the PRC, to scores of post-colonial states, we are familiar with the outcomes. The limitations were both of imagination and technology; movements weighed down by default notions of centralization and bureaucratic organization, notions that informed both emergent states and the discrete state computing that would develop to run them and all the others. This time, with another century of struggle and know-how, if we all listen to history and to the claims of the denizens of Earth, things may be different.\\\");\\n       units.push(\\\"The ECSA project opens a spread on racial capitalism and endeavors to use its historically consolidated capacities (_our_ capacities), including the power of financial instruments and computing, to wager on postcapitalist outcomes. Contrary to racial capitalism, the arbitrage on intelligence proposed here is to reduce the cost to the planet for collective re-imagination and re-organization, while also collectivizing the returns on the benefits of creating more convivial forms of life. We will reduce the price of survival, in terms of violence to others, in terms of the individual requirements for the value-form (money), and in absolute terms. Perhaps we will collectivize values creation and distribution/sharing to the point of overcoming the value form of capital itself. In any case, by utilizing the accumulated knowledge implicit in financial instruments and computing derived from, but not beholden to, capitalism, we will be creating a grammar for postcapitalist economic expression. The ECSA vision might just open an option on postcapitalist futures. This option would be one where we can risk together for non-capitalist outcomes, and do so from within capital. As Jodi Melamed (2015:82) says: \\\\\\\\nMarx finds value itself to be a pharmekon: it is a poison because it is a measure of how much human labor has been estranged and commodified by capital, yet it is also a medicine because it provides a way to grasp individual human efforts as alienated social forces, which revolutionary struggles can turn toward collective ends.\\\");\\n        //39\\n    }\\n    function set(uint256 location, string calldata _unit) external {\\n        units[location] = _unit;\\n    }\\n    function getById(uint256 location) external override returns (string memory unit) {\\n        return units[location];\\n    }\\n\\n}\"\r\n    }\r\n  },\r\n  \"settings\": {\r\n    \"optimizer\": {\r\n      \"enabled\": false,\r\n      \"runs\": 200\r\n    },\r\n    \"outputSelection\": {\r\n      \"*\": {\r\n        \"*\": [\r\n          \"evm.bytecode\",\r\n          \"evm.deployedBytecode\",\r\n          \"devdoc\",\r\n          \"userdoc\",\r\n          \"metadata\",\r\n          \"abi\"\r\n        ]\r\n      }\r\n    },\r\n    \"libraries\": {}\r\n  }\r\n}}", "ABI": "[{\"inputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"constructor\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"location\",\"type\":\"uint256\"}],\"name\":\"getById\",\"outputs\":[{\"internalType\":\"string\",\"name\":\"unit\",\"type\":\"string\"}],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"location\",\"type\":\"uint256\"},{\"internalType\":\"string\",\"name\":\"_unit\",\"type\":\"string\"}],\"name\":\"set\",\"outputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"\",\"type\":\"uint256\"}],\"name\":\"units\",\"outputs\":[{\"internalType\":\"string\",\"name\":\"\",\"type\":\"string\"}],\"stateMutability\":\"view\",\"type\":\"function\"}]", "ContractName": "UnitStorage2", "CompilerVersion": "v0.8.4+commit.c7e474f2", "OptimizationUsed": "0", "Runs": "200", "ConstructorArguments": "", "EVMVersion": "Default", "Library": "", "LicenseType": "", "Proxy": "0", "Implementation": "", "SwarmSource": ""}