{"SourceCode": "{{\r\n  \"language\": \"Solidity\",\r\n  \"sources\": {\r\n    \"contracts/storage/IStorage.sol\": {\r\n      \"content\": \"pragma solidity ^0.8.4;\\n// SPDX-License-Identifier: GPL-3.0-or-later\\n\\n// https://soliditytips.com/articles/solidity-interface-interact-with-other-contracts/\\ninterface IStorage {\\n    function getById(uint256 id) external returns (string memory unit);\\n    // Add more function signatures as needed.\\n}\"\r\n    },\r\n    \"contracts/storage/unit/UnitStorage1.sol\": {\r\n      \"content\": \"pragma solidity ^0.8.4;\\n// SPDX-License-Identifier: GPL-3.0-or-later\\nimport \\\"../IStorage.sol\\\";\\n\\ncontract UnitStorage1 is IStorage{\\n    // technical debt: \\n    // maybe this should be private\\n    string[] public units;\\n    \\n    // set to onlyOwner()\\n    // check if value exists - \\n    constructor(){\\n       units.push(\\\"\\\");\\n        // adding missing unit\\n        //1\\n        units.push(\\\"PROTOCOLS FOR POSTCAPITALIST EXPRESSION:\\\\\\\\nAGENCY, FINANCE AND SOCIALITY IN THE NEW ECONOMIC SPACE\\\");\\n        units.push(\\\"ACKNOWLEDGMENT\\\");\\n        units.push(\\\"This book is the product of joint research, discovery and iteration since we began the Economic Space Agency (ECSA) project in 2015. Its composing process has consisted of diverse intellectual inputs, revelations, impasses, often heated debate and constantly-evolving analysis. It is not easy to step into the new economic space, where we constantly find ourselves in uncertain terrain. We\\\\\\\\u2019ve found out it is possible only by experimenting and risking together.\\\");\\n        units.push(\\\"Many people and insights have been a part of this process; simply too many to mention here. The three of us who have authored this book see ourselves as bearers of the influences and express our deep appreciation of all engagement. There are some people who we wish to name whose intellectual input and cooperation has been vital and is directly recognizable in this book: Jonathan Beller, Fabian Bruder, Pekko Koskinen, Ben Lee, Joel Mason and Bob Meister. #livinginthespread #ECSAforever\\\");\\n        units.push(\\\"We thank Matt Slater for producing an audio version of two drafts of this manuscript, Pablo Somonte Ruano for designing the cover and the figures and Stevphen Shukaitis, editor of Minor Compositions, for boldly taking on our manuscript.\\\");\\n        units.push(\\\"We\\\\\\\\u2019d also like to thank our families and close friends for risking with us.\\\");\\n        units.push(\\\"ON ECONOMIC INTELLIGENCE\\\");\\n        units.push(\\\"_Protocols for Postcapitalist Expression_, written by ECSA (Economic Space Agency) thinkers Dick Bryan, Jorge L\\\\\\\\u00F3pez and Akseli Virtanen, marks an advance in the struggle for economic justice by directly addressing, and endeavoring to redress, the expropriation of the general intellect. The questions: Will the accumulated know-how of the species, alienated and, as Franco \\\\\\\\u2018Bifo\\\\\\\\u2019 Berardi (2012) put it, \\\\\\\\u2018looking for a body,\\\\\\\\u2019 lead to so-called humanity\\\\\\\\u2019s absolute demise (along with massive unrest and incalculable ecosystemic damage)? Or, is there emerging a path towards reparations, restoration, a just economy, and thus, a sustainable planetary society? It is as if the political slogan \\\\\\\\u2018No justice, no peace!\\\\\\\\u2019 now defines the spread of the possible futures for the global timeline.\\\");\\n        units.push(\\\"Significantly, _Protocols for Postcapitalist Expression_ does not give up on economic calculation or computing. It acknowledges that Economic Intelligence exists in historically sedimented economic categories and practices, but at the same time it recognizes that the form of knowledge that existing accounting creates simply cannot care about, and much less _for_, everyone. Composing a virtual computer, capitalist accounting processes allow for the judicious, that is profitable, apportioning of resources by producing a matrix of the fluctuating costs of production. Capital accumulation may be optimized by watching, in Hayek\\\\\\\\u2019s famous phrase, \\\\\\\\u2018the hands of a few dials.\\\\\\\\u2019 However, this calculus remains an imperial project beholden to the myriad violences of racial capitalism. In order to operationalize the world, the integration of money and computing reconstitutes the world as numbers, which is to say, as information. Arguably, we could even say, information is itself a derivative of the value-form.[1] We might be forgiven for asking: does the collapse of values to exchange value, and more generally of qualities to number and thus to information have any liberatory potential whatsoever?\\\\\\\\n\\\\\\\\n[1] Information has emerged dialectically as the most general form for the products of capitalism defined as having both use-value and exchange value. Because of its abstract character, it is often forgotten that information must have a material substrate, be it the standard commodity or an array of atoms on a computer chip. For the briefest of sketches, consider that the commodity was always composed of readable material differences, differences in matter created through labor. As a wager to get from M to M\\\\\\\\u2032, the commodity\\\\\\\\u2019s market legibility as a significant state of informed matter (a \\\\\\\\u2018hieroglyph\\\\\\\\u2019) has become increasingly computational. For my take on the networked commodity and the intimate connections between computing and capital see Beller (2017 and 2021). In each text I develop the argument that the general formula for capital can be rewritten M-I-M\\\\\\\\u2032, where M is money and I is information: Information replaces the commodity \\\\\\\\u2018C\\\\\\\\u2019 in Marx\\\\\\\\u2019s classic formulation M-C-M\\\\\\\\u2032.\\\");\\n        units.push(\\\"POSTCAPITALIST FUTURES\\\");\\n        units.push(\\\"Those who make it to the end of the TV series _Westworld_ (Season 4), may discover where all this derivation and calculation may now be leading. Computing represents an arbitrage on intelligence that ultimately cheapens and thus discounts life. The show\\\\\\\\u2019s verisimilitude, what we could think of as its late capitalist realism, serves as a kind of trailer for, or preamble to, what would appear \\\\\\\\u2013 _is appearing_ \\\\\\\\u2013 as a mutation in global consciousness and capacity, due to the financialization of knowledge. Because computing is inexorably entwined with existing markets and the statistical and predictive strategies necessary for the optimization of returns, computing, in the show at least, takes over species-being as it rapidly becomes the species-grave. The only \\\\\\\\u2018creature\\\\\\\\u2019 who will be left to remember whatever beauty, alternative values, grace and capacity for love that may have been expressed in the centuries of human emergence, is an AI.\\\");\\n        units.push(\\\"\\\\\\\\u2018One last dangerous game,\\\\\\\\u2019 says Dolores to herself in the emptied world at the smoking end of four seasons of _Westworld_ tragedies. What is that game? The series does not tell us, but the book before you might. Despite the real bleakness of the current world, we might propose, (and I think, must assume) that, here and now, some parts or fractions of \\\\\\\\u2018us\\\\\\\\u2019 have thus far survived the rapacious calculus of profit, and are actively seeking ways to do things otherwise. At the very least, we know that some \\\\\\\\u2018we\\\\\\\\u2019 or some parts of \\\\\\\\u2018us\\\\\\\\u2019 must now intervene if further catastrophes are to be prevented. Through the lens of economics and financial calculus, _Protocols for Postcapitalist Expression_ proposes a new form of economic intelligence and value-computing. The text proposes measures that do not collapse the qualitative concerns for well-being and being-with of those who currently are subjects of and subject to racial capitalism. ECSA has sought a way to allow for the expression and persistence of qualitative values on a computational substrate, an economic medium, such that these values are capable of (collectively) organizing economy. In theory, it becomes possible to avoid the collapse of people\\\\\\\\u2019s various pursuits into the value-form that is accumulated by capital and institutionalized through oppression, and to denominate quantities in terms of socially agreed upon qualities or qualifications, which is to say, values. Precluding the collapse of values by money and information opens a path to avoiding the collapse of space, time, and species existence by computational capitalism.\\\");\\n        units.push(\\\"This proposed re-organization of value production and thus also of sociality requires a re-casting of what we today think of as the real or natural economic forms indexed under notions including \\\\\\\\u2018equity,\\\\\\\\u2019 \\\\\\\\u2018credit\\\\\\\\u2019 and (productive) \\\\\\\\u2018labor.\\\\\\\\u2019 Analytically in _Protocols,_ these traditional terms have been decomposed, grasped as social arrangements and \\\\\\\\u2018network effects,\\\\\\\\u2019 and recomposed such that new conceptualizations and new types of actions and inflections - new socialities - become possible, while undervalued and marginalized traditional forms of sociality might thrive. Through this process of deconstruction and recomposition of actual and social computing, the text announces a possible socio-economic, computational strategy; a \\\\\\\\u2018play,\\\\\\\\u2019 for economics and for futurity, in what may well be the \\\\\\\\u2018one last dangerous game.\\\\\\\\u2019\\\");\\n        units.push(\\\"I say dangerous not only to refer to the current conditions on planet Earth, but because _Protocols_ does accept aspects of the power of the value form and of economic calculus to organize societies at scale. Even as it recognizes the necessity for constellations of qualified local inputs that can persist on an economic substrate, it accepts the need for large scale organization, economic interoperability and network-specific units of account. It actually proposes that \\\\\\\\u2018economy\\\\\\\\u2019 needs to become more granular and more generalized. What needs to be altered is _what_ the controls are, _who_ has access to them, and the kind of literacy and feedback they require. While _Protocols_ is a book of politico-economic analysis and insight, it should also be read as a script for the means to reappropriate the general intellect and thus use collective knowledge for the good of the social and ecological body. Surfaced from the unconscious operating systems of capital and reformatted, the protocols for constituting and holding equity become those for the distributed sharing of stake and thus for collectivizing risks and returns. The protocols for bank credit and monetary issuance become protocols for the peer-to-peer issuance of credit and for peer-to-peer credit clearing that is interoperable through a network of peers. The protocols for the organization of labor become protocols for the distributed assemblage of \\\\\\\\u2018performances.\\\\\\\\u2019 Units of account become qualified measures and indices, devoted to the emergence of interoperable qualitative values. Economy moves from stranger-based to interpersonal to collective; the imperial organization of commodities by the accumulation of capital becomes the collection organization of sociality by all.\\\");\\n        units.push(\\\"By shifting the architecture of economy and opening it as a design space, _Protocols_ would enable, in principle, everyone to engage newly with and access differently what is, in effect, the historical objectifications of \\\\\\\\u2018human\\\\\\\\u2019 thought and practice endemic to capitalist infrastructure. But we could do so at a lower cost \\\\\\\\u2013 to ourselves and to the lives of most of us! \\\\\\\\u2013 and thereby, slowly, reclaim the wealth of our species capacities. Modifying accounting methods can create possibilities for the shedding of inequalities sedimented into capital. Users of the protocols, finding economic alternatives in one another, may refuse value extraction, get more of what we value for less, and be able to do so without exploiting others or being exploited. Altering the computing that backgrounds our sociality, _Protocols_ would create zones of just and convivial social production (cooperatives, ephemeral and enduring) attuned to the values of like-minded co-creators cooperating in forms of mutual aid expressive of their shared values and concerns. The result of the use of qualitative values to account for and to organize economy at once produces and requires _a redesigned economic medium_, and _a new type of economic grammar_ which utilizes different rules of composition, expression and accountability.\\\");\\n        units.push(\\\"The text is the first complete edition of this new, if still rudimentary, economic grammar; it is a kind of manual for reprogramming the economic operating system. It is also a boot-strapping strategy to take back species abilities and creations that have been captured as assets (private property and monetary instruments). These assets include machinic fixed capital (platforms, code and clouds) as well as our own collateralized futures. The text, as an offer, is designed to open a spread between capitalist and postcapitalist futures. It would allow us to wager on the option that is justice (Meister).\\\");\\n        units.push(\\\"Whether as software, as clouds or as platforms, capital owns and rents back to us the accumulated products of human minds \\\\\\\\u2013 our know-how and knowledge. Resituating the abstractions of economic know-how, the ECSA Economic Space Protocol described by Bryan, Lopez and Virtanen, opens the possibility for creative capacities that are unalienated from their creators, that indeed produce a commonly-held set of capacities, a \\\\\\\\u2018synthetic commons,\\\\\\\\u2019 particularized and directed by the living concerns of those who create it. It holds out the possibility that we might cooperate in new ways and use our performative powers to wager and indeed _finance_ postcapitalist futures.\\\");\\n        units.push(\\\"Economic media, redesigned, opens a spread on the social contract \\\\\\\\nConsider \\\\\\\\u2018social media\\\\\\\\u2019 \\\\\\\\u2013 what can be clearly seen as a world-changing extractive technology grafted onto the sociality it at once enables and overdetermines. It is no secret that the mega-media platforms and their hardware make money while they make us sick. In this 21st century recasting and expropriation of the general intellect, now giving rise to financialized AI, social media platforms absorb communication and consciousness along with all of our struggles for meaning, pleasure, connection, fulfillment and liberation. Their interfaces, algorithms and data-bases convert our all-too-human aspirations into private property and thus into capital. Thus, the expression of our struggles for happiness, knowledge and communion with one another produce an alienated and therefore alienating wealth for others. All those desires for liberation end up producing their antithesis: capital. By turning our meanings into accumulated data that function for capital as contingent claims on value that we will produce in the future, the economic logic of social media turns any and all politics expressed by means of its platforms, including the politics of solidarity, love and living otherwise, into a practical politics of hierarchy and capitalist extraction. By converting all of our semiotic signals into financialized information, and thus into profits, \\\\\\\\u2018social\\\\\\\\u2019 media stripmines our libido, our consciousness, our imagination. In doing so, all the points of meaning and affect distributed across the socius and absorbed in one way or another by computing can thereby be grasped for performing social and organizational functions in a matrix of financialized information. This information in its architecture and management \\\\\\\\u2013 _its organizational protocols_ \\\\\\\\u2013 transfers value up the stack, only to devalue the increasingly abject denizens of planet Earth. In the current world operating system, for which social media forms only one, albeit _paradigmatic_, layer of calculation, the meanings we create and the emotions we experience, however real and \\\\\\\\u2018immediate\\\\\\\\u2019 they may be, are interfaces with computing; they are productive interfaces with racial capitalism. As we perform, in the very expression of our quests for life, what elsewhere I have called \\\\\\\\u2018informatic labor,\\\\\\\\u2019 we experience first hand the alienation of our performative powers in the actually existing economic media of racial capitalism, that is, computational racial capitalism.\\\");\\n        units.push(\\\"It is in this context of the latest stage of capitalism that something really interesting can finally be said about the rise of blockchain and cryptocurrency. This cryptographic medium, which has the network architecture of a messaging system, is a medium in the strong sense, akin, as I have elsewhere remarked, to photography in the mid-1800s or cinema in the early 1900s. Without turning any of the apparent key players here \\\\\\\\u2013 the Satoshis and Vitaliks \\\\\\\\u2013 into heroes, we might see in the \\\\\\\\u2018mankind sets forth only such problems as he can solve [sic.]\\\\\\\\u2019 scenario of history, a significant emergence in response to a collective demand. This emergence answers the call for a new form of _economic media_ in order to express an alternate vision of the world. That expression, at first apparently as a monetary medium, begins to overturn the seemingly stable notions of asset, money, credit, labor, capital, derivative and many other \\\\\\\\u2018known\\\\\\\\u2019 financial entities implicit in, and indeed part of, the protocols of existing monetary media. The alternative vision is a programmable substrate that opens computational media to the possibility of a (re-)programming of the economic layer of computing by non-state and non-corporate actors. If we want to put a point on it, the great disruption underfoot is that _economy becomes programmable from below_. That, in itself, is a change in the semantics, as well as the capacities, of economy. When we recognize that our communications media are overdetermined in their function by existing monetary media, to the extent that they serve as an extension of its profit seeking logics, we begin to see that our communications media are already economic media, even though their capabilities seemed to have developed in separate and even autonomous domains.\\\");\\n        units.push(\\\"The internet promised to democratize expression by enabling publishing and indeed broadcasting from below; but nothing about the internet changed the basic economic architecture of capitalist extraction. Indeed, in decentralizing communications, the internet extended and granularized the centralizing logics and logistics of capitalism, pushing them deeper into expressivity, thought and affect. It captures mass expressivity and converts it into capital. This colonization of the imaginary and symbolic registers results in a financialized cybernetics of mind. For democratization to happen in a meaningful way, the systems of accounts inherent in many-to-many distributed media, be they networked monetary systems (USD) or communications (Facebook), must become programmable from below. For this to happen, platforms and computing must be made programmable from below. The cybernetics of economic media must be deleveraged from capital accumulation. This transformation, and how it may be achieved, is indicated in _Protocols_.\\\");\\n        //20\\n    }\\n    function set(uint256 location, string calldata _unit) external {\\n        units[location] = _unit;\\n    }\\n    function getById(uint256 location) external override returns (string memory unit) {\\n        return units[location];\\n    }\\n}\"\r\n    }\r\n  },\r\n  \"settings\": {\r\n    \"optimizer\": {\r\n      \"enabled\": false,\r\n      \"runs\": 200\r\n    },\r\n    \"outputSelection\": {\r\n      \"*\": {\r\n        \"*\": [\r\n          \"evm.bytecode\",\r\n          \"evm.deployedBytecode\",\r\n          \"devdoc\",\r\n          \"userdoc\",\r\n          \"metadata\",\r\n          \"abi\"\r\n        ]\r\n      }\r\n    },\r\n    \"libraries\": {}\r\n  }\r\n}}", "ABI": "[{\"inputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"constructor\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"location\",\"type\":\"uint256\"}],\"name\":\"getById\",\"outputs\":[{\"internalType\":\"string\",\"name\":\"unit\",\"type\":\"string\"}],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"location\",\"type\":\"uint256\"},{\"internalType\":\"string\",\"name\":\"_unit\",\"type\":\"string\"}],\"name\":\"set\",\"outputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"\",\"type\":\"uint256\"}],\"name\":\"units\",\"outputs\":[{\"internalType\":\"string\",\"name\":\"\",\"type\":\"string\"}],\"stateMutability\":\"view\",\"type\":\"function\"}]", "ContractName": "UnitStorage1", "CompilerVersion": "v0.8.4+commit.c7e474f2", "OptimizationUsed": "0", "Runs": "200", "ConstructorArguments": "", "EVMVersion": "Default", "Library": "", "LicenseType": "", "Proxy": "0", "Implementation": "", "SwarmSource": ""}