// SPDX-License-Identifier: MIT

pragma solidity ^0.8.0;

/// @title: FunDONUTS
/// @author: manifold.xyz

import "./manifold/ERC1155Creator.sol";

////////////////////////////////////////////////////
//                                                //
//                                                //
//    -䨻䨻䨻䨻一䨻䨻䨻䨻-:䨻䨻:-䨻䨻一一䨻䨻-:䨻䨻䨻䨻䨻一-:一䨻䨻䨻䨻一--    //
//    -䨻䨻一䨻䨻䨻一䨻䨻-:䨻䨻:-䨻䨻一一䨻䨻-:䨻䨻一一䨻䨻-:䨻䨻一一䨻䨻--    //
//    -䨻䨻一䨻䨻䨻一䨻䨻-:䨻䨻:-䨻䨻一一䨻䨻-:䨻䨻一一䨻䨻-:䨻䨻一一䨻䨻--    //
//    -䨻䨻一一䨻一一䨻䨻-:䨻䨻:-䨻䨻一一䨻䨻-:䨻䨻一䨻䨻一-:䨻䨻䨻䨻䨻䨻--    //
//    -䨻䨻一一一一一䨻䨻-:䨻䨻:-一䨻䨻䨻䨻一-:䨻䨻一一䨻䨻-:䨻䨻一一䨻䨻--    //
//                                                //
//    -䨻䨻䨻䨻䨻-一一䨻䨻䨻䨻一-䨻䨻一一一䨻-䨻䨻一一䨻䨻-䨻䨻䨻䨻䨻䨻--       //
//    -䨻䨻一一䨻䨻-䨻䨻一一䨻䨻-䨻一䨻一一䨻-䨻䨻一一䨻䨻-䨻䨻䨻䨻䨻䨻--       //
//    -䨻䨻一一䨻䨻-䨻䨻一一䨻䨻-䨻一䨻䨻一䨻-䨻䨻一一䨻䨻-一一䨻䨻一一--       //
//    -䨻䨻一一䨻䨻-䨻䨻一一䨻䨻-䨻一䨻䨻一䨻-䨻䨻一一䨻䨻-一一䨻䨻一一--       //
//    -䨻䨻一一䨻䨻-䨻䨻一一䨻䨻-䨻一一䨻一䨻-䨻䨻一一䨻䨻-一一䨻䨻一一--       //
//    -䨻䨻䨻䨻䨻-一一䨻䨻䨻䨻-一䨻一一一䨻䨻-一䨻䨻䨻䨻一-一一䨻䨻一一--       //
//                                                //
//                                                //
////////////////////////////////////////////////////


contract FDNT is ERC1155Creator {
    constructor() ERC1155Creator("FunDONUTS", "FDNT") {}
}