// SPDX-License-Identifier: MIT

pragma solidity ^0.8.0;

/// @title: STATUE OF FANTASY
/// @author: manifold.xyz

import "./manifold/ERC1155Creator.sol";

////////////////////////////////////////////////////////////////////////////////////////////////
//                                                                                            //
//                                                                                            //
//                                                                                            //
//        ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄    //
//        ΄΄΄΄΄΄΄΄΄΄΄·΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄    //
//        ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄    //
//        ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄    //
//        ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄    //
//        ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄;;μμ΄;;;;;΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄    //
//        ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄;μκΦΪΪϊΪΪΪΪΪΪΪ;ΪϊψΪΪΪΆΜωβψκμ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄    //
//        ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄μΦΪΓζΪΪΝωκκκΜΜκκμ;;ωυζ·ΨΫΓ΄ΪΣΪΨψΪβωμ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄    //
//        ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄;ΦψΝΫΐ΅΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΅ΡΝω΄΄΄΄΅ζΫΨψΦΦΪψώΦμ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄    //
//        ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄φΡ΅΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΅Ψω΄΄ζΪΪβΫψΪψ΄΄;;΄΄΄΄΄΄΄΄΄΄΄΄΄΄    //
//        ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄;μμ΄΄΄΄΄΄΄΄΄΄΄΄΄΅ΜμνΫψΪίξΪψΫΨΦΦμω΄΄΄΄΄΄΄΄΄΄΄    //
//        ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄χβββββμ·΄΄΄΄΄΄΄΄΄΄΄΄΄ψίΫψξΝψΫΦΨΫΪΪΦΦμ΄΄΄΄΄΄΄΄΄    //
//        ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄βββββββββμ΄΄΄΄΄΄΄΄΄΄΄΄΄ΪψρψΫΝζψμξΨΝΖΚ΄΄΄΄΄΄΄΄΄΄    //
//        ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄ββΒβββββββββ΄΄΄΄΄΄΄΄΄΄΄΄΄Ϊβώλ΄ΫΝΫψ΅νζ΄΄΄΄΄΄΄΄΄΄΄    //
//        ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄;βββΝβββΪΫΦΪΦμ΄΄΄΄΄΄΄΄΄΄΄΄΄ΪΛψμ;ίίψΫΦβ΄΄΄΄΄΄΄΄΄΄΄    //
//        ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄ΦΦββββψέΒβΪββΚ΄΄΄΄΄΄΄΄΄΄΄΄΄΄βψάιββχΪΫΪΆ΄΄΄΄΄΄΄΄΄΄    //
//        ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄;βββΝβέΫΓΨΦβββΦμ΄΄΄΄΄΄΄΄΄΄;ΚχΪΓχΦββ΅ΐψΪφ΄΄΄΄΄΄΄΄΄΄    //
//        ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄χΦβΦΦφββΪΓχΦψΦΪίΦμ΄΄΄΄΄΄΄΄΄΅βΓΣΪΦΦΪ΄΄΄βΝ΅΄΄΄΄΄΄΄΄΄΄    //
//        ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄χβΦΜΪβΦΦββΦββββββψρΪΜΝΝμ΄΄΄΄΄΄΄΄ΫψχΓγΦ΄΄Ρ΅΄΄΄΄΄΄΄΄΄΄΄΄    //
//        ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄ωωωβΦΦΦΫΫφΫξΦββββΦΦβΓΐΐΫΪΦΪΆΦψ΄΄΄΄΄΄΄΄ΪψΰζΚ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄    //
//        ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄;Ξ·΅;μρΦβθζ;ΣέΎΪΪββββββΦΓιΫζΦβΦΦφβΪΦζ·ν΄΄΄΄ρΌ΅ΪΡ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄    //
//        ΄΄΄΄΄΄΄΄΄΄΄΄΄;;;΄μ;ββΦβΪΦβΓ;΅έ΄ξφβββββΪμφβ΄΄΄ΪΪψΎ΄ΫψΦββψΦ΄΄΄΅ψΪΪ΄΄΄·΄΄΄΄΄΄΄΄΄΄΄΄    //
//        ΄΄΄΄΄΄΄΄΄΄;φΪΝΜψΫβΦβΦΦΪΦΦβΡ΅ρ΄φΪββΦββχβββ΄·;φζΓΫΦρβψΦΦΦΦμβ΄΄΄ΪξΪ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄    //
//        ΄΄΄΄΄΄΄΄χβΧ΅΄΄΄΄ΐΜΦΦΝΜΦψβΪ΄΄΄ψΫΦΦΝββββββ΄;ΦΓ΄΅ΪχΫ΅΅ΝΦβΦΦΫβΝββΪψψβ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄    //
//        ΄΄΄΄΄΄;ΡφΪβ΄΄΄΄φββγΦΦψΫΦΫΦΈΓ;ΡβΪΦβΦΦβββψΖβχΑΡΫΪ·΄΄΄βΪΫΦΦψΪΦββμΦΪΐψ΅΅Ψμ΄΄΄΄΄΄΄΄΄΄    //
//        ΄΄΄΄΄φ΅΄΄ΪΨβμίΓ;βψΪθΦΝΦΪψΦβΫβΓΫψψββΆββΫϋ·΅ψ΄;΄΄·΄;φβΦββΦΫΪΦββΜβΦψΪΡ΄χΡ΄·΄΄΄΄΄΄΄΄    //
//        ΄΄΄΄΄΄Ύ΄΄χφΦΓχΝββββΡχβχΦψΡ;ϊωΓ΄ΪβΦβΝΦΜΡ΅κΐ΄ε΄΄΄΄ΦβΪφβΪώζΫβφψβββββΓψ΅΄΄΄΄΄΄΄΄΄΄΄΄    //
//        ΄΄΄΄΄΄;ΓχβΦχφβΪΫΦΦββψβλωψΝΜΪΓ΄΄ΰΦβΦ΅΄΄·΄΄΅μΓ΄΄·΄ΐΪψΪΦΆΦΫΪΦΦΌβββΪψββΝμ΄΄΄΄΄΄΄΄΄΄΄    //
//        ΄΄΄΄;βΦΪζΪΫΪΦΐ;ρΦΆΪΫΦΈΫβΖΖ΅΄΅;φΝβΪΪΓ΅΄·΅΅·ς΄΄·΄΄΄΅ψβψβΪΓΪΪχψβββΪΦΦββΦ΄΄΄΄΄΄΄΄΄΄΄    //
//        ΄΄΄χβΫφξξψΦΪβφβψψψΝΜΪ΄όΦώΓ΄φΦΦΦΦΦΐω΅΄΄··΄΄΄΄΄΄΄΄΄΄ΦήβΪΨβΝΪβΦβββΪΦψζΪΦΚ΄΄΄΄΄΄΄΄΄΄    //
//        μ΄ρΌβΤΜ΄φΦχΦΡ·΄·΄΅΄΄΄΄΅φΨΎζ·ζβΪψΓΓ΄έ΄΄΄΄΄΄΄΄΄΄·;΄Ιώ΅ΓΫψχχγββββββΪΦΪΰΤΰβΝ΄΄΄΄΄΄΄΄    //
//        ΄ΪωέββμΓΪβΦθΓ΄΄΄΄·΅έ΅χΡ΄΄;΄λ΄΄΅΄΄΄Ϊ·΄΄΄΄΄΅;΅;φΓ΄φψ΅΄·΅ΪβΫΦΦββΦΦββΜξ΄ωχ΅β΅΄΄΄΄΄΄΄    //
//        ΄χψβΝβψΝΪΨΦξβφ΄΄΄΄΄΄Φ΅΄΅΄΄΄΄΄΄΄΄΄·;Γχς·ΐαχχπψΆξΫ΅΄΄΅΄΄ΦΦβΦψβΦβΫΪΦΦφψβΆ΅΄΄΄΄΄΄΄΄΄    //
//        ββΪΦββΦΦψΦψζβΝψψχ΄κ΄ΫΓ΄·΅΄΄΄΄΅··΅ς·΄ΪΦβφΦΪφψψψμ·΄·΄·΄ΪβββΦΦΦΦΦΦβΦΪφβ΄΄΄΄΄΄΄΄΄΄΄΄    //
//        ββΫφββΝΦΪΪΜψχΦΦΪΦ΅΄΄΅΄Γ΄΄΄·΄΄΄··΄΄΄΄φΫΪψΡΪβψΦΦΦΦψψψψψΦββψΦβψΪΝψΝΦβΦβω;;;΄΄΄΄΄΄΄΄    //
//        ΪΆΦβΒΦΫ΅;ρψ;ΨπψΦΆΝμ·΄΄΅΄ί΄΄΄΄΄΄···΄;φώχΦΦΪΜΪχΪξΪΪΪΫβββΦββββΦψΜΫβύβΪΪΦχμ΄ψ΄΄΄΄΄΄΄    //
//        ΫζΪβββΓώχάξξχψψψβωΡ;΄΄γι·ιΓ΄·΄;ξΪβχφβΦφΦΦβΦΦΦββΦβφββίψβΫζΪΪΪώχΪΪΦΫξΪΆΫΦ΄ΚΪμ΄΄΄΄΄    //
//        ψψψΪΦβΪΫψΓψΡ΄··΄΄΅΄΄ωψββΜι;Ύ;χφΨΫΦΦψΐΪΪΰΣψψΦβββΪΫΪφβββφΪώ·΅ΪΪΦΦψΦΫ΄Τ;ΓΤΦφρ΅΄΄΄΄΄    //
//        βΪΫΒΝΐζΓΓΦΦ΄΄΄΄΄εβξΦΦΪΦ΄΄άΪβΦΦΆξζ΅ψζΓφββββψβββϊβΦβΡΐ΄Φψ΄Ζ΅;ΓχβΪΓλχψΜξώΪΡΪμ΄΄΄΄΄΄    //
//        ΄΄;χωώωΐφΦβΦΚωΪγωΫξΨΰφιΪΫΫΫΫΦμ;χχψΦΫΦΆΪΪΫΪΒββββΓβμχφβΦΪΪ΅;ΓΙφΰ΄χψΦΪφΡ΅ΐ΅΄΄γ΄΄΄΄΄    //
//        φΪΪΫι·ϊΪφΦψΦώΖ;Γ΅·΅΄΄·΅΄΅·΄ΫΪΨΦψΦψΪψΝ΅΅΅΅ΪΦΪΦΦβΓΦΦΐζξψψΪρΪ;βλζχΪΪΫβμ΄΄΄΄΄΄Ϊ΄΄΄΄΄    //
//        ββββζ΅;΄ΫΫΦΫβώ΄΅΄΄΄΄΄΄΄΄΄΄΄·ιΐΓ΄΄ψΊΓ΄΅΄;;χφβΦΝΐϊβψμχΫξΓχχψφΦΫΫ΅ΫφΦββ΄΄΄΄΄΄Α΄΄΄΄΄    //
//        βΚββ;;΅χφΝΪΫΪ΄;΄;΄΄΄΄΄΄΄΄΄΄΄΄΄Γ΄΄ώΪς΄·ΊμΪΦβΫΪξ;ΦώΫΪΦζΪβΝΦβφξώίψέχβββΡ΅΄΄΅΄΄΄΄΄΄΄    //
//        ββΦΪΫψθζ΄;΅΄Γ΄΄ι΄΄΄΄΄΄΅΅΄΄΄;·΄ί·΄Ϋ΄ιΖζς΄ψΦΜΫΦΦβψφββγΆβΦΝ΄΄ΪΨΝΜΝμΦ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄    //
//        ΦΫΪΓυβΓΓ΄΅΄΄Γ·΄΄΄΄΄΄΄΄΄·΄χ΅΄΄΄΄΄΄΄΄·΄·Ϊ΄ίβΦΦΦββββββ΅΄΄΄΅ΦβψβχμγΦ΅΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄    //
//        ΄·Γ·Φξ΄΄·΄ι΄΄΄΄·΄΄΄΄΄΄΄΄ψξ΅΄΅·΅΄΄΄έ΄΄ΓφΤβΦβΪβΦβΫΓ΄΄΄΄΄΄΄΄΄΅΅΅΅΅΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄    //
//        χΓ΅χδΪΓ΄΄·΄ι΄΄΄ι΄΄΄΄΄΄ώ΅·΅·΄ξφζ·΄΄;ρχΆχΪΨψΪΰΦήΦβμ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄    //
//        ΄΄΄Τ΄·΄΄΄΄΄ι΄·΄΄΄΄΄;Τ΅;΄·χψψχΜΦΫΫΫΦΨΦΪΫΪζΦΦδζΌβ΅μχ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄    //
//        ΄΄΄΄΄Γε΄·΄΄΄΄ς΄··΅΅΄·ΪψφξχψβΪΪψψχψψφβψΪβψΪχβΝΓ΄΄φΑ΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄    //
//        ΅γχ;ώφχρι··΄΄΅·΄΄΄χββΦββββΪΪΪΪΪΪψβββΝββψμ΄΄΄΄χΡ΅΅΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄    //
//        Φψφβ΅Ϊ΅;χι΄΄΄΄΄΄΄΄ΪβΝβΝβΦψΦΦψφβΦΝΦββΝ΅΄΄΄΅΅Ϋΐ΅΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄΄    //
//                                                                                            //
//    ---                                                                                     //
//    WELCOME TO MY IMAGINATION                                                               //
//    IANNOCENT                                                                               //
//                                                                                            //
//                                                                                            //
//                                                                                            //
////////////////////////////////////////////////////////////////////////////////////////////////


contract SOF is ERC1155Creator {
    constructor() ERC1155Creator("STATUE OF FANTASY", "SOF") {}
}