// SPDX-License-Identifier: MIT

pragma solidity ^0.8.0;

/// @title: 𝕊𝕟𝕠𝕨𝕪 ℝ𝕒𝕓𝕓𝕚𝕥_sᴘᴇᴄɪᴀʟ ɢɪғᴛ
/// @author: manifold.xyz

import "./manifold/ERC1155Creator.sol";

////////////////////////////////////////////////
//                                            //
//                                            //
//    𝕊𝕟𝕠𝕨𝕪 ℝ𝕒𝕓𝕓𝕚𝕥_sᴘᴇᴄɪᴀʟ ɢɪғᴛ     //
//                                            //
//                                            //
////////////////////////////////////////////////


contract SRG is ERC1155Creator {
    constructor() ERC1155Creator(unicode"𝕊𝕟𝕠𝕨𝕪 ℝ𝕒𝕓𝕓𝕚𝕥_sᴘᴇᴄɪᴀʟ ɢɪғᴛ", "SRG") {}
}