{"SourceCode": "{{\r\n  \"language\": \"Solidity\",\r\n  \"sources\": {\r\n    \"contracts/storage/IStorage.sol\": {\r\n      \"content\": \"pragma solidity ^0.8.4;\\n// SPDX-License-Identifier: GPL-3.0-or-later\\n\\n// https://soliditytips.com/articles/solidity-interface-interact-with-other-contracts/\\ninterface IStorage {\\n    function getById(uint256 id) external returns (string memory unit);\\n    // Add more function signatures as needed.\\n}\"\r\n    },\r\n    \"contracts/storage/unit/UnitStorage4.sol\": {\r\n      \"content\": \"     \\npragma solidity ^0.8.4;\\n// SPDX-License-Identifier: GPL-3.0-or-later\\nimport \\\"../IStorage.sol\\\";\\n\\ncontract UnitStorage4 is IStorage{\\n    string[] public units;\\n    \\n    // set to onlyOwner()\\n    // check if value exists - \\n    constructor(){\\n        //59\\n       units.push(\\\"Beneath these ideologically-defined polemics, \\\\\\\\u2018crypto\\\\\\\\u2019 simply offers various versions of a technology of communication and exchange: the possibility of coordinating chains of interactions without a central 3rd party authority. And basically that\\\\\\\\u2019s all it can do. Economic protocol design must be much more, but critically built on that game-changing technology. So our project is to push past this ideological polemic and immediately frame crypto technological innovation as a site of social contestation about the sorts of social interactions we are seeking to facilitate, built on top of a technology of communication and exchange.\\\");\\n       units.push(\\\"Our project is to design a network where participants: \\\\\\\\n- _interact_ in the creation of new outputs (not simply gamble on price movements); \\\\\\\\n- _communicate_ in the determination of what is deemed value-creating (not driven by private appropriation of profit); \\\\\\\\n- _coordinate_ the assemblage of production (not corporate); \\\\\\\\n- _bind_ in the building of a commons (not individualistic); and \\\\\\\\n- _launch_ the capacity to scale and reproduce in sustainable ways (not reliant on on-going injections of external funding).\\\");\\n       units.push(\\\"We cannot, and should not, pre-determine the outputs that people produce, nor what constitutes value or the content of the commons. The people who have participated in building the Economic Space Protocol outlined in this document all have views about what sorts of outcomes we would personally like to see, but it is critical that these are not predetermined in protocol design, that distributed network interactions and not a central authority coordinates network development. That\\\\\\\\u2019s why we frame our work as a political project as well as a project of network design.\\\");\\n       units.push(\\\"WHAT DOES THE FUTURE HOLD?\\\");\\n       units.push(\\\"Blockchain-based innovations for economic and financial design are evolving rapidly. Most recently, DAOs, DeFi, stablecoins, DEXs, liquidity farming, NTF markets and creator and community tokens offer expansive new possibilities. But what will be the next frontier; the next big development?\\\");\\n       units.push(\\\"What does history suggest?\\\");\\n       units.push(\\\"By today\\\\\\\\u2019s standards, history moved in slow motion. It records that money, roughly as we now know it, dates from about the 7th century BCE. Recognizably modern banking developed in the Northern Italian coastal cities of Florence, Venice and Genoa in the 14th century, driven by the funding requirements of long-distance trade. This banking evolved over the next few centuries from funding commerce to funding the rise of industrial production, and a system we call capitalism. The formation of joint stock companies and a liquid stock exchange in the mid 19th century transformed ownership of capital to decentralized protocols, though the division between ownership and management served to re-centralize the control. This is the corporate capitalism we know today.\\\");\\n       units.push(\\\"In cryptohistory, that long evolution looks like it is happening over little more than a decade. Bitcoin as a new, distinctive p2p form of money arrived in 2009, with DeFi (decentralized finance, or banking protocols) becoming prevalent a decade later; funding new kinds of distributed exchange and money games. Governance mechanisms of DAOs and in-house treasury functions, broadly replicating the roles of the corporate form, followed immediately afterwards. History would say that these developments must surely evolve to the funding of a new era of production as its next logical step. But that next step is yet to emerge, and its possible shape is still unclear.\\\");\\n       units.push(\\\"It is already clear this future will be \\\\\\\\u2018post-industrial,\\\\\\\\u2019 with information at the center, as both its predominant input and output. But what will be its social shape; what technical capacities and social relations will it build upon? There are two complementary, contemporary developments that are critical: distributed money and the iteration of the internet that brings decentralization back into its heart; also known as Web3 or the Economic Web.\\\");\\n       units.push(\\\"First, distributed money. The development of blockchain technology opened the possibility of re-thinking money: what it is, who issues it and who controls its value. Bitcoin initiated a new form of money, but it remains centrally issued and controlled by the global virtual agent that maintains the ledger in singular blockchain. Network protocol design creates the possibility for a _distributed_ money system where there is no central money issuer. All agents can be issuers, while network-recognized collateral for such lending means the money system can nonetheless remain stable. These are already the foundations of current shadow banking. Such a money system is elaborated below.\\\");\\n       units.push(\\\"Distributed \\\\\\\\u2018money\\\\\\\\u2019 can then be put at the service of pursuing postcapitalist economic values (modes of calculating), effectively superseding the profit-based calculus that is embedded in the price of and access to conventional money. In relation to capitalism, we can now have a parallel (but interacting) money system, associated with a parallel (but interacting) value system.\\\");\\n       units.push(\\\"Second, Web3. We have designed an economy that draws on the data and network capacities that were driving the initial development of the internet more than forty years ago: _an internet native economic system._ We have built on the vision of Web3 and the re-imagined potential in the internet: its capacity for trust and verifiability, for scalability and decentralized relations, with users owning and in charge of their own data. The potential of Web3 opens a new economic imaginary, where peer-to-peer economic networking protocols can create performances and outputs out of information creation and exchange, distributed computation, connectivity and network relationships. Codified incentives and enforcement can motivate new economic relations, with informational value transmitted as tokens. There is a lot to absorb in these last sentences, and the process tagged here will be elaborated in the chapters below.\\\");\\n       units.push(\\\"We see Web3 engaging the native potential of the internet, challenging and going beyond the power of the current major internet players (tech companies, financial institutions and other collectors and users of consumer data) who have channeled, and even prevented, the realization of this potential by means of copyright, paywalls, advertising, data extraction, etc. so that internet expansion remains consistent with tech company profitability.[4] A blockchain-based distributed money doesn\\\\\\\\u2019t need to \\\\\\\\u2018take on\\\\\\\\u2019 these corporate giants; it is sufficient simply to sidestep them.\\\\\\\\n\\\\\\\\n[4] Many people now make this argument. See, for example, Dixon (2018) and Buterin (2017)\\\");\\n       units.push(\\\"Web3 offers the potential for what we call \\\\\\\\u2018economic media\\\\\\\\u2019 for expressing economic-organizational relationships and networks. The capacities of distributed economic communication have yet to emerge. Bitcoin, for all its innovation, preserves fiat money\\\\\\\\u2019s monologic monetary value (\\\\\\\\u2018price\\\\\\\\u2019), not the broad sweep of social meaning that can attach to exchange.[5] Other crypto designs (such as Ethereum) have attempted through smart contracts to make this expression on the blockchain more robust by creating programmable money, but the full development of a cohesive and expressive, decentralized medium of value networks has not yet been achieved. We are building on this aspiration.\\\\\\\\n\\\\\\\\n[5] From our perspective, bitcoin identified the trusted intermediary component of capitalism. That is, capitalism\\\\\\\\u2019s regime of verification depends on trust which, in its turn, ultimately depends on states\\\\\\\\u2019 monopoly on violence and coercion. Bitcoin expressed that there can be more dimensions of freedom. It opened the question of the sociality of value: it showed that value is always social, organizational and institutional. But bitcoin didn\\\\\\\\u2019t give a language to express it. The Economic Space Protocol is a grammar for expressing the sociality of value.\\\");\\n       units.push(\\\"When we turn to finance, we see the same processes that were just depicted in relation to the internet. Credit, which is essentially a system of IOUs, requires systemic trust, scale and collateral. The current world of institutional banking and finance performs these and other functions in a way that extracts wealth from, and imposes surveillance on, those who borrow and lend. Decentralized Finance (DeFi), like Web3, is offering the alternative to this corporate control by developing decentralized credit issuance and other financial products of risk management. But can DeFi develop the extra stage and link to the funding of investment in new systems of production? We believe that this requires an analytical leap: to think of stake (ownership of investment) as the preferred collateral for reciprocal issuance of credit.[6] It will give credit a material and expandable foundation. Financing investment in new forms of production (performances) will itself open up new possibilities for DeFi that link to the \\\\\\\\u2018real\\\\\\\\u2019 economy.\\\\\\\\n\\\\\\\\n[6] The trend to use equities as collateral for loans is increasingly prevalent. In 2017 the US Securities and Exchange Commission reconsidered the rules which prevented institutional market participants from pledging and accepting equity as collateral in the US securities lending market. In March 2020 the US Federal reserve, looking to rebuild liquidity in the Covid pandemic, enabled banks to borrow cash against stocks and corporate bonds.\\\");\\n       units.push(\\\"For us, the goal of realizing the potential of Web3 for economic design, extending DeFi into investing and staking, and building an economic space of many collective values are all parts of the same vision. These connections are our depiction of collaborative finance (CoFi),[7] and the proposition that it is through finance that a network most actively coheres. But, in connection to our starting question of what the future holds, we need a clear stepping off point. In capitalism, it is the state that economically ties the present to the future[8]. It issues treasury bonds and oversees the yield curve, it sets the base interest rates from which commercial rates follow and it manipulates exchange rates, etc.. But in a new economy, it can be the protocol designs of distributed finance that economically links the present to the future.[9] So it is critical that the interaction of credit, investment and exchange \\\\\\\\u2013 all dimensions of CoFi \\\\\\\\u2013 are integral to protocol design.\\\\\\\\n\\\\\\\\n[7] This term has been used in the \\\\\\\\u2018sharing economy\\\\\\\\u2019 literature for quite a few years. We use it here in a specifically blockchain-enabled way, as initially proposed by a local currency research team at _Informal Systems_. See, for example, https://cofi.informal.systems. See also Fleischman, et al (2020).\\\\\\\\n [8] Antonio Negri (1968) was astute when, in 1968, he observed that connecting the present to the future in a capitalist economy is the responsibility of the state. In the absence of this state role, we see the need to make the link financially will potentially be made by futures and option contracts.\\\\\\\\n [9] The argument here is crystalised in Chapter 8.5.\\\");\\n       units.push(\\\"The subsequent chapters of this analysis work systematically through these issues, moving from the creation of new products (Chapter 4) to staking their creation and distributing their outputs (Chapter 5), to a system of credit that keeps the system of performances and distribution flowing (liquid) (Chapter 8).\\\");\\n       units.push(\\\"A NEW ECONOMIC SPACE; NEW ECONOMIC PERFORMANCES\\\");\\n       units.push(\\\"To conceive of a viable postcapitalism that gives focus to collective, shared futures, we start from the proposition that the economy is a network: a group of agents interacting under certain agreements, (i.e. protocols) which define the relations that form the network, and how its state may change.\\\");\\n        //77\\n    }\\n    function set(uint256 location, string calldata _unit) external {\\n        units[location] = _unit;\\n    }\\n    function getById(uint256 location) external override returns (string memory unit) {\\n        return units[location];\\n    }\\n\\n}\"\r\n    }\r\n  },\r\n  \"settings\": {\r\n    \"optimizer\": {\r\n      \"enabled\": false,\r\n      \"runs\": 200\r\n    },\r\n    \"outputSelection\": {\r\n      \"*\": {\r\n        \"*\": [\r\n          \"evm.bytecode\",\r\n          \"evm.deployedBytecode\",\r\n          \"devdoc\",\r\n          \"userdoc\",\r\n          \"metadata\",\r\n          \"abi\"\r\n        ]\r\n      }\r\n    },\r\n    \"libraries\": {}\r\n  }\r\n}}", "ABI": "[{\"inputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"constructor\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"location\",\"type\":\"uint256\"}],\"name\":\"getById\",\"outputs\":[{\"internalType\":\"string\",\"name\":\"unit\",\"type\":\"string\"}],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"location\",\"type\":\"uint256\"},{\"internalType\":\"string\",\"name\":\"_unit\",\"type\":\"string\"}],\"name\":\"set\",\"outputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"\",\"type\":\"uint256\"}],\"name\":\"units\",\"outputs\":[{\"internalType\":\"string\",\"name\":\"\",\"type\":\"string\"}],\"stateMutability\":\"view\",\"type\":\"function\"}]", "ContractName": "UnitStorage4", "CompilerVersion": "v0.8.4+commit.c7e474f2", "OptimizationUsed": "0", "Runs": "200", "ConstructorArguments": "", "EVMVersion": "Default", "Library": "", "LicenseType": "", "Proxy": "0", "Implementation": "", "SwarmSource": ""}