{"SourceCode": "{{\r\n  \"language\": \"Solidity\",\r\n  \"sources\": {\r\n    \"contracts/storage/IStorage.sol\": {\r\n      \"content\": \"pragma solidity ^0.8.4;\\n// SPDX-License-Identifier: GPL-3.0-or-later\\n\\n// https://soliditytips.com/articles/solidity-interface-interact-with-other-contracts/\\ninterface IStorage {\\n    function getById(uint256 id) external returns (string memory unit);\\n    // Add more function signatures as needed.\\n}\"\r\n    },\r\n    \"contracts/storage/unit/UnitStorage29.sol\": {\r\n      \"content\": \"     \\npragma solidity ^0.8.4;\\n// SPDX-License-Identifier: GPL-3.0-or-later\\nimport \\\"../IStorage.sol\\\";\\n\\ncontract UnitStorage29 is IStorage{\\n    string[] public units;\\n    \\n    // set to onlyOwner()\\n    // check if value exists - \\n    constructor(){\\n       //537\\n       units.push(\\\"The circuits described above are a heuristic device: they are not inputs into a model or input/output analysis of the new economic space. The objective is to show that a single transaction, posed as a movement in a circuit, takes on different meaning according to how the circuit is being described. This is more than a statement that, to invoke Gunnar Myrdal, all points of view are views from a point (although that is important). It is that these different meanings form a spread of meaning, and therein lies fertile grounds for volatility in the system. But it is not a volatility to be eradicated as a threat; indeed it is the lifeblood of the network. Without volatility, the system would stagnate.\\\");\\n       units.push(\\\"STABILITY, VOLATILITY AND VALUE\\\");\\n       units.push(\\\"STABILITY\\\");\\n       units.push(\\\"In a distributed protocol, claims to stability cannot relate to conventional macroeconomic indicators like unemployment and GDP growth, nor to counter-cyclical policy measures. Those agendas are tasked to states: their taxing and expenditure policies and their monetary regulation capacities. Instead, claims to stability must be about the relationship between tokens and the material underliers of the network. To claim more \\\\\\\\u2013 for example, to maintain stability with respect to the US dollar or to US economic growth \\\\\\\\u2013 is not just a claim that, in practice, cannot be sustained (at least not without making this the sole purpose of a token); it is an aspiration we do not hold. A different economy, with a different set of goals and processes, is intended to diverge from the US economy; not to track its performance. This relates to our proposal that participants in the new economic space, who nonetheless remain heavily exposed to capitalist economies, will be \\\\\\\\u2018living in the spread\\\\\\\\u2019 (Chapter 1.6). The centrality of tokens in the Economic Space Protocol relates to token value stability and the capacity of tokens to facilitate economic processes in ways that tie token issuance to \\\\\\\\u2018real\\\\\\\\u2019 value and the capacity of credit issuance to the smooth operation of the network.\\\");\\n       units.push(\\\"We have the opportunity to rethink what we mean by stability. An economy may be stable in its own terms: its average return on capital, unemployment rate and exchange rate may be stable (we once could have included inflation rate and interest rates here; but no longer), but it may be unstable by other criteria such as poverty levels, life expectancy, access to health care, housing affordability or carbon emissions. When targeted metrics of a postcapitalist economy are different from those of a capitalist economy, each economy will likely appear as volatile, if not failing, when measured by the metrics of the other. We believe that the most robust claims of \\\\\\\\u2018stability\\\\\\\\u2019 cannot rest on attachment to another entity itself deemed \\\\\\\\u2018stable,\\\\\\\\u2019 without becoming a mere replica of that other entity. Stability must be a statement about self; not others. The claims to stability of the new economy are threefold:\\\");\\n       units.push(\\\"The unit of exchange/unit of credit stabilizes as the economy scales. This means the network is trusting the relationship between the credit and the network\\\\\\\\u2019s system of output valuation: in effect, new value created in the network is an accepted means to clear credit in the network.\\\");\\n       units.push(\\\"Stake prices change in an orderly way. This means that stake price reflects \\\\\\\\u2018fundamental value\\\\\\\\u2019 and the economy is producing the output it claims to produce.\\\");\\n       units.push(\\\"Volatility inside the network is a statement about the relationship between stake prices and the unit of exchange. This gives a measure of stability/volatility of \\\\\\\\u2018real\\\\\\\\u2019 network change over time and applies to both the volatility of individual stake prices and the total value of stake in the network.\\\");\\n       units.push(\\\"OUTSIDE CURRENCY WITHIN THE NETWORK\\\");\\n       units.push(\\\"A further issue of stability comes when we consider the impact of outside money within the network.[151] There is nothing stopping agents exchanging in dollars, just as they can use any object \\\\\\\\u2013 a bag of barley or a coat \\\\\\\\u2013 as a particular unit of exchange. But these will have to convert to other units for recognition across the network.\\\\\\\\n\\\\\\\\n[151] Outside money (Gurley and Shaw, 1960) could be fiat currencies or other forms like bitcoin. For simplicity we will represent outside money as \\\\\\\\u2019 dollars.\\\\\\\\u2019\\\");\\n       units.push(\\\"It has been mentioned (e.g. Chapter 10.5) that dollars can enter the network, but they do so as commodities, not as token substitutes. Entering as a commodity means that something must be \\\\\\\\u2018given up\\\\\\\\u2019 (offers of commodities or stake expressed in terms of the network unit of exchange) to acquire dollars. Nonetheless, a commodity entry of dollars does create an implicit exchange rate between the protocol unit of exchange and the dollar, for commodities and stake can be priced in either. Nonetheless, the entry of dollars and the creation of an exchange rate has significance. First, the exchange rate will impact where agents source commodities and how they fund stake, indicating that there are no clear boundaries to the network. This is the money/token dimension of living in the spread. Second, the exchange rate between the unit of exchange of the Economic Space Protocol and the dollar will likely be volatile. This doesn\\\\\\\\u2019t challenge the stability of the unit of exchange within the new economy\\\\\\\\u2019s token system; indeed, over time, the question will be whether it is the network\\\\\\\\u2019s unit of exchange or the dollar which is to be described as \\\\\\\\u2018volatile.\\\\\\\\u2019 In that optimistic statement lies the expression of the political battle for legitimacy of the new economic space.\\\");\\n       units.push(\\\"VOLATILITY\\\");\\n       units.push(\\\"With stability defined by reference to the value of outputs in the new economic space (see Appendix 12.2), there is no juxtaposition of stability and volatility. The goal is not to reduce volatility in the name of stability, but to recognize that volatility is integral to financial markets and to risk. The goal is to direct volatility and see that it occurs in parts of the system where there is \\\\\\\\u2018intentional\\\\\\\\u2019 indeterminacy; where it expresses flexibility, discovery and the estimation of risk and of value. Agents creating performances, purchasing stake, and changing their minds about which performances are value-creating, will generate welcome volatility as the pulse of the new economy. Each of these can be thought of as financial spreads, in which agents take positions.\\\");\\n       units.push(\\\"So volatility can be both essential to dynamism and itself convey valuable information. We know that in conventional capital markets, the development and trading of real-time volatility indices is seen as a critical market indicator. Inside a volatile market there are standard strategies for hedging to neutralize volatility (\\\\\\\\u2018delta hedging\\\\\\\\u2019) and, moreover, to profit from trading volatility itself, stripped of directionality (Lee, 2020).\\\");\\n       units.push(\\\"We are not seeking to initiate the development of volatility-trading markets in the Economic Space Protocol (though nor do we hold a view as to the likelihood or merits of their development). The emergence of DeFi opens significant potential for these markets. Yet for all the potential of DeFi, it is currently just replicating the calculus of mainstream finance. While adding flexibility and capacity to agents, it also has potential of leveraging instability for its own sake.\\\");\\n       units.push(\\\"There are (as yet) no techniques for modeling current volatility in crypto markets. Any suggestion that DeFi can offer a cryptoeconomy financial tools to accurately measure (and hence delta hedge) volatility should be treated skeptically. Volatility is an expression not just of inefficiency of estimation but of social dynamics expressed in financial channels. Managing the channels does not itself stabilize social dynamics: it causes volatility to displace into other modes of expression. So for the Economic Space Protocol, there is no intention to control volatility with the goal of restricting it, but to direct it to sites where it can be embraced (as potential). Accordingly, volatility has two central roles.\\\");\\n       units.push(\\\"First, the information generated in markets has to be interrogated for patterns that can be given economic meanings as \\\\\\\\u2018performances\\\\\\\\u2019: offers of data analytics. Volatility here will be associated with the issuance of stake in those performances. But such performances carry risks, there can be no certainty about which performance designs will generate information which is valued by the network.[152] For any particular performance, this source of volatility can be expected to diminish as the performance becomes statistically consolidated; with new performances continually being configured, the domain of the issuance of stake itself remains an on-going site of volatility.\\\\\\\\n\\\\\\\\n[152] In effect, the distinction between \\\\\\\\u2018noise\\\\\\\\u2019 and \\\\\\\\u2018real information\\\\\\\\u2019 (Black, 1986) cannot be known in advance.\\\");\\n       units.push(\\\"Secondly, the value of staked positions will change constantly as agents change their views about what performances are successful (valuable). This will be a domain of continual volatility, for volatility is the condition of liquidity in the market for stakes.\\\");\\n       units.push(\\\"It will be apparent that, in practice, the two volatilities will not be discrete: the first will embed expectations about the second, and the second will reflect levels of confidence in the first. The network has capacity to trace which economic events are associated with which stake price changes. This can be thought of as feedback loops on performance staking, vetting the values of past performance designs and giving incentives for agents to design more precise/granular performances.\\\");\\n       //555\\n    }\\n    function set(uint256 location, string calldata _unit) external {\\n        units[location] = _unit;\\n    }\\n    function getById(uint256 location) external override returns (string memory unit) {\\n        return units[location];\\n    }\\n\\n}\"\r\n    }\r\n  },\r\n  \"settings\": {\r\n    \"optimizer\": {\r\n      \"enabled\": false,\r\n      \"runs\": 200\r\n    },\r\n    \"outputSelection\": {\r\n      \"*\": {\r\n        \"*\": [\r\n          \"evm.bytecode\",\r\n          \"evm.deployedBytecode\",\r\n          \"devdoc\",\r\n          \"userdoc\",\r\n          \"metadata\",\r\n          \"abi\"\r\n        ]\r\n      }\r\n    },\r\n    \"libraries\": {}\r\n  }\r\n}}", "ABI": "[{\"inputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"constructor\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"location\",\"type\":\"uint256\"}],\"name\":\"getById\",\"outputs\":[{\"internalType\":\"string\",\"name\":\"unit\",\"type\":\"string\"}],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"location\",\"type\":\"uint256\"},{\"internalType\":\"string\",\"name\":\"_unit\",\"type\":\"string\"}],\"name\":\"set\",\"outputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"\",\"type\":\"uint256\"}],\"name\":\"units\",\"outputs\":[{\"internalType\":\"string\",\"name\":\"\",\"type\":\"string\"}],\"stateMutability\":\"view\",\"type\":\"function\"}]", "ContractName": "UnitStorage29", "CompilerVersion": "v0.8.4+commit.c7e474f2", "OptimizationUsed": "0", "Runs": "200", "ConstructorArguments": "", "EVMVersion": "Default", "Library": "", "LicenseType": "", "Proxy": "0", "Implementation": "", "SwarmSource": ""}