// SPDX-License-Identifier: MIT

pragma solidity ^0.8.0;

/// @title: Untold stories
/// @author: manifold.xyz

import "./manifold/ERC721Creator.sol";

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//                                                                                                                                                                                       //
//                                                                                                                                                                                       //
//    D̵͙͕̀̒͑͜V̸̡͓͓͛͋K̴̢̞̒͐̾ D̵͙͕̀̒͑͜V̸̡͓͓͛͋K̴̢̞̒͐̾           D̵͙͕̀̒͑͜V̸̡͓͓͛͋K̴̢̞̒͐̾                  D̵͙͕̀̒͑͜V̸̡͓͓͛͋K̴̢̞̒͐̾     D̵͙͕̀̒͑͜V̸̡͓͓͛͋K̴̢̞̒͐̾       D̵͙͕̀̒͑͜V̸̡͓͓͛͋K̴̢̞̒͐̾     //
//    D̵͙͕̀̒͑͜V̸̡͓͓͛͋K̴̢̞̒͐̾    D̵͙͕̀̒͑͜V̸̡͓͓͛͋K̴̢̞̒͐̾         D̵͙͕̀̒͑͜V̸̡͓͓͛͋K̴̢̞̒͐̾                D̵͙͕̀̒͑͜V̸̡͓͓͛͋K̴̢̞̒͐̾      D̵͙͕̀̒͑͜V̸̡͓͓͛͋K̴̢̞̒͐̾      D̵͙͕̀̒͑͜V̸̡͓͓͛͋K̴̢̞̒͐̾      //
//    D̵͙͕̀̒͑͜V̸̡͓͓͛͋K̴̢̞̒͐̾      D̵͙͕̀̒͑͜V̸̡͓͓͛͋K̴̢̞̒͐̾        D̵͙͕̀̒͑͜V̸̡͓͓͛͋K̴̢̞̒͐̾              D̵͙͕̀̒͑͜V̸̡͓͓͛͋K̴̢̞̒͐̾       D̵͙͕̀̒͑͜V̸̡͓͓͛͋K̴̢̞̒͐̾     D̵͙͕̀̒͑͜V̸̡͓͓͛͋K̴̢̞̒͐̾       //
//    D̵͙͕̀̒͑͜V̸̡͓͓͛͋K̴̢̞̒͐̾        D̵͙͕̀̒͑͜V̸̡͓͓͛͋K̴̢̞̒͐̾       D̵͙͕̀̒͑͜V̸̡͓͓͛͋K̴̢̞̒͐̾            D̵͙͕̀̒͑͜V̸̡͓͓͛͋K̴̢̞̒͐̾        D̵͙͕̀̒͑͜V̸̡͓͓͛͋K̴̢̞̒͐̾   D̵͙͕̀̒͑͜V̸̡͓͓͛͋K̴̢̞̒͐̾         //
//    D̵͙͕̀̒͑͜V̸̡͓͓͛͋K̴̢̞̒͐̾        D̵͙͕̀̒͑͜V̸̡͓͓͛͋K̴̢̞̒͐̾        D̵͙͕̀̒͑͜V̸̡͓͓͛͋K̴̢̞̒͐̾          D̵͙͕̀̒͑͜V̸̡͓͓͛͋K̴̢̞̒͐̾         D̵͙͕̀̒͑͜V̸̡͓͓͛͋K̴̢̞̒͐̾D̵͙͕̀̒͑͜V̸̡͓͓͛͋K̴̢̞̒͐̾            //
//    D̵͙͕̀̒͑͜V̸̡͓͓͛͋K̴̢̞̒͐̾        D̵͙͕̀̒͑͜V̸̡͓͓͛͋K̴̢̞̒͐̾         D̵͙͕̀̒͑͜V̸̡͓͓͛͋K̴̢̞̒͐̾        D̵͙͕̀̒͑͜V̸̡͓͓͛͋K̴̢̞̒͐̾          D̵͙͕̀̒͑͜V̸̡͓͓͛͋K̴̢̞̒͐̾  D̵͙͕̀̒͑͜V̸̡͓͓͛͋K̴̢̞̒͐̾          //
//    D̵͙͕̀̒͑͜V̸̡͓͓͛͋K̴̢̞̒͐̾        D̵͙͕̀̒͑͜V̸̡͓͓͛͋K̴̢̞̒͐̾          D̵͙͕̀̒͑͜V̸̡͓͓͛͋K̴̢̞̒͐̾      D̵͙͕̀̒͑͜V̸̡͓͓͛͋K̴̢̞̒͐̾           D̵͙͕̀̒͑͜V̸̡͓͓͛͋K̴̢̞̒͐̾    D̵͙͕̀̒͑͜V̸̡͓͓͛͋K̴̢̞̒͐̾        //
//    D̵͙͕̀̒͑͜V̸̡͓͓͛͋K̴̢̞̒͐̾      D̵͙͕̀̒͑͜V̸̡͓͓͛͋K̴̢̞̒͐̾             D̵͙͕̀̒͑͜V̸̡͓͓͛͋K̴̢̞̒͐̾    D̵͙͕̀̒͑͜V̸̡͓͓͛͋K̴̢̞̒͐̾            D̵͙͕̀̒͑͜V̸̡͓͓͛͋K̴̢̞̒͐̾     D̵͙͕̀̒͑͜V̸̡͓͓͛͋K̴̢̞̒͐̾       //
//    D̵͙͕̀̒͑͜V̸̡͓͓͛͋K̴̢̞̒͐̾    D̵͙͕̀̒͑͜V̸̡͓͓͛͋K̴̢̞̒͐̾                D̵͙͕̀̒͑͜V̸̡͓͓͛͋K̴̢̞̒͐̾  D̵͙͕̀̒͑͜V̸̡͓͓͛͋K̴̢̞̒͐̾             D̵͙͕̀̒͑͜V̸̡͓͓͛͋K̴̢̞̒͐̾      D̵͙͕̀̒͑͜V̸̡͓͓͛͋K̴̢̞̒͐̾      //
//    D̵͙͕̀̒͑͜V̸̡͓͓͛͋K̴̢̞̒͐̾D̵͙͕̀̒͑͜V̸̡͓͓͛͋K̴̢̞̒͐̾                     D̵͙͕̀̒͑͜V̸̡͓͓͛͋K̴̢̞̒͐̾D̵͙͕̀̒͑͜V̸̡͓͓͛͋K̴̢̞̒͐̾              D̵͙͕̀̒͑͜V̸̡͓͓͛͋K̴̢̞̒͐̾       D̵͙͕̀̒͑͜V̸̡͓͓͛͋K̴̢̞̒͐̾     //
//                                                                                                                                                                                       //
//                                                                                                                                                                                       //
//                                                                                                                                                                                       //
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


contract DVK is ERC721Creator {
    constructor() ERC721Creator("Untold stories", "DVK") {}
}