// SPDX-License-Identifier: MIT

pragma solidity ^0.8.0;

/// @title: 非対称
/// @author: manifold.xyz

import "./ERC721Creator.sol";

///////////////////////////////////////////////////
//                                               //
//                                               //
//           ,.,                                 //
//            SSSS_    ,..,                      //
//              "_ "__"SSSSS          ,...,,     //
//       ,..., __." --"    ,.,     _-"SSSSSSS    //
//      SSSSSS"___ "_._   SSS"_."" _ """"""      //
//       """""    "" , \_.   "_. ."              //
//              ,., _"__ \__./ ."                //
//             SSSSS_"  "_    ./                 //
//              ''''      (    )                 //
//       ._______________.-'____"---._.          //
//        \                          /           //
//         \________________________/            //
//         (_)                    (_)            //
//                                               //
//                                               //
///////////////////////////////////////////////////


contract HTSHO is ERC721Creator {
    constructor() ERC721Creator(unicode"非対称", "HTSHO") {}
}