// SPDX-License-Identifier: MIT

pragma solidity ^0.8.0;

/// @title: officialivelina
/// @author: manifold.xyz

import "./manifold/ERC721Creator.sol";

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//                                                                                                                                                                                               //
//                                                                                                                                                                                               //
//                                                                                                                                                                                               //
//        𝐈𝐕𝐄𝐋𝐈𝐍𝐀𝐈𝐕𝐄𝐋𝐈𝐍𝐀   𝐋𝐈𝐍𝐀 𝐈𝐕𝐄𝐋𝐈𝐍𝐀𝐈𝐕𝐄𝐋  𝐈𝐕𝐄𝐋𝐈𝐍𝐀   𝐈𝐕𝐄𝐋𝐈𝐍𝐀  𝐈𝐕𝐄𝐋𝐈𝐍𝐀    𝐈𝐕𝐄       .𝐋.                                                   //
//        `𝐈𝐕𝐄'  `𝐋𝐈𝐍.     .𝐀'  `𝐈𝐕𝐄'     `! `𝐋𝐈𝐍𝐀'    `𝐈𝐕𝐄'    `𝐈𝐕𝐄𝐋.     `𝐈'      .𝐕𝐄𝐋.                                                                               //
//         𝐈𝐕𝐄    `𝐋𝐈𝐍.   .𝐀'    𝐈𝐕𝐄          𝐋𝐈𝐍𝐀      𝐈𝐕𝐄      𝐈 `𝐕𝐄𝐋.    𝐈      .𝐕"𝐄𝐋𝐈.                                                                             //
//         𝐈𝐕𝐄     `𝐋𝐈𝐍. .𝐀'     𝐈𝐕𝐄𝐋𝐈𝐍𝐀      𝐋𝐈𝐍𝐀      𝐈𝐕𝐄      𝐈  𝐕`𝐄𝐋𝐈.  𝐍     .𝐀' `𝐈𝐕𝐄.                                                                       //
//         𝐈𝐕𝐄      `𝐋𝐈𝐍.𝐀'      𝐈𝐕𝐄    "     𝐋𝐈𝐍𝐀      𝐈𝐕𝐄      𝐈     `𝐕𝐄𝐋.𝐈    .𝐍𝐀𝐈𝐕𝐄𝐋𝐈𝐍𝐀.                                                                      //
//         𝐈𝐕𝐄       `𝐋𝐈𝐍'       𝐈𝐕𝐄       ~  𝐋𝐈𝐍𝐀   ~  𝐈𝐕𝐄      𝐈       `𝐕𝐄𝐋   .𝐈'     `𝐍𝐀𝐈.                                                                            //
//        𝐈𝐕𝐄𝐋𝐈𝐍𝐀     `𝐀'       𝐈𝐕𝐄𝐋𝐈𝐍𝐀𝐈𝐕𝐄𝐋  𝐈𝐕𝐄𝐋𝐈𝐍𝐀𝐈𝐕 𝐈𝐕𝐄𝐋𝐈𝐍𝐀  𝐈𝐕𝐄        `𝐋  𝐈𝐍𝐀     𝐈𝐕𝐄𝐋𝐈𝐍𝐀                                                  //
//                                                                                                                                                                                               //
//                                                                                                                                                                                               //
//                                                                                                                                                                                               //
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


contract officialivelina is ERC721Creator {
    constructor() ERC721Creator("officialivelina", "officialivelina") {}
}