// SPDX-License-Identifier: MIT

pragma solidity ^0.8.0;

/// @title: AI made me a monster
/// @author: manifold.xyz

import "./manifold/ERC1155Creator.sol";

////////////////////////////////////////////////////////////////////////////////////////////////////////////
//                                                                                                        //
//                                                                                                        //
//                                  a͍͖̟i̡̙͜ m̞̠̟a͖̫̘d̙͚͉e͙̼̦ m͎̘̝e͔͖͜ a̦̝͍ m͇̠͜o̺̫̟n͉͍s̞͚̫t̘̪e̢̢̺r͙̝̼    //
//                                                                                                        //
//                                                                                                        //
//                                                                                                        //
//                                                                                                        //
//                           *.    ,/      &  .    / .                                                    //
//                          *  *  ,  (        ..   ,  *                                                   //
//                         *  ,.   ,. ,   .    .  .                                                       //
//                         /          /   ,    &  %                                                       //
//                         (    *         %    .  /         ,                                             //
//                         .    ,.                     *   @   .                                          //
//                                     (               #                                                  //
//                               ,     . ,       %     .  *                                               //
//                         .     (       /               #    /                                           //
//                         (     /       #      *     ( ,                                                 //
//             .           .     *       .      .     %#     (                                            //
//           . .    ,      /                          ,                                                   //
//             /%      ,                                    &                                             //
//              #        (#                                 *                                             //
//                .                                         #                                             //
//                  ,                                                                                     //
//                    %                                    .                                              //
//                                                         %                                              //
//                       %                                                                                //
//                         *                              (                                               //
//                                                                                                        //
//                            .   ,                                                                       //
//                              .   .                                                                     //
//                               .                                                                        //
//                                ,                    %                                                  //
//                                /                                                                       //
//                                                    *                                                   //
//                                                                                                        //
//                                                                                                        //
//                                                                                                        //
//                                                                                                        //
//                                                                                                        //
//                                                                                                        //
////////////////////////////////////////////////////////////////////////////////////////////////////////////


contract AIhands is ERC1155Creator {
    constructor() ERC1155Creator("AI made me a monster", "AIhands") {}
}