{"SourceCode": "{{\r\n  \"language\": \"Solidity\",\r\n  \"sources\": {\r\n    \"contracts/storage/IStorage.sol\": {\r\n      \"content\": \"pragma solidity ^0.8.4;\\n// SPDX-License-Identifier: GPL-3.0-or-later\\n\\n// https://soliditytips.com/articles/solidity-interface-interact-with-other-contracts/\\ninterface IStorage {\\n    function getById(uint256 id) external returns (string memory unit);\\n    // Add more function signatures as needed.\\n}\"\r\n    },\r\n    \"contracts/storage/unit/UnitStorage32.sol\": {\r\n      \"content\": \"     \\npragma solidity ^0.8.4;\\n// SPDX-License-Identifier: GPL-3.0-or-later\\nimport \\\"../IStorage.sol\\\";\\n\\ncontract UnitStorage32 is IStorage{\\n    string[] public units;\\n    \\n    // set to onlyOwner()\\n    // check if value exists - \\n    constructor(){\\n        //594\\n       units.push(\\\"First is the emergence of a digital economy, which provides the technology to build that digital future, even though it is also integral to many of the incapacities of current capitalism to meet many social needs (notably well-paying \\\\\\\\u2018jobs\\\\\\\\u2019);\\\");\\n       units.push(\\\"Second is the risks that people are currently experiencing in their individual and collective lives: most obviously the risks of individual financial precarity on the one hand, and environmental destruction on the other. We are not trying to eliminate risk: we want to initiate social and economic relations where people can choose to risk in the creation of new things, to do so in creative, cooperative ways, and to have those creations valued socially. This will include, but is not restricted to, risking to innovate to address issues of inequality and environmental destruction.\\\");\\n       units.push(\\\"Third is the rise to economic and social dominance of a culture of financial calculation. Individually, this is expressed as the need for debt to acquire housing or gain education or, for too many, to undertake daily subsistence. This rise is integral to the current acceleration of a wide range of inequalities and poverties. Currently, this culture is expressed in the rise of banking and insurance as a site of both political power and economic crisis creation, but also a site of extraordinary innovation. We seek to take over that innovation.\\\");\\n       units.push(\\\"So we have adapted the capacities of post-blockchain technologies for protocol design to create ways for people in a network to risk together using financial techniques of staking, derivatives, liquidity, volatility, etc.. We are creating an economic media for postcapitalism.\\\");\\n       units.push(\\\"This innovation has required that we redesign elements of economic and social language and analysis. For some readers, this will have taken them through debates and specifications that felt excessively detailed, and perhaps even at points semantic, but we believe that language is important. The old categories always pull us back to old ways of posing and answering problems. Our project has seen us, over quite some time, imagining future economic possibilities and then having to configure the categories as well as the analysis that will bring them coherence. It has, we agree, made for a challenging read. Nonetheless, we are confident that, for all this analytical detail, when it comes to being part of the network and living in the performances it enables, the operational design can be quite simple.\\\");\\n       units.push(\\\"To get to that stage, where people are living at least aspects of their lives in a new economic space, more development work will be needed. This document has intentionally left unaddressed how the new economic space has a financial bridge to the capital markets, and a full exploration of the \\\\\\\\u2018outside spread\\\\\\\\u2019 that will likely drive capital market engagement with the new economic space. These developments await responses to the current document.\\\");\\n       units.push(\\\"These are complex, but solvable issues. They become solvable not because there is a decisive answer but because protocol design embeds indeterminacy, volatility and ambiguity. The question will be whether the Economic Space Protocol has embedded them in coherent ways that enable creative adaptation of agent practices and of the protocol itself. For now, we present the network as its own internal logic; as a way of depicting a viable, evolving, distributed postcapitalism, where participants design their own futures, both individually and collectively.\\\");\\n       units.push(\\\"So we now invite feedback, debate and expressions of interest from diverse sources, but especially from people and their organizations who can see in this proposal new ways of addressing social problems they have always known, or who now sense a potential for change they could not previously have imagined possible.\\\");\\n       //601\\n       units.push(\\\"Accounting is not only historically the first form of writing, a method for expressing, organizing, managing and archiving information. It is also maybe our earliest distributed economic communication and networking protocol. As a collaborative record-keeping and calculation system based on simple arithmetic, it is used to organize and record our transactions in a ledger or a book of accounts. Through accounting, every transaction is recorded in at least two ledgers. To reflect what I transfer to you, you make a positive entry in your ledger: a credit; I make a negative one of a matching amount in mine: a debit. To record the transfer going the other way around, I make a positive entry in my ledger, and you make a negative one in yours. We distribute our transaction record across two mutually referring ledgers. Together, through this practice, we create a fundamentally networked, non-hierarchical, and distributed record-keeping system: A distributed ledger. The key insight of accounting ECSA has followed is that we are able to cooperate, coordinate and form relationships by just sharing a practice and rules about it - with no need for a global shared ledger. Accounting practices contain rules and procedures that determine how to classify and record information, how to change it, verify it, and compile and communicate it. Through the accounting practice we agree to connect not only instantaneously but across time through accounting notions like assets and liabilities. A liability entry in my ledger is an asset entry in yours. Your present right is my promise and future obligation. The matching credits and debits that we record indicate the transfer of anything and how much of it: They describe a value flow between us. Every transaction we make records our operations and necessarily connects our ledgers. The accounting information binds together a network and coordinates our activities and those we transact with: it is a record-keeping and calculation system, but more importantly, a communication and organization system. As a record-keeping, communication and calculation agreement between two or more parties, accounting is in effect a network computation agreement. This is the definition of a network protocol. As a protocol, it does not dictate what we enter into the ledger, only how we must enter it; it does not determine the amounts we record, only that we record amounts. As a protocol accounting serves the function of storage, retrieval, and verification of the integrity of information. But why do we use it? We record in the ledger our tacit response to an essential economic question: \\\\\\\\u201Cwhat is valuable?\\\\\\\\u201D The transactions on the ledgers that document our exchange reflect a practical agreement on what we value of each other. The amounts we record using accounting respond to another question: \\\\\\\\u201CHow valuable is it?\\\\\\\\u201D The ledger entries embed a transaction as a measurement: an exchange rate that reflects the \\\\\\\\u201Cvalue\\\\\\\\u201D we give to one thing in terms of another. In other words, accounting is a value communication network. The accounting practice, whether recording on clay, tablet, or paper, binds together a network of bookkeepers and their ledgers. As such, historically, it formed a rudimentary distributed computational medium. Now, when computational networks are our new medium that host the record-keeping and the calculation - historically undertaken by slower mediums - the updates on our ledgers, our transactions, are rendered incredibly fast and incredibly vast. ECSA is building directly on this insight. See Jorge Lopez (2022): Economy as a reprogrammable communication medium.\\\");\\n       units.push(\\\"(1) Agency means the capability to operate and navigate a space-time. \\\\\\\\n(2) An agency is a network of agents appearing and acting together as a coherent whole without any central decision making. A contractual relationship of many to many via a network derivative. Also known as the collective agent, composite agent, synthetic agent, derivative agent, distributed agent, derivative communitsy. Agencies may be public or private, uniquely identifiable and able to participate in other economic spaces as a coherent whole. Through such composite agent we enable the creation of large scale collaborative organizational networks. Agency is a view on the network: when viewing agents in these networks, organized around and participating in a specific performance, we refer to them as agencies. Agency is a new understanding of an issuance around a performance: though there is no one central issuer but instead a whole network of (distributed) issuers and issuances, it expresses that it is the whole group - the coming together of separate agents - that is actually creating the value that is tokenized and getting captured by the performance.\\\");\\n       units.push(\\\"An agent is a node in a network that holds its own ledger and communicates through a protocol with other nodes. An agent is both \\\\\\\\u201Cseparate from\\\\\\\\u201D and \\\\\\\\u201Cconnected to\\\\\\\\u201D other nodes in the network. An economic space agent is a native citizen in the new economic space: it has a private space, is able to issue and hold rights, to accept and receive offers and it has an internal ordered event timeline (its own \\\\\\\\u201Cblockchain\\\\\\\\u201D). All agents can be issuers and clearers, engage in creation of credit, collateral, stake and other financial relationships. Peering together through a shared protocol - a shared economic grammar - agents form a networked economic system with privacy preserving, scalable architecture, with no central data broker, host or owner.\\\");\\n       units.push(\\\"In finance, an arbitrage is any trade that makes a riskless profit by buying and selling the same asset at different prices simultaneously. The TV series _Westworld_ (Season 4) pursues the thesis that computing \\\\\\\\u2013 as the agglomeration of the knowledge and know-how of humanity put to business purposes \\\\\\\\u2013 will preside over the subsumption of not just human history, but human existence. Computing represents an arbitrage on intelligence that cheapens and discounts life. Because computing is inexorably entwined with existing markets and the statistical and predictive strategies necessary for the optimization of returns, computing takes over species-being as it rapidly becomes the species-grave. The only \\\\\\\\u2018creature\\\\\\\\u2019 who will be left to remember whatever beauty, alternative values, grace and capacity for love that may have been expressed in the centuries of human emergence, is an AI. Contrary to this, the ECSA arbitrage on intelligence is to reduce the cost to the planet for collective re-imagination and re-organization, while also collectivizing the returns on the benefits of creating more convivial forms of life. For more, see Jonathan Beller (2023): On Economic Intelligence. See Dangerous play. See Authoring futures.\\\");\\n       units.push(\\\"Accounting notions that connect agents across time. A liability entry in my ledger is an asset entry in yours. Your present right is my promise and future obligation. Accounting protocol serves us by organizing our pasts but our futures too. In the economic space protocol an asset is a transferable and divisible smart contract that encodes the ownership on a set of rights, that may trigger a network performance. See Network asset. See Accounting. See Token.\\\");\\n       units.push(\\\"ECSA is aiming to open up the medium, the language, of economy. Why? Because we want to decentralize the authorship of futures. ECSA wants to open source what remained still centralized in the social media: the information and protocol layer called the economy. We want to create a more expressive language to describe our economic networks \\\\\\\\u2013 what kind of participants they have, what they produce, what they value, what are their relationships and how they change \\\\\\\\u2013 and this language equally available and accessible for everybody. We want to do this, because the nature of our economic networks is bound by the expressivity of the language that can conceive them. See Economic network.\\\");\\n       units.push(\\\"The capability to set attractors for one\\\\\\\\u2019s own behavior. See Governance. See Strange attractor.\\\");\\n       units.push(\\\"The Big Put \\\\\\\\u2013 an ECSA concept inspired by the film _The Big Short_ \\\\\\\\u2013 is the means to put the risks of capitalism\\\\\\\\u2019s fragility back onto the market. Another name for the ECSA\\\\\\\\u2019s capital market facing token. Big Put is a play both on the capitalist desire to short itself (because it knows it is wasteful, fragile & unstable: a cultural-financial asset in decline) and the spread that will emerge between the network capacities of the existing capitalist economic network and the postcapitalist economic network: a spread between their expressive power, stability, accessibility, fairness of distribution, adaptability, scalability, privacy, functional equality and programmability. ECSA poses a question: On which side of the spread do you want to be when more and more people start to realize how much more expressive the postcapitalist economic network is?\\\");\\n       units.push(\\\"The process by which the value of illiquid investments can be made liquid \\\\\\\\u2013 used as money \\\\\\\\u2013 without having to be liquidated. This is done by allowing capital markets to price and hedge risk, at which point the difference between any asset and money can be priced out and disaggregated. Can be argued that in capitalism the process has found its limit, and the difference between social wealth and money is completely abolished. Capitalism is becoming-money of all social wealth.\\\");\\n       units.push(\\\"A decentralized economy with centralized state and money issuance that is driven by private property and the pursuit of profit. Financially, a system with hierarchical financial institutions and assets defined and measured by reference to what creates profit. The result: becoming-money of all social wealth. As such, fundamentally a wasteful, fragile & unstable economic system: a cultural-financial asset in decline. Dangerous in the way being long capitalism aggressively shorts the environment and the qualitative dimensions of our life and society.\\\");\\n       units.push(\\\"Chartalist money is state backed money. The term comes from the Latin word \\\\\\\\u0022charta\\\\\\\\u0022, meaning a ticket or a token that may be accepted as payment, but which do not have intrinsic value. The Chartalist theory of money defines money as a creation of the government and as having value in exchange because sovereign power requires taxes to be paid on the money they issue. Furthermore, Chartalists understand money originating historically with states\\\\\\\\u2019 attempts to direct economic activity rather than as a spontaneous solution to \\\\\\\\u201Ccoincidence of wants\\\\\\\\u201D or as a means with which to tokenize debt. Paved way for Modern Monetary Theory (MMT).\\\");\\n    }\\n    function set(uint256 location, string calldata _unit) external {\\n        units[location] = _unit;\\n    }\\n    function getById(uint256 location) external override returns (string memory unit) {\\n        return units[location];\\n    }\\n\\n}\"\r\n    }\r\n  },\r\n  \"settings\": {\r\n    \"optimizer\": {\r\n      \"enabled\": false,\r\n      \"runs\": 200\r\n    },\r\n    \"outputSelection\": {\r\n      \"*\": {\r\n        \"*\": [\r\n          \"evm.bytecode\",\r\n          \"evm.deployedBytecode\",\r\n          \"devdoc\",\r\n          \"userdoc\",\r\n          \"metadata\",\r\n          \"abi\"\r\n        ]\r\n      }\r\n    },\r\n    \"libraries\": {}\r\n  }\r\n}}", "ABI": "[{\"inputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"constructor\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"location\",\"type\":\"uint256\"}],\"name\":\"getById\",\"outputs\":[{\"internalType\":\"string\",\"name\":\"unit\",\"type\":\"string\"}],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"location\",\"type\":\"uint256\"},{\"internalType\":\"string\",\"name\":\"_unit\",\"type\":\"string\"}],\"name\":\"set\",\"outputs\":[],\"stateMutability\":\"nonpayable\",\"type\":\"function\"},{\"inputs\":[{\"internalType\":\"uint256\",\"name\":\"\",\"type\":\"uint256\"}],\"name\":\"units\",\"outputs\":[{\"internalType\":\"string\",\"name\":\"\",\"type\":\"string\"}],\"stateMutability\":\"view\",\"type\":\"function\"}]", "ContractName": "UnitStorage32", "CompilerVersion": "v0.8.4+commit.c7e474f2", "OptimizationUsed": "0", "Runs": "200", "ConstructorArguments": "", "EVMVersion": "Default", "Library": "", "LicenseType": "", "Proxy": "0", "Implementation": "", "SwarmSource": ""}