// SPDX-License-Identifier: MIT

pragma solidity ^0.8.0;

/// @title: 𝕊𝕟𝕠𝕨𝕪 ℝ𝕒𝕓𝕓𝕚𝕥
/// @author: manifold.xyz

import "./manifold/ERC721Creator.sol";

//////////////////////////////////////////////////////////////////////////////
//                                                                          //
//                                                                          //
//    sʜᴇ ɪs ᴀ ʟɪᴛᴛʟᴇ sᴘɪʀɪᴛ ᴏғ sɴᴏᴡ ʟᴀɴᴅ ᴏғ ᴛʜᴇ ᴡᴏʀʟᴅ's ғɪʀsᴛ sᴜɴʀɪsᴇ.     //
//    ᴀɴᴅ ɪᴛ ɪs ʜᴇʀ ʀᴏᴜᴛɪɴᴇ ᴛᴏ ɢʀᴇᴇᴛ ᴀ ɴᴇᴡ ᴅᴀʏ.                             //
//                                                                          //
//    ʙᴜᴛ ᴛᴏᴅᴀʏ ɪs ᴀ ʟɪᴛᴛʟᴇ ʙɪᴛ ᴅɪғғᴇʀᴇɴᴛ ᴅᴀʏ.                              //
//                                                                          //
//    ɴᴇᴡ ʏᴇᴀʀ. ɴᴇᴡ sᴛᴀʀᴛ.                                                  //
//    ʟɪᴋᴇ ᴀ ᴅᴀʏ ᴏɴʟʏ ғᴏʀ ʜᴇʀ.                                              //
//                                                                          //
//    𝙔𝙚𝙨, 𝙃𝙖𝙥𝙥𝙮 𝙍𝙖𝙗𝙗𝙞𝙩'𝙨 𝙮𝙚𝙖𝙧!                          //
//                                                                          //
//                                                                          //
//////////////////////////////////////////////////////////////////////////////


contract RBT is ERC721Creator {
    constructor() ERC721Creator(unicode"𝕊𝕟𝕠𝕨𝕪 ℝ𝕒𝕓𝕓𝕚𝕥", "RBT") {}
}